
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Если Объект.Организация.Пустая() Тогда
			ОбщегоНазначения.УстановитьОрганизациюВДокументе(Объект);
		КонецЕсли;
	КонецЕсли;
	Если Объект.Месяц<>'00010101' Тогда
		МесяцСтрокой=Формат(Объект.Месяц, "ДФ='ММММ гггг'");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("ОбщаяФорма.ВыборПериода",новый Структура("Год",Год(Объект.Дата)),Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	МесяцСтрокой=Формат(ВыбранноеЗначение, "ДФ='ММММ гггг'");
	Объект.Месяц=ВыбранноеЗначение;
	Объект.ДатаНачалаПериода=НачалоМесяца(ВыбранноеЗначение);
	Объект.ДатаОкончанияПериода=КонецМесяца(ВыбранноеЗначение);
КонецПроцедуры
