
Процедура ПередЗаписью(Отказ, Замещение)
	ДатаПроверки=ТекущаяДата()-(60*60*25);
	Если  ЭтотОбъект.ДополнительныеСвойства.Свойство("ТехническаяЗапись") тогда
		Если  ЭтотОбъект.ДополнительныеСвойства.ТехническаяЗапись тогда
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	
	//Очистка устаревшений данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSКорзинаНоменклатуры.КлючДанных
		|ИЗ
		|	РегистрСведений.итWMSКорзинаНоменклатуры КАК итWMSКорзинаНоменклатуры
		|ГДЕ
		|	итWMSКорзинаНоменклатуры.ДатаЗаписи < &ДатаПроверки
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSКорзинаНоменклатуры.КлючДанных";
	
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НабораЗаписей=РегистрыСведений.итWMSКорзинаНоменклатуры.СоздатьНаборЗаписей();
	НабораЗаписей.Отбор.КлючДанных.Установить(ВыборкаДетальныеЗаписи.КлючДанных);
	НабораЗаписей.Прочитать();
	НабораЗаписей.ДополнительныеСвойства.Вставить("ТехническаяЗапись",Истина);
	НабораЗаписей.Очистить();
	НабораЗаписей.Записать();
	КонецЦикла;
	


КонецПроцедуры
