#Если НаСервере тогда
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ГрафикРаботыСотрудников=Движения.ГрафикРаботыСотрудников;
	ГрафикРаботыСотрудников.Очистить();
	ГрафикРаботыСотрудников.Записать();
	ГрафикРаботыСотрудников.Записывать=Истина;
	Для Каждого стр Из ДанныеСотрудников Цикл
		НоваяСтрока=ГрафикРаботыСотрудников.Добавить();
		НоваяСтрока.ГоловнаяОрганизация=Организация;
		НоваяСтрока.ГрафикРаботы=График;
		НоваяСтрока.Период=Дата;
		НоваяСтрока.Сотрудник=стр.Сотрудник;
		НоваяСтрока.Регистратор=Ссылка;
		Если ДатаОграниченияДействияГрафика <> '00010101' Тогда
        НоваяСтрока.ДействуетДо=ДатаОграниченияДействияГрафика;			
		КонецЕсли;
	КонецЦикла;
	ГрафикРаботыСотрудников.Записать();
КонецПроцедуры

#КонецЕсли