
&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Если Элементы.ЯчейкаПолучательИзменение.Видимость Тогда 
		Если ЯчейкаПолучательИзменение.Пустая() тогда
			Сообщить("Укажите ячейку получатель");
			Возврат
		КонецЕсли;	
	КонецЕсли;
	Если ТипЗнч(Параметры.ДанныеВыбора) = тип("Структура") тогда
	ДанныеВыбора=Параметры.ДанныеВыбора;
	ДанныеВыбора.Вставить("Количество",Количество);
	ДанныеВыбора.Вставить("ЯчейкаПолучательИзменение",ЯчейкаПолучательИзменение);
	ВладелецФормы.ДанныеВыбораНоменклатурыВыборКонец(ДанныеВыбора);
	КонецЕсли;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.ДанныеВыбора) = тип("Структура") тогда
		Количество=Параметры.ДанныеВыбора.КоличествоОстаток;
		Серия = Параметры.ДанныеВыбора.СерияНоменклатуры;
		Номенклатура=Параметры.ДанныеВыбора.Номенклатура;
		Ячейка=Параметры.ДанныеВыбора.Ячейка;
		ИдентификаторУпаковки=Параметры.ДанныеВыбора.ИдентификаторУпаковки;
	иначе
		Отказ=Истина;
	КонецЕсли;
	Если Параметры.Свойство("УказатьЯчейкуПолучатель") тогда
		Элементы.ЯчейкаПолучательИзменение.Видимость=Параметры.УказатьЯчейкуПолучатель;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если Количество > Параметры.ДанныеВыбора.КоличествоОстаток или Количество=0  тогда
		Количество=Параметры.ДанныеВыбора.КоличествоОстаток;
	КонецЕсли;	
КонецПроцедуры
