
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Проведен и РежимЗаписи=РежимЗаписиДокумента.Запись Тогда 
		Если ОбменДанными.Загрузка Тогда 
			РежимЗаписи=РежимЗаписиДокумента.Проведение;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
		ПередЗаписьюПроведение(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения тогда
		ПередЗаписьюОтменаПроведения(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	Если ОбменДанными.Загрузка Тогда 
		Отказ=Ложь;
	КонецЕсли;	

КонецПроцедуры

Процедура ПередЗаписьюПроведение(Отказ, РежимЗаписи, РежимПроведения)
	Если Организация.Пустая() Тогда 
		Сообщить("Заполните организацию");
		Отказ=Истина;
	КонецЕсли;
	Если НовыйАссортиметныйУчасток.Пустая() Тогда 
		Сообщить("Заполните Ассортиментный участок");
		Отказ=Истина;
	КонецЕсли;
	Если Отказ Тогда 
		Возврат
	КонецЕсли;	
	СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен;
КонецПроцедуры

Процедура ПередЗаписьюОтменаПроведения(Отказ, РежимЗаписи, РежимПроведения)
	СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка.Записывать=Истина;
	Движения.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка.Очистить();
	Для Каждого стр из СписокНоменклатуры цикл
		НоваяЗапись=Движения.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка.Добавить();
		НоваяЗапись.Организация=Организация;
		НоваяЗапись.Номенклатура=стр.Номенклатура;
		НоваяЗапись.Период=Дата;
		НоваяЗапись.АссортиментныйУчастокСклада=НовыйАссортиметныйУчасток;
	КонецЦикла;
	Движения.Записать();
КонецПроцедуры
