Процедура ПечатьМаршрутногоЛиста(ТабличныйДокумент,Маршрут) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутизацияДокументыМаршрута.Заказ КАК Заказ,
		|	МаршрутизацияДокументыМаршрута.ОчередьДоставки КАК ОчередьДоставки
		|ПОМЕСТИТЬ Вт1
		|ИЗ
		|	Документ.Маршрутизация.ДокументыМаршрута КАК МаршрутизацияДокументыМаршрута
		|ГДЕ
		|	МаршрутизацияДокументыМаршрута.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	МаршрутизацияДокументыМаршрута.Заказ,
		|	МаршрутизацияДокументыМаршрута.ОчередьДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт1.Заказ КАК Заказ,
		|	итWMSНаборка.Ссылка КАК Наборка,
		|	Вт1.Заказ.Комментарий КАК Комментарий,
		|	Вт1.ОчередьДоставки КАК ОчередьДоставки
		|ПОМЕСТИТЬ Вт2
		|ИЗ
		|	Вт1 КАК Вт1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSНаборка КАК итWMSНаборка
		|		ПО Вт1.Заказ = итWMSНаборка.итОснование
		|			И (итWMSНаборка.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт2.Заказ КАК Заказ,
		|	Вт2.Наборка КАК Наборка,
		|	Вт2.Комментарий КАК Комментарий,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
		|	Вт2.Заказ.Контрагент КАК Контрагент,
		|	Вт2.ОчередьДоставки КАК ОчередьДоставки
		|ИЗ
		|	Вт2 КАК Вт2
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО Вт2.Заказ = РеализацияТоваровУслуг.Сделка
		|			И (РеализацияТоваровУслуг.Проведен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОчередьДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", Маршрут);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Макет=ПолучитьМакет("МаршрутныйЛистПечать");
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал=Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.Контрагент=ВыборкаДетальныеЗаписи.Контрагент;
	ОбластьСтрока.Параметры.НомерЗаказа=ВыборкаДетальныеЗаписи.Заказ.НомерИсточника;
	ОбластьСтрока.Параметры.НомерНаборки=ВыборкаДетальныеЗаписи.Наборка.Номер;
	ОбластьСтрока.Параметры.Очередь=ВыборкаДетальныеЗаписи.ОчередьДоставки;
	ОбластьСтрока.Параметры.НомерРеализации=ВыборкаДетальныеЗаписи.Реализация.Номер;
	ОбластьСтрока.Параметры.Комментарий =ВыборкаДетальныеЗаписи.Комментарий;
	ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	ОбластьПодвал.Параметры.Транспорт=Маршрут.Транспорт;
	ОбластьПодвал.Параметры.водитель=Маршрут.водитель;
    ОбластьПодвал.Параметры.госномер=Маршрут.госномер;
    ОбластьПодвал.Параметры.Отгрузил=НайтиИсполнителяМаршрута(Маршрут);
	МассивОбластей=новый Массив;
	МассивОбластей.Добавить(ОбластьПодвал);
	Если не ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда 
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьПодвал);
КонецПроцедуры





Функция НайтиИсполнителяМаршрута(Маршрут)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МаршрутизацияДокументыМаршрута.Заказ КАК Заказ
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	Документ.Маршрутизация.ДокументыМаршрута КАК МаршрутизацияДокументыМаршрута
		|ГДЕ
		|	МаршрутизацияДокументыМаршрута.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	МаршрутизацияДокументыМаршрута.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	итWMSНаборка.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Вт2
		|ИЗ
		|	Вт КАК Вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSНаборка КАК итWMSНаборка
		|		ПО Вт.Заказ = итWMSНаборка.итОснование
		|			И (итWMSНаборка.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSОтгрузкаитОснования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВтОтгрузка
		|ИЗ
		|	Вт2 КАК Вт2
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSОтгрузка.итОснования КАК итWMSОтгрузкаитОснования
		|		ПО Вт2.Ссылка = итWMSОтгрузкаитОснования.Документ
		|			И (итWMSОтгрузкаитОснования.Ссылка.Проведен)
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSОтгрузкаитОснования.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSЗадачиТСД.ТСД КАК ТСД,
		|	МИНИМУМ(итWMSЗадачиТСД.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(итWMSЗадачиТСД.ДатаОкончания) КАК ДатаОкончания
		|ПОМЕСТИТЬ ДатаИсполненияотгрузкиНаТСД
		|ИЗ
		|	ВтОтгрузка КАК ВтОтгрузка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSЗадачиТСД КАК итWMSЗадачиТСД
		|		ПО ВтОтгрузка.Ссылка = итWMSЗадачиТСД.ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSЗадачиТСД.ТСД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSСостояниеТСД.РаботникСклада КАК РаботникСклада
		|ИЗ
		|	(ВЫБРАТЬ
		|		итWMSСостояниеТСД.ТСД КАК ТСД,
		|		МАКСИМУМ(итWMSСостояниеТСД.Период) КАК Период
		|	ИЗ
		|		ДатаИсполненияотгрузкиНаТСД КАК ДатаИсполненияотгрузкиНаТСД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSСостояниеТСД КАК итWMSСостояниеТСД
		|			ПО ДатаИсполненияотгрузкиНаТСД.ТСД = итWMSСостояниеТСД.ТСД
		|				И ДатаИсполненияотгрузкиНаТСД.ДатаНачала >= итWMSСостояниеТСД.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		итWMSСостояниеТСД.ТСД) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSСостояниеТСД КАК итWMSСостояниеТСД
		|		ПО ВложенныйЗапрос.ТСД = итWMSСостояниеТСД.ТСД
		|			И ВложенныйЗапрос.Период = итWMSСостояниеТСД.Период";
	
	Запрос.УстановитьПараметр("Ссылка", Маршрут);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат  ВыборкаДетальныеЗаписи.РаботникСклада;
	КонецЦикла;
	Возврат "";
	
	КонецФункции