
Процедура ПередЗаписью(Отказ, Замещение) 
Если ОбменДанными.Загрузка Тогда
	Возврат;
КонецЕсли;
для Каждого стр из ЭтотОбъект цикл
ТекстСообщения="";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSДиапазоныSSCC.Филиал,
		|	итWMSДиапазоныSSCC.ВидДиапазона,
		|	итWMSДиапазоныSSCC.ДиапазонС,
		|	итWMSДиапазоныSSCC.ДиапазонПо
		|ИЗ
		|	РегистрСведений.итWMSДиапазоныSSCC КАК итWMSДиапазоныSSCC
		|ГДЕ
		|	(итWMSДиапазоныSSCC.ДиапазонС МЕЖДУ &ДиапазонС И &ДиапазаонПО
		|			ИЛИ итWMSДиапазоныSSCC.ДиапазонПо МЕЖДУ &ДиапазонС И &ДиапазаонПО)";
	
	Запрос.УстановитьПараметр("ДиапазаонПО", стр.ДиапазонПо);
	Запрос.УстановитьПараметр("ДиапазонС", стр.ДиапазонС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Отказ=Истина;
	ТекстСообщения="
	| Пересичение диапазонов с Филал:"+Строка(ВыборкаДетальныеЗаписи.Филиал)+" ВидДиапазона:"+Строка(ВыборкаДетальныеЗаписи.ВидДиапазона)+" ДиапазонС-"
	+ВыборкаДетальныеЗаписи.ДиапазонС+" ДиапазонПо-"+ВыборкаДетальныеЗаписи.ДиапазонПо; 
	КонецЦикла;
	Если Отказ=Истина тогда
		итWMSОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат
	КонецЕсли;	
	
	
	//для Каждого стр из ЭтотОбъект цикл
		СтрокаС=СтрЗаменить(Строка(стр.ДиапазонС),Символы.НПП,"");
		Если СтрДлина(СтрокаС)<9 тогда
			пока СтрДлина(СтрокаС)<9 цикл
				СтрокаС="0"+СтрокаС;
			КонецЦикла;
		КонецЕсли;
		СтрокаПо=СтрЗаменить(Строка(стр.ДиапазонПо),Символы.НПП,"");
		Если СтрДлина(СтрокаПо)<9  тогда
			Пока  СтрДлина(СтрокаПо)<9 цикл
				СтрокаПо="0"+СтрокаПо;
			КонецЦикла;
		КонецЕсли;
		 стр.ЦифраРасширенияС=Число(Лев(СтрокаС,1));
		 стр.ЦифраРасширенияПо=Число(Лев(СтрокаПо,1));
		 
		
	КонецЦикла;
КонецПроцедуры
