Перем ОбработкаТСД Экспорт;
Перем СообщениеДляТСД Экспорт ; 
Перем ИгнорироватьОтказПриПроверках Экспорт ;


#Область ЯчеечноеРазмещениеТовара

Процедура ВыборСтратегииРазмещения()Экспорт 
	
	
	НастройкаСтратегииРазмещения=Неопределено;
	ТекущийПользователь=ПараметрыСеанса.ТекущийПользователь;	
	СтрокаНастроек=ТекущийПользователь.НастройкиПоУмолчанию.Найти("Стратегия размещения"); 
	Если СтрокаНастроек <> Неопределено Тогда		    
			НастройкаСтратегииРазмещения=СтрокаНастроек.Значение;
	КонецЕсли;
	Если НастройкаСтратегииРазмещения = Неопределено И Не Организация.Пустая() Тогда
		СтрокаНастроек=Организация.НастройкиПоУмолчанию.Найти("Стратегия размещения");
		Если СтрокаНастроек <> Неопределено Тогда
				НастройкаСтратегииРазмещения=СтрокаНастроек.Значение;
		КонецЕсли;
	КонецЕсли;
	Если НастройкаСтратегииРазмещения=Неопределено Тогда
		 НастройкаСтратегииРазмещения=Константы.СтратегияРазмещения.Получить();
	КонецЕсли;
	Если НастройкаСтратегииРазмещения=Неопределено или НастройкаСтратегииРазмещения=Справочники.итWMSСтратегии.ПустаяСсылка() Тогда
		Возврат
	КонецЕсли;
	СтратегияРазмещения=НастройкаСтратегииРазмещения;
	Выполнить(СтратегияРазмещения.ИмяМетода);
КонецПроцедуры

Процедура РаместитьТоварПоУчасткамПриоритетХранения() Экспорт
	Попытка
		ДанныеХранилища=ПолучитьИзВременногоХранилища(АдресХраненияПараметров);
	Исключение
		ДанныеХранилища=Неопределено;
	КонецПопытки;
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("Стратегия","РаместитьТоварПоУчасткамПриоритетХранения");
	СтруктураДанных.Вставить("РазмещатьПоБлижайшейЗонеПриемки",Истина);
	Если ТипЗнч(ДанныеХранилища)=Тип("Массив") Тогда  
		СтруктураДанных.Вставить("АссортиментныйУчасток",НайтиЗначенияВСтруктурированномМассиве(ДанныеХранилища,"АссортиментныйУчасток"));
		Если СтруктураДанных.АссортиментныйУчасток=Неопределено Тогда 
			СтруктураДанных.Удалить("АссортиментныйУчасток");	
		ИначеЕсли СтруктураДанных.АссортиментныйУчасток.Пустая() Тогда 
			СтруктураДанных.Удалить("АссортиментныйУчасток");	
		КонецЕсли;
		СтруктураДанных.Вставить("ВидСкладскойДеятельности",НайтиЗначенияВСтруктурированномМассиве(ДанныеХранилища,"ВидСкладскойДеятельности"));
		Если СтруктураДанных.ВидСкладскойДеятельности=Неопределено Тогда 
			СтруктураДанных.Удалить("ВидСкладскойДеятельности");
		ИначеЕсли  СтруктураДанных.ВидСкладскойДеятельности.Пустая() Тогда 
			СтруктураДанных.Удалить("ВидСкладскойДеятельности");
		КонецЕсли;
	КонецЕсли;
	СтруктураДанных.Вставить("РазмещатьСПриоритетомХранения",Истина);
	ПоискЯчеекРазмещения(СтруктураДанных);
	
КонецПроцедуры
Процедура РаместитьТоварПоУчасткамПриоритетПикинга() Экспорт
	Попытка
		ДанныеХранилища=ПолучитьИзВременногоХранилища(АдресХраненияПараметров);
	Исключение
		ДанныеХранилища=Неопределено;
	КонецПопытки;
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("Стратегия","РаместитьТоварПоУчасткамПриоритетПикинга");
	СтруктураДанных.Вставить("РазмещатьПоБлижайшейЗонеПриемки",Истина);
	Если ТипЗнч(ДанныеХранилища)=Тип("Массив") Тогда  
		СтруктураДанных.Вставить("АссортиментныйУчасток",НайтиЗначенияВСтруктурированномМассиве(ДанныеХранилища,"АссортиментныйУчасток"));
		Если СтруктураДанных.АссортиментныйУчасток=Неопределено Тогда 
			СтруктураДанных.Удалить("АссортиментныйУчасток");	
		ИначеЕсли СтруктураДанных.АссортиментныйУчасток.Пустая() Тогда 
			СтруктураДанных.Удалить("АссортиментныйУчасток");	
		КонецЕсли;
		СтруктураДанных.Вставить("ВидСкладскойДеятельности",НайтиЗначенияВСтруктурированномМассиве(ДанныеХранилища,"ВидСкладскойДеятельности"));
		Если СтруктураДанных.ВидСкладскойДеятельности=Неопределено Тогда 
			СтруктураДанных.Удалить("ВидСкладскойДеятельности");
		ИначеЕсли  СтруктураДанных.ВидСкладскойДеятельности.Пустая() Тогда 
			СтруктураДанных.Удалить("ВидСкладскойДеятельности");
		КонецЕсли;
	КонецЕсли;
	СтруктураДанных.Вставить("РазмещатьСПриоритетомХранения",Ложь);
	ПоискЯчеекРазмещения(СтруктураДанных);
	
	КонецПроцедуры



#Область ЯчеечноеРазмещениеТовараОпт
Процедура ПоискЯчеекРазмещенияОпт(ЗонаКарантина,  МассивРезультатов,  СтруктураДанных)
	МенеджерВременныхТаблиц=новый МенеджерВременныхТаблиц;
	ЗапросСвободныхЯчеекСогласноПаллетМестОпт(МенеджерВременныхТаблиц,СтруктураДанных);
	РазместитьОднородныеПаллеты(МассивРезультатов[5],МенеджерВременныхТаблиц,СтруктураДанных);
	РазместитьНеОднородныеПаллеты(МассивРезультатов[6],МенеджерВременныхТаблиц,СтруктураДанных);
	/////размещение карантинных паллет по алгоритмы не однородных, в зону карантина
	МенеджерВременныхТаблиц=новый МенеджерВременныхТаблиц;
	ЗаполнитьДанныеСвободнымиЯчейкамиКарантина(ЗонаКарантина,МенеджерВременныхТаблиц);
	РазместитьКарантинПаллеты(МассивРезультатов[7],МенеджерВременныхТаблиц,СтруктураДанных);
	КонецПроцедуры
Процедура РазмещениеТовараСОграничиниемПоЛиниям() Экспорт
	Попытка
		ДанныеХранилища=ПолучитьИзВременногоХранилища(АдресХраненияПараметров);
	Исключение
		ДанныеХранилища=Неопределено;
	КонецПопытки;
		Если ТипЗнч(ДанныеХранилища)<>Тип("Массив") Тогда 
		Сообщить("нет данных Линий, заполните пожалуйста параметры");
		Возврат
	КонецЕсли;
	ПриоритетПикинга=Неопределено;
	ПриоритетПикинга=НайтиЗначенияВСтруктурированномМассиве(ДанныеХранилища,"ПриоритетПикинга");
	Если ПриоритетПикинга=Неопределено Тогда 
		ПриоритетПикинга=Ложь;
	КонецЕсли;	

	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("Стратегия","РазмещениеТовараСОграничиниемПоЛиниям");
	СтруктураДанных.Вставить("РазмещатьПоБлижайшейЗонеПриемки",Истина);
	СтруктураДанных.Вставить("ЛинияС",НайтиЗначенияВСтруктурированномМассиве(ДанныеХранилища,"ЛинияС"));
	СтруктураДанных.Вставить("ЛинияПо",НайтиЗначенияВСтруктурированномМассиве(ДанныеХранилища,"ЛинияПо"));
	СтруктураДанных.Вставить("РазмещатьСПриоритетомХранения",?(не ПриоритетПикинга,Истина,Ложь));
	Если СтруктураДанных.ЛинияС=Неопределено или  СтруктураДанных.ЛинияПо=Неопределено Тогда 
		Сообщить("нет данных Линий, заполните пожалуйста параметры");
		Возврат
	КонецЕсли;
	ПоискЯчеекРазмещения(СтруктураДанных);
	
КонецПроцедуры
Процедура ПоискЯчеекРазмещенияВРядИлиЛинию()Экспорт 
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("Стратегия","ПоискЯчеекРазмещенияВРядИлиЛинию");
	СтруктураДанных.Вставить("РазмещатьПоБлижайшейЗонеПриемки",Истина);
	СтруктураДанных.Вставить("РазмещатьСПриоритетомХранения",Истина);
	ПоискЯчеекРазмещения(СтруктураДанных);
КонецПроцедуры
Процедура ПоискЯчеекРазмещенияБлижайшаяКЗонеПриемкиТолькоЯчейкиХранения()Экспорт 
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("Стратегия","ПоискЯчеекРазмещенияБлижайшаяКЗонеПриемкиТолькоЯчейкиХранения");
	МассивЗонКРазмещению=новый Массив;
	МассивЗонКРазмещению.Добавить(Перечисления.итWMSЗоныСклада.Хранения);
	СтруктураДанных.Вставить("МассивЗонКРазмещению",МассивЗонКРазмещению);
	ПоискЯчеекРазмещения(СтруктураДанных);
КонецПроцедуры
Процедура ПоискЯчеекРазмещенияБлижайшаяКЗонеПриемки() Экспорт
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("Стратегия","ПоискЯчеекРазмещенияБлижайшаяКЗонеПриемки");
	ПоискЯчеекРазмещения(СтруктураДанных);	
КонецПроцедуры

Процедура РазместитьНеОднородныеПаллеты(РезультатЗапроса,МенеджерВременныхТаблиц,СтруктураДанных)
	Если РезультатЗапроса.Пустой() тогда
		Возврат
	КонецЕсли;	
	ВыборкаНеоднороднойПаллеты=РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаПаллетМест=новый ТаблицаЗначений;
	ТаблицаПаллетМест.Колонки.Добавить("Ячейка",новый ОписаниеТипов("СправочникСсылка.итСкладскиеЯчейки"));
	ТаблицаПаллетМест.Колонки.Добавить("КоличествоЗанятыхПаллетМест",новый ОписаниеТипов("Число"));
	
	Пока  ВыборкаНеоднороднойПаллеты.Следующий() Цикл 
		Если ВыборкаНеоднороднойПаллеты.НоменклатураитПреоритетнаяЗонаРазмещения>1 тогда
			Сообщить("для паллеты "+ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки+" место размещения не найдено");
			Продолжить;
		КонецЕсли;	
		Если ВыборкаНеоднороднойПаллеты.КоличествоРазличныхЯчеекОтправителей>1 и СтруктураДанных.РазмещатьПоБлижайшейЗонеПриемки тогда
			Сообщить("паллета "+ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки+" размещена не будет т.к паллета размещена более чем на 1 ячейки приемки");
			Продолжить;
		КонецЕсли;	
		
		Сообщить("Паллета "+ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки+" неоднородна, но ее приоритетное место расположение в 1 зоне , будет предложенно рекомендованное место ");
		
		Если  СтруктураДанных.РазмещатьПоБлижайшейЗонеПриемки тогда
			СтруктураДанных.Вставить("НачалоОтсчетаПорядкаОбхода",ВыборкаНеоднороднойПаллеты.ЯчейкаОтправитель.ЯчейкаНачалаРазмещения.ПорядокОбхода);
		КонецЕсли;
		СтруктураДанных.Вставить("ТекущийАссортиментныйУчастокСклада",ВыборкаНеоднороднойПаллеты.АссортиментныйУчастокСклада);
		РезультатСвободныхЯчеек=ЗапроситьИнформациюПоЯчейкам(МенеджерВременныхТаблиц,1,ВыборкаНеоднороднойПаллеты.СкладскоеПомещение,ТаблицаПаллетМест,СтруктураДанных);
		ТаблицаПаллетМест.Очистить();
		ВыборкаСвободныхЯчеек=РезультатСвободныхЯчеек.Выбрать();
		СтрокиТабличнойЧасти=Товары.НайтиСтроки(новый Структура("ИдентификаторУпаковки",ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки));
		Если ВыборкаСвободныхЯчеек.Следующий() тогда
			КоличествоПаллетвЯчейке=ВыборкаСвободныхЯчеек.КоличествоПаллет;
			пока КоличествоПаллетвЯчейке>0 цикл
				для Каждого стр из СтрокиТабличнойЧасти цикл
					стр.ЯчейкаПолучатель=ВыборкаСвободныхЯчеек.Ячейка;
				КонецЦикла;
				КоличествоПаллетвЯчейке=КоличествоПаллетвЯчейке-1;
				НоваяСтрока=ТаблицаПаллетМест.Добавить();
				НоваяСтрока.Ячейка=ВыборкаСвободныхЯчеек.Ячейка;
				НоваяСтрока.КоличествоЗанятыхПаллетМест=1;
				Если КоличествоПаллетвЯчейке>0 тогда
					Если   ВыборкаНеоднороднойПаллеты.Следующий() тогда
						СтрокиТабличнойЧасти=Товары.НайтиСтроки(новый Структура("ИдентификаторУпаковки",ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки));
						Сообщить("Паллета "+ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки+" неоднородна, но ее приоритетное место расположение в 1 зоне , будет предложенно рекомендованное место ");
					иначе
						Прервать;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
		иначе
			Сообщить(" для паллеты "+ ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки +" не нашлось подходящей ячейки");
		КонецЕсли;
		
	КонецЦикла;
	ОбработатьТаблицуПаллетМестОПТ(МенеджерВременныхТаблиц, ТаблицаПаллетМест);
	
КонецПроцедуры

Процедура РазместитьОднородныеПаллеты(РезультатЗапроса,МенеджерВременныхТаблиц,СтруктураДанных)
	Если РезультатЗапроса.Пустой() тогда
		Возврат
	КонецЕсли;	
	ВыборкаНоменклатуры=РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаПаллетМест=новый ТаблицаЗначений;
	ТаблицаПаллетМест.Колонки.Добавить("Ячейка",новый ОписаниеТипов("СправочникСсылка.итСкладскиеЯчейки"));
	ТаблицаПаллетМест.Колонки.Добавить("КоличествоЗанятыхПаллетМест",новый ОписаниеТипов("Число"));
	
	
	Пока  ВыборкаНоменклатуры.Следующий() Цикл 
		
		КоличествоПаллетКРазмещению= ВыборкаНоменклатуры.КоличествоПаллетНоменклатуры;
		СкладскоеПомещениеКРазмещению=ВыборкаНоменклатуры.НоменклатураитПреоритетнаяЗонаРазмещения;
		СтруктураДанных.Вставить("ТекущийАссортиментныйУчастокСклада",ВыборкаНоменклатуры.АссортиментныйУчастокСклада);
		Если не СтруктураДанных.РазмещатьПоБлижайшейЗонеПриемки тогда
			РезультатСвободныхЯчеек=ЗапроситьИнформациюПоЯчейкам(МенеджерВременныхТаблиц,КоличествоПаллетКРазмещению,СкладскоеПомещениеКРазмещению,ТаблицаПаллетМест,СтруктураДанных);
			ВыборкаСвободныхЯчеек=РезультатСвободныхЯчеек.Выбрать();
			ТаблицаПаллетМест.Очистить();
		КонецЕсли;
		ВыборкаПоПаллетно=ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПаллетно.Следующий() цикл
			Если ВыборкаПоПаллетно.КоличествоРазличныхЯчеекОтправителей>1 и СтруктураДанных.РазмещатьПоБлижайшейЗонеПриемки тогда
				Сообщить("паллета "+ВыборкаПоПаллетно.ИдентификаторУпаковки+" размещена не будет т.к паллета размещена более чем на 1 ячейки приемки");
				Продолжить;
			КонецЕсли;	
			Если  СтруктураДанных.РазмещатьПоБлижайшейЗонеПриемки тогда
				СтруктураДанных.Вставить("НачалоОтсчетаПорядкаОбхода",ВыборкаПоПаллетно.ЯчейкаОтправитель.ЯчейкаНачалаРазмещения.ПорядокОбхода);
				РезультатСвободныхЯчеек=ЗапроситьИнформациюПоЯчейкам(МенеджерВременныхТаблиц,КоличествоПаллетКРазмещению,СкладскоеПомещениеКРазмещению,ТаблицаПаллетМест,СтруктураДанных);
				ВыборкаСвободныхЯчеек=РезультатСвободныхЯчеек.Выбрать();
				ТаблицаПаллетМест.Очистить();
			КонецЕсли;
			
			СтрокиТабличнойЧасти=Товары.НайтиСтроки(новый Структура("ИдентификаторУпаковки,Номенклатура",ВыборкаПоПаллетно.ИдентификаторУпаковки,ВыборкаПоПаллетно.Номенклатура));
			Если ВыборкаСвободныхЯчеек.Следующий() тогда
				КоличествоПаллетвЯчейке=ВыборкаСвободныхЯчеек.КоличествоПаллет;
				пока КоличествоПаллетвЯчейке>0 цикл
					для Каждого стр из СтрокиТабличнойЧасти цикл
						стр.ЯчейкаПолучатель=ВыборкаСвободныхЯчеек.Ячейка;
					КонецЦикла;
					КоличествоПаллетвЯчейке=КоличествоПаллетвЯчейке-1;
					НоваяСтрока=ТаблицаПаллетМест.Добавить();
					НоваяСтрока.Ячейка=ВыборкаСвободныхЯчеек.Ячейка;
					НоваяСтрока.КоличествоЗанятыхПаллетМест=1;
					Если КоличествоПаллетвЯчейке>0 тогда
						Если   ВыборкаПоПаллетно.Следующий() тогда
							СтрокиТабличнойЧасти=Товары.НайтиСтроки(новый Структура("ИдентификаторУпаковки,Номенклатура",ВыборкаПоПаллетно.ИдентификаторУпаковки,ВыборкаПоПаллетно.Номенклатура));
						иначе
							Прервать;
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
			иначе
				Сообщить(" для паллеты "+ ВыборкаПоПаллетно.ИдентификаторУпаковки +" и  номеклатуры "+ВыборкаПоПаллетно.Номенклатура+" не нашлось подходящей ячейки");
			КонецЕсли;
		КонецЦикла;
		//Пока  ВыборкаДетальнойЗаписиТоваров.Следующий() Цикл 
		//КонецЦикла;
	КонецЦикла;
	ОбработатьТаблицуПаллетМестОПТ(МенеджерВременныхТаблиц, ТаблицаПаллетМест);

	
КонецПроцедуры

Процедура ОбработатьТаблицуПаллетМестОПТ( МенеджерВременныхТаблиц, ТаблицаПаллетМест)
	
	Если ТаблицаПаллетМест.Количество()>0 тогда
		ИзъятьЗарезервированныеТоварыОПТ(ТаблицаПаллетМест,МенеджерВременныхТаблиц);;
	КонецЕсли;

КонецПроцедуры
Процедура ИзъятьЗарезервированныеТоварыОПТ(ТаблицаПаллетМест,МенеджерВременныхТаблиц)
	Если ТаблицаПаллетМест=Неопределено Тогда
		ТаблицаПаллетМест=новый ТаблицаЗначений;
		ТаблицаПаллетМест.Колонки.Добавить("Ячейка",новый ОписаниеТипов("СправочникСсылка.итСкладскиеЯчейки"));
		ТаблицаПаллетМест.Колонки.Добавить("КоличествоЗанятыхПаллетМест",новый ОписаниеТипов("Число"));
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПаллетМест.Ячейка,
		|	ТаблицаПаллетМест.КоличествоЗанятыхПаллетМест
		|ПОМЕСТИТЬ ТаблицаПаллетМест
		|ИЗ
		|	&ТаблицаПаллетМест КАК ТаблицаПаллетМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПаллетМест.Ячейка,
		|	СУММА(ТаблицаПаллетМест.КоличествоЗанятыхПаллетМест) КАК КоличествоЗанятыхПаллетМест
		|ПОМЕСТИТЬ ТаблицаПаллетМестГруппировка
		|ИЗ
		|	ТаблицаПаллетМест КАК ТаблицаПаллетМест
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПаллетМест.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвободныеЯчейки.Ячейка,
		|	СвободныеЯчейки.СкладскоеПомещение,
		|	ВЫБОР
		|		КОГДА СвободныеЯчейки.Линия = ""0""
		|			ТОГДА 0
		|		КОГДА СвободныеЯчейки.Линия = ""00""
		|			ТОГДА 0
		|		КОГДА СвободныеЯчейки.Линия = ""1""
		|			ТОГДА 1
		|		КОГДА СвободныеЯчейки.Линия = ""01""
		|			ТОГДА 1
		|		КОГДА СвободныеЯчейки.Линия = ""2""
		|			ТОГДА 2
		|		КОГДА СвободныеЯчейки.Линия = ""02""
		|			ТОГДА 2
		|		КОГДА СвободныеЯчейки.Линия = ""3""
		|			ТОГДА 3
		|		КОГДА СвободныеЯчейки.Линия = ""03""
		|			ТОГДА 3
		|		КОГДА СвободныеЯчейки.Линия = ""4""
		|			ТОГДА 4
		|		КОГДА СвободныеЯчейки.Линия = ""04""
		|			ТОГДА 4
		|		КОГДА СвободныеЯчейки.Линия = ""5""
		|			ТОГДА 5
		|		КОГДА СвободныеЯчейки.Линия = ""05""
		|			ТОГДА 5
		|		КОГДА СвободныеЯчейки.Линия = ""6""
		|			ТОГДА 6
		|		КОГДА СвободныеЯчейки.Линия = ""06""
		|			ТОГДА 6
		|		КОГДА СвободныеЯчейки.Линия = ""7""
		|			ТОГДА 7
		|		КОГДА СвободныеЯчейки.Линия = ""07""
		|			ТОГДА 7
		|		КОГДА СвободныеЯчейки.Линия = ""8""
		|			ТОГДА 8
		|		КОГДА СвободныеЯчейки.Линия = ""08""
		|			ТОГДА 8
		|		КОГДА СвободныеЯчейки.Линия = ""9""
		|			ТОГДА 9
		|		КОГДА СвободныеЯчейки.Линия = ""09""
		|			ТОГДА 9
		|		КОГДА СвободныеЯчейки.Линия = ""10""
		|			ТОГДА 10
		|		КОГДА СвободныеЯчейки.Линия = ""010""
		|			ТОГДА 10
		|		КОГДА СвободныеЯчейки.Линия = ""11""
		|			ТОГДА 11
		|		КОГДА СвободныеЯчейки.Линия = ""011""
		|			ТОГДА 11
		|		КОГДА СвободныеЯчейки.Линия = ""12""
		|			ТОГДА 12
		|		КОГДА СвободныеЯчейки.Линия = ""012""
		|			ТОГДА 12
		|		КОГДА СвободныеЯчейки.Линия = ""13""
		|			ТОГДА 13
		|		КОГДА СвободныеЯчейки.Линия = ""013""
		|			ТОГДА 13
		|		КОГДА СвободныеЯчейки.Линия = ""14""
		|			ТОГДА 14
		|		КОГДА СвободныеЯчейки.Линия = ""014""
		|			ТОГДА 14
		|		КОГДА СвободныеЯчейки.Линия = ""15""
		|			ТОГДА 15
		|		КОГДА СвободныеЯчейки.Линия = ""015""
		|			ТОГДА 15
		|		КОГДА СвободныеЯчейки.Линия = ""16""
		|			ТОГДА 16
		|		КОГДА СвободныеЯчейки.Линия = ""016""
		|			ТОГДА 16
		|		КОГДА СвободныеЯчейки.Линия = ""17""
		|			ТОГДА 17
		|		КОГДА СвободныеЯчейки.Линия = ""017""
		|			ТОГДА 17
		|		КОГДА СвободныеЯчейки.Линия = ""18""
		|			ТОГДА 18
		|		КОГДА СвободныеЯчейки.Линия = ""018""
		|			ТОГДА 18
		|		КОГДА СвободныеЯчейки.Линия = ""19""
		|			ТОГДА 19
		|		КОГДА СвободныеЯчейки.Линия = ""019""
		|			ТОГДА 19
		|		КОГДА СвободныеЯчейки.Линия = ""20""
		|			ТОГДА 20
		|		КОГДА СвободныеЯчейки.Линия = ""020""
		|			ТОГДА 20
		|		КОГДА СвободныеЯчейки.Линия = ""21""
		|			ТОГДА 21
		|		КОГДА СвободныеЯчейки.Линия = ""021""
		|			ТОГДА 21
		|		КОГДА СвободныеЯчейки.Линия = ""22""
		|			ТОГДА 22
		|		КОГДА СвободныеЯчейки.Линия = ""022""
		|			ТОГДА 22
		|		КОГДА СвободныеЯчейки.Линия = ""23""
		|			ТОГДА 23
		|		КОГДА СвободныеЯчейки.Линия = ""023""
		|			ТОГДА 23
		|		КОГДА СвободныеЯчейки.Линия = ""24""
		|			ТОГДА 24
		|		КОГДА СвободныеЯчейки.Линия = ""024""
		|			ТОГДА 24
		|		КОГДА СвободныеЯчейки.Линия = ""25""
		|			ТОГДА 25
		|		КОГДА СвободныеЯчейки.Линия = ""025""
		|			ТОГДА 25
		|		КОГДА СвободныеЯчейки.Линия = ""26""
		|			ТОГДА 26
		|		КОГДА СвободныеЯчейки.Линия = ""026""
		|			ТОГДА 26
		|		КОГДА СвободныеЯчейки.Линия = ""27""
		|			ТОГДА 27
		|		КОГДА СвободныеЯчейки.Линия = ""027""
		|			ТОГДА 27
		|		КОГДА СвободныеЯчейки.Линия = ""28""
		|			ТОГДА 28
		|		КОГДА СвободныеЯчейки.Линия = ""028""
		|			ТОГДА 28
		|		КОГДА СвободныеЯчейки.Линия = ""29""
		|			ТОГДА 29
		|		КОГДА СвободныеЯчейки.Линия = ""029""
		|			ТОГДА 29
		|		КОГДА СвободныеЯчейки.Линия = ""30""
		|			ТОГДА 30
		|		КОГДА СвободныеЯчейки.Линия = ""030""
		|			ТОГДА 30
		|		КОГДА СвободныеЯчейки.Линия = ""31""
		|			ТОГДА 31
		|		КОГДА СвободныеЯчейки.Линия = ""031""
		|			ТОГДА 31
		|		КОГДА СвободныеЯчейки.Линия = ""32""
		|			ТОГДА 32
		|		КОГДА СвободныеЯчейки.Линия = ""032""
		|			ТОГДА 32
		|		КОГДА СвободныеЯчейки.Линия = ""33""
		|			ТОГДА 33
		|		КОГДА СвободныеЯчейки.Линия = ""033""
		|			ТОГДА 33
		|		КОГДА СвободныеЯчейки.Линия = ""34""
		|			ТОГДА 34
		|		КОГДА СвободныеЯчейки.Линия = ""034""
		|			ТОГДА 34
		|		КОГДА СвободныеЯчейки.Линия = ""35""
		|			ТОГДА 35
		|		КОГДА СвободныеЯчейки.Линия = ""035""
		|			ТОГДА 35
		|		КОГДА СвободныеЯчейки.Линия = ""36""
		|			ТОГДА 36
		|		КОГДА СвободныеЯчейки.Линия = ""036""
		|			ТОГДА 36
		|		КОГДА СвободныеЯчейки.Линия = ""37""
		|			ТОГДА 37
		|		КОГДА СвободныеЯчейки.Линия = ""037""
		|			ТОГДА 37
		|		КОГДА СвободныеЯчейки.Линия = ""38""
		|			ТОГДА 38
		|		КОГДА СвободныеЯчейки.Линия = ""038""
		|			ТОГДА 38
		|		КОГДА СвободныеЯчейки.Линия = ""39""
		|			ТОГДА 39
		|		КОГДА СвободныеЯчейки.Линия = ""039""
		|			ТОГДА 39
		|		КОГДА СвободныеЯчейки.Линия = ""40""
		|			ТОГДА 40
		|		КОГДА СвободныеЯчейки.Линия = ""040""
		|			ТОГДА 40
		|		КОГДА СвободныеЯчейки.Линия = ""41""
		|			ТОГДА 41
		|		КОГДА СвободныеЯчейки.Линия = ""041""
		|			ТОГДА 41
		|		КОГДА СвободныеЯчейки.Линия = ""42""
		|			ТОГДА 42
		|		КОГДА СвободныеЯчейки.Линия = ""042""
		|			ТОГДА 42
		|		КОГДА СвободныеЯчейки.Линия = ""43""
		|			ТОГДА 43
		|		КОГДА СвободныеЯчейки.Линия = ""043""
		|			ТОГДА 43
		|		КОГДА СвободныеЯчейки.Линия = ""44""
		|			ТОГДА 44
		|		КОГДА СвободныеЯчейки.Линия = ""044""
		|			ТОГДА 44
		|		КОГДА СвободныеЯчейки.Линия = ""45""
		|			ТОГДА 45
		|		КОГДА СвободныеЯчейки.Линия = ""045""
		|			ТОГДА 45
		|		КОГДА СвободныеЯчейки.Линия = ""46""
		|			ТОГДА 46
		|		КОГДА СвободныеЯчейки.Линия = ""046""
		|			ТОГДА 46
		|		КОГДА СвободныеЯчейки.Линия = ""47""
		|			ТОГДА 47
		|		КОГДА СвободныеЯчейки.Линия = ""047""
		|			ТОГДА 47
		|		КОГДА СвободныеЯчейки.Линия = ""48""
		|			ТОГДА 48
		|		КОГДА СвободныеЯчейки.Линия = ""048""
		|			ТОГДА 48
		|		КОГДА СвободныеЯчейки.Линия = ""49""
		|			ТОГДА 49
		|		КОГДА СвободныеЯчейки.Линия = ""049""
		|			ТОГДА 49
		|		КОГДА СвободныеЯчейки.Линия = ""50""
		|			ТОГДА 50
		|		КОГДА СвободныеЯчейки.Линия = ""050""
		|			ТОГДА 50
		|		КОГДА СвободныеЯчейки.Линия = ""51""
		|			ТОГДА 51
		|		КОГДА СвободныеЯчейки.Линия = ""051""
		|			ТОГДА 51
		|		КОГДА СвободныеЯчейки.Линия = ""52""
		|			ТОГДА 52
		|		КОГДА СвободныеЯчейки.Линия = ""052""
		|			ТОГДА 52
		|		КОГДА СвободныеЯчейки.Линия = ""53""
		|			ТОГДА 53
		|		КОГДА СвободныеЯчейки.Линия = ""053""
		|			ТОГДА 53
		|		КОГДА СвободныеЯчейки.Линия = ""54""
		|			ТОГДА 54
		|		КОГДА СвободныеЯчейки.Линия = ""054""
		|			ТОГДА 54
		|		КОГДА СвободныеЯчейки.Линия = ""55""
		|			ТОГДА 55
		|		КОГДА СвободныеЯчейки.Линия = ""055""
		|			ТОГДА 55
		|		КОГДА СвободныеЯчейки.Линия = ""56""
		|			ТОГДА 56
		|		КОГДА СвободныеЯчейки.Линия = ""056""
		|			ТОГДА 56
		|		КОГДА СвободныеЯчейки.Линия = ""57""
		|			ТОГДА 57
		|		КОГДА СвободныеЯчейки.Линия = ""057""
		|			ТОГДА 57
		|		КОГДА СвободныеЯчейки.Линия = ""58""
		|			ТОГДА 58
		|		КОГДА СвободныеЯчейки.Линия = ""058""
		|			ТОГДА 58
		|		КОГДА СвободныеЯчейки.Линия = ""59""
		|			ТОГДА 59
		|		КОГДА СвободныеЯчейки.Линия = ""059""
		|			ТОГДА 59
		|		КОГДА СвободныеЯчейки.Линия = ""60""
		|			ТОГДА 60
		|		КОГДА СвободныеЯчейки.Линия = ""060""
		|			ТОГДА 60
		|		КОГДА СвободныеЯчейки.Линия = ""61""
		|			ТОГДА 61
		|		КОГДА СвободныеЯчейки.Линия = ""061""
		|			ТОГДА 61
		|		КОГДА СвободныеЯчейки.Линия = ""62""
		|			ТОГДА 62
		|		КОГДА СвободныеЯчейки.Линия = ""062""
		|			ТОГДА 62
		|		КОГДА СвободныеЯчейки.Линия = ""63""
		|			ТОГДА 63
		|		КОГДА СвободныеЯчейки.Линия = ""063""
		|			ТОГДА 63
		|		КОГДА СвободныеЯчейки.Линия = ""64""
		|			ТОГДА 64
		|		КОГДА СвободныеЯчейки.Линия = ""064""
		|			ТОГДА 64
		|		КОГДА СвободныеЯчейки.Линия = ""65""
		|			ТОГДА 65
		|		КОГДА СвободныеЯчейки.Линия = ""065""
		|			ТОГДА 65
		|		КОГДА СвободныеЯчейки.Линия = ""66""
		|			ТОГДА 66
		|		КОГДА СвободныеЯчейки.Линия = ""066""
		|			ТОГДА 66
		|		КОГДА СвободныеЯчейки.Линия = ""67""
		|			ТОГДА 67
		|		КОГДА СвободныеЯчейки.Линия = ""067""
		|			ТОГДА 67
		|		КОГДА СвободныеЯчейки.Линия = ""68""
		|			ТОГДА 68
		|		КОГДА СвободныеЯчейки.Линия = ""068""
		|			ТОГДА 68
		|		КОГДА СвободныеЯчейки.Линия = ""69""
		|			ТОГДА 69
		|		КОГДА СвободныеЯчейки.Линия = ""069""
		|			ТОГДА 69
		|		КОГДА СвободныеЯчейки.Линия = ""70""
		|			ТОГДА 70
		|		КОГДА СвободныеЯчейки.Линия = ""070""
		|			ТОГДА 70
		|		КОГДА СвободныеЯчейки.Линия = ""71""
		|			ТОГДА 71
		|		КОГДА СвободныеЯчейки.Линия = ""071""
		|			ТОГДА 71
		|		КОГДА СвободныеЯчейки.Линия = ""72""
		|			ТОГДА 72
		|		КОГДА СвободныеЯчейки.Линия = ""072""
		|			ТОГДА 72
		|		КОГДА СвободныеЯчейки.Линия = ""73""
		|			ТОГДА 73
		|		КОГДА СвободныеЯчейки.Линия = ""073""
		|			ТОГДА 73
		|		КОГДА СвободныеЯчейки.Линия = ""74""
		|			ТОГДА 74
		|		КОГДА СвободныеЯчейки.Линия = ""074""
		|			ТОГДА 74
		|		КОГДА СвободныеЯчейки.Линия = ""75""
		|			ТОГДА 75
		|		КОГДА СвободныеЯчейки.Линия = ""075""
		|			ТОГДА 75
		|		КОГДА СвободныеЯчейки.Линия = ""76""
		|			ТОГДА 76
		|		КОГДА СвободныеЯчейки.Линия = ""076""
		|			ТОГДА 76
		|		КОГДА СвободныеЯчейки.Линия = ""77""
		|			ТОГДА 77
		|		КОГДА СвободныеЯчейки.Линия = ""077""
		|			ТОГДА 77
		|		КОГДА СвободныеЯчейки.Линия = ""78""
		|			ТОГДА 78
		|		КОГДА СвободныеЯчейки.Линия = ""078""
		|			ТОГДА 78
		|		КОГДА СвободныеЯчейки.Линия = ""79""
		|			ТОГДА 79
		|		КОГДА СвободныеЯчейки.Линия = ""079""
		|			ТОГДА 79
		|		КОГДА СвободныеЯчейки.Линия = ""80""
		|			ТОГДА 80
		|		КОГДА СвободныеЯчейки.Линия = ""080""
		|			ТОГДА 80
		|		КОГДА СвободныеЯчейки.Линия = ""81""
		|			ТОГДА 81
		|		КОГДА СвободныеЯчейки.Линия = ""081""
		|			ТОГДА 81
		|		КОГДА СвободныеЯчейки.Линия = ""82""
		|			ТОГДА 82
		|		КОГДА СвободныеЯчейки.Линия = ""082""
		|			ТОГДА 82
		|		КОГДА СвободныеЯчейки.Линия = ""83""
		|			ТОГДА 83
		|		КОГДА СвободныеЯчейки.Линия = ""083""
		|			ТОГДА 83
		|		КОГДА СвободныеЯчейки.Линия = ""84""
		|			ТОГДА 84
		|		КОГДА СвободныеЯчейки.Линия = ""084""
		|			ТОГДА 84
		|		КОГДА СвободныеЯчейки.Линия = ""85""
		|			ТОГДА 85
		|		КОГДА СвободныеЯчейки.Линия = ""085""
		|			ТОГДА 85
		|		КОГДА СвободныеЯчейки.Линия = ""86""
		|			ТОГДА 86
		|		КОГДА СвободныеЯчейки.Линия = ""086""
		|			ТОГДА 86
		|		КОГДА СвободныеЯчейки.Линия = ""87""
		|			ТОГДА 87
		|		КОГДА СвободныеЯчейки.Линия = ""087""
		|			ТОГДА 87
		|		КОГДА СвободныеЯчейки.Линия = ""88""
		|			ТОГДА 88
		|		КОГДА СвободныеЯчейки.Линия = ""088""
		|			ТОГДА 88
		|		КОГДА СвободныеЯчейки.Линия = ""89""
		|			ТОГДА 89
		|		КОГДА СвободныеЯчейки.Линия = ""089""
		|			ТОГДА 89
		|		КОГДА СвободныеЯчейки.Линия = ""90""
		|			ТОГДА 90
		|		КОГДА СвободныеЯчейки.Линия = ""090""
		|			ТОГДА 90
		|		КОГДА СвободныеЯчейки.Линия = ""91""
		|			ТОГДА 91
		|		КОГДА СвободныеЯчейки.Линия = ""091""
		|			ТОГДА 91
		|		КОГДА СвободныеЯчейки.Линия = ""92""
		|			ТОГДА 92
		|		КОГДА СвободныеЯчейки.Линия = ""092""
		|			ТОГДА 92
		|		КОГДА СвободныеЯчейки.Линия = ""93""
		|			ТОГДА 93
		|		КОГДА СвободныеЯчейки.Линия = ""093""
		|			ТОГДА 93
		|		КОГДА СвободныеЯчейки.Линия = ""94""
		|			ТОГДА 94
		|		КОГДА СвободныеЯчейки.Линия = ""094""
		|			ТОГДА 94
		|		КОГДА СвободныеЯчейки.Линия = ""95""
		|			ТОГДА 95
		|		КОГДА СвободныеЯчейки.Линия = ""095""
		|			ТОГДА 95
		|		КОГДА СвободныеЯчейки.Линия = ""96""
		|			ТОГДА 96
		|		КОГДА СвободныеЯчейки.Линия = ""096""
		|			ТОГДА 96
		|		КОГДА СвободныеЯчейки.Линия = ""97""
		|			ТОГДА 97
		|		КОГДА СвободныеЯчейки.Линия = ""097""
		|			ТОГДА 97
		|		КОГДА СвободныеЯчейки.Линия = ""98""
		|			ТОГДА 98
		|		КОГДА СвободныеЯчейки.Линия = ""098""
		|			ТОГДА 98
		|		КОГДА СвободныеЯчейки.Линия = ""99""
		|			ТОГДА 99
		|		КОГДА СвободныеЯчейки.Линия = ""099""
		|			ТОГДА 99
		|		КОГДА СвободныеЯчейки.Линия = ""100""
		|			ТОГДА 100
		|		КОГДА СвободныеЯчейки.Линия = ""0100""
		|			ТОГДА 100
		|		ИНАЧЕ СвободныеЯчейки.Линия
		|	КОНЕЦ КАК Линия,
		|	СвободныеЯчейки.Секция,
		|	СвободныеЯчейки.Стеллаж,
		|	СвободныеЯчейки.Ярус,
		|	СвободныеЯчейки.ПорядокОбхода,
		|	СвободныеЯчейки.КоличествоПаллет - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) КАК КоличествоПаллет,
		|	СвободныеЯчейки.НомерРяда_Пролета,
		|	СвободныеЯчейки.Зона
		|ПОМЕСТИТЬ ТаблицаАнализаСвободныхЯчеек
		|ИЗ
		|	СвободныеЯчейки КАК СвободныеЯчейки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПаллетМестГруппировка КАК ТаблицаПаллетМестГруппировка
		|		ПО СвободныеЯчейки.Ячейка = ТаблицаПаллетМестГруппировка.Ячейка
		|ГДЕ
		|	СвободныеЯчейки.КоличествоПаллет - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) >= 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаПаллетМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаПаллетМестГруппировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СвободныеЯчейки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
		|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
		|	ТаблицаАнализаСвободныхЯчеек.Линия,
		|	ТаблицаАнализаСвободныхЯчеек.Секция,
		|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
		|	ТаблицаАнализаСвободныхЯчеек.Ярус,
		|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
		|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
		|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
		|	ТаблицаАнализаСвободныхЯчеек.Зона
		|ПОМЕСТИТЬ СвободныеЯчейки
		|ИЗ
		|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаАнализаСвободныхЯчеек";
		
		Запрос.УстановитьПараметр("ТаблицаПаллетМест", ТаблицаПаллетМест);
		
		//@skip-warning
		РезультатЗапроса = Запрос.Выполнить();	

	
	КонецПроцедуры

	
Функция ЗапроситьИнформациюПоЯчейкам(МенеджерВременныхТаблиц,КоличествоПаллетКРазмещению=0,СкладскоеПомещениеКРазмещению,ТаблицаПаллетМест=Неопределено,СтруктураДанных)
	ЗапроситьИнформациюПоЯчейкамОбщийФрагмент(ТаблицаПаллетМест, МенеджерВременныхТаблиц);
	РезультатЗапроса=Неопределено;
	Если СкладскоеПомещениеКРазмещению=Неопределено Тогда 
		СкладскоеПомещениеКРазмещению=Справочники.итСкладскиеПомещения.ПустаяСсылка();
	КонецЕсли;	
		
	Если  СтруктураДанных.Стратегия="РазмещениеТовараСОграничиниемПоЛиниям" Тогда
		СтруктураДанных.Вставить("СкладскоеПомещениеКРазмещению",СкладскоеПомещениеКРазмещению);
		РезультатЗапроса=ЗапроситьИнформациюПоЯчейкамНоваяОграниченияПоЛиниям(МенеджерВременныхТаблиц,СтруктураДанных);
	КонецЕсли;
	Если  СтруктураДанных.Стратегия="ПоискЯчеекРазмещенияВРядИлиЛинию" Тогда
		СтруктураДанных.Вставить("СкладскоеПомещениеКРазмещению",СкладскоеПомещениеКРазмещению);
		СтруктураДанных.Вставить("КоличествоПаллетКРазмещению",КоличествоПаллетКРазмещению);
		РезультатЗапроса=ЗапроситьИнформациюПоЯчейкамНоваяВРядИлиЛинию(МенеджерВременныхТаблиц,СтруктураДанных);
	КонецЕсли;
	Если СтруктураДанных.Стратегия = "ПоискЯчеекРазмещенияБлижайшаяКЗонеПриемкиТолькоЯчейкиХранения" или СтруктураДанных.Стратегия = "ПоискЯчеекРазмещенияБлижайшаяКЗонеПриемки" Тогда 
		СтруктураДанных.Вставить("СкладскоеПомещениеКРазмещению",СкладскоеПомещениеКРазмещению);	
		РезультатЗапроса=ЗапроситьИнформациюПоЯчейкамРядомСПриемкой(МенеджерВременныхТаблиц,СтруктураДанных);
	КонецЕсли;
	Если СтруктураДанных.Стратегия = "РаместитьТоварПоУчасткамПриоритетХранения" или СтруктураДанных.Стратегия = "РаместитьТоварПоУчасткамПриоритетПикинга" Тогда
		РезультатЗапроса=ЗапроситьИнформациюПоЯчейкамСогласноУчасткамОПТ(МенеджерВременныхТаблиц,СтруктураДанных);
    КонецЕсли;
	
	Возврат РезультатЗапроса;
КонецФункции


Процедура ЗапроситьИнформациюПоЯчейкамОбщийФрагмент(ТаблицаПаллетМест=Неопределено,  МенеджерВременныхТаблиц)

	Если ТаблицаПаллетМест=Неопределено Тогда
		ТаблицаПаллетМест=новый ТаблицаЗначений;
		ТаблицаПаллетМест.Колонки.Добавить("Ячейка",новый ОписаниеТипов("СправочникСсылка.итСкладскиеЯчейки"));
		ТаблицаПаллетМест.Колонки.Добавить("КоличествоЗанятыхПаллетМест",новый ОписаниеТипов("Число"));
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПаллетМест.Ячейка,
	|	ТаблицаПаллетМест.КоличествоЗанятыхПаллетМест
	|ПОМЕСТИТЬ ТаблицаПаллетМест
	|ИЗ
	|	&ТаблицаПаллетМест КАК ТаблицаПаллетМест
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПаллетМест.Ячейка,
	|	СУММА(ТаблицаПаллетМест.КоличествоЗанятыхПаллетМест) КАК КоличествоЗанятыхПаллетМест
	|ПОМЕСТИТЬ ТаблицаПаллетМестГруппировка
	|ИЗ
	|	ТаблицаПаллетМест КАК ТаблицаПаллетМест
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПаллетМест.Ячейка
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеЯчейки.Ячейка,
	|	СвободныеЯчейки.СкладскоеПомещение,
	|	ВЫБОР
	|		КОГДА СвободныеЯчейки.Линия = ""0""
	|			ТОГДА 0
	|		КОГДА СвободныеЯчейки.Линия = ""00""
	|			ТОГДА 0
	|		КОГДА СвободныеЯчейки.Линия = ""1""
	|			ТОГДА 1
	|		КОГДА СвободныеЯчейки.Линия = ""01""
	|			ТОГДА 1
	|		КОГДА СвободныеЯчейки.Линия = ""2""
	|			ТОГДА 2
	|		КОГДА СвободныеЯчейки.Линия = ""02""
	|			ТОГДА 2
	|		КОГДА СвободныеЯчейки.Линия = ""3""
	|			ТОГДА 3
	|		КОГДА СвободныеЯчейки.Линия = ""03""
	|			ТОГДА 3
	|		КОГДА СвободныеЯчейки.Линия = ""4""
	|			ТОГДА 4
	|		КОГДА СвободныеЯчейки.Линия = ""04""
	|			ТОГДА 4
	|		КОГДА СвободныеЯчейки.Линия = ""5""
	|			ТОГДА 5
	|		КОГДА СвободныеЯчейки.Линия = ""05""
	|			ТОГДА 5
	|		КОГДА СвободныеЯчейки.Линия = ""6""
	|			ТОГДА 6
	|		КОГДА СвободныеЯчейки.Линия = ""06""
	|			ТОГДА 6
	|		КОГДА СвободныеЯчейки.Линия = ""7""
	|			ТОГДА 7
	|		КОГДА СвободныеЯчейки.Линия = ""07""
	|			ТОГДА 7
	|		КОГДА СвободныеЯчейки.Линия = ""8""
	|			ТОГДА 8
	|		КОГДА СвободныеЯчейки.Линия = ""08""
	|			ТОГДА 8
	|		КОГДА СвободныеЯчейки.Линия = ""9""
	|			ТОГДА 9
	|		КОГДА СвободныеЯчейки.Линия = ""09""
	|			ТОГДА 9
	|		КОГДА СвободныеЯчейки.Линия = ""10""
	|			ТОГДА 10
	|		КОГДА СвободныеЯчейки.Линия = ""010""
	|			ТОГДА 10
	|		КОГДА СвободныеЯчейки.Линия = ""11""
	|			ТОГДА 11
	|		КОГДА СвободныеЯчейки.Линия = ""011""
	|			ТОГДА 11
	|		КОГДА СвободныеЯчейки.Линия = ""12""
	|			ТОГДА 12
	|		КОГДА СвободныеЯчейки.Линия = ""012""
	|			ТОГДА 12
	|		КОГДА СвободныеЯчейки.Линия = ""13""
	|			ТОГДА 13
	|		КОГДА СвободныеЯчейки.Линия = ""013""
	|			ТОГДА 13
	|		КОГДА СвободныеЯчейки.Линия = ""14""
	|			ТОГДА 14
	|		КОГДА СвободныеЯчейки.Линия = ""014""
	|			ТОГДА 14
	|		КОГДА СвободныеЯчейки.Линия = ""15""
	|			ТОГДА 15
	|		КОГДА СвободныеЯчейки.Линия = ""015""
	|			ТОГДА 15
	|		КОГДА СвободныеЯчейки.Линия = ""16""
	|			ТОГДА 16
	|		КОГДА СвободныеЯчейки.Линия = ""016""
	|			ТОГДА 16
	|		КОГДА СвободныеЯчейки.Линия = ""17""
	|			ТОГДА 17
	|		КОГДА СвободныеЯчейки.Линия = ""017""
	|			ТОГДА 17
	|		КОГДА СвободныеЯчейки.Линия = ""18""
	|			ТОГДА 18
	|		КОГДА СвободныеЯчейки.Линия = ""018""
	|			ТОГДА 18
	|		КОГДА СвободныеЯчейки.Линия = ""19""
	|			ТОГДА 19
	|		КОГДА СвободныеЯчейки.Линия = ""019""
	|			ТОГДА 19
	|		КОГДА СвободныеЯчейки.Линия = ""20""
	|			ТОГДА 20
	|		КОГДА СвободныеЯчейки.Линия = ""020""
	|			ТОГДА 20
	|		КОГДА СвободныеЯчейки.Линия = ""21""
	|			ТОГДА 21
	|		КОГДА СвободныеЯчейки.Линия = ""021""
	|			ТОГДА 21
	|		КОГДА СвободныеЯчейки.Линия = ""22""
	|			ТОГДА 22
	|		КОГДА СвободныеЯчейки.Линия = ""022""
	|			ТОГДА 22
	|		КОГДА СвободныеЯчейки.Линия = ""23""
	|			ТОГДА 23
	|		КОГДА СвободныеЯчейки.Линия = ""023""
	|			ТОГДА 23
	|		КОГДА СвободныеЯчейки.Линия = ""24""
	|			ТОГДА 24
	|		КОГДА СвободныеЯчейки.Линия = ""024""
	|			ТОГДА 24
	|		КОГДА СвободныеЯчейки.Линия = ""25""
	|			ТОГДА 25
	|		КОГДА СвободныеЯчейки.Линия = ""025""
	|			ТОГДА 25
	|		КОГДА СвободныеЯчейки.Линия = ""26""
	|			ТОГДА 26
	|		КОГДА СвободныеЯчейки.Линия = ""026""
	|			ТОГДА 26
	|		КОГДА СвободныеЯчейки.Линия = ""27""
	|			ТОГДА 27
	|		КОГДА СвободныеЯчейки.Линия = ""027""
	|			ТОГДА 27
	|		КОГДА СвободныеЯчейки.Линия = ""28""
	|			ТОГДА 28
	|		КОГДА СвободныеЯчейки.Линия = ""028""
	|			ТОГДА 28
	|		КОГДА СвободныеЯчейки.Линия = ""29""
	|			ТОГДА 29
	|		КОГДА СвободныеЯчейки.Линия = ""029""
	|			ТОГДА 29
	|		КОГДА СвободныеЯчейки.Линия = ""30""
	|			ТОГДА 30
	|		КОГДА СвободныеЯчейки.Линия = ""030""
	|			ТОГДА 30
	|		КОГДА СвободныеЯчейки.Линия = ""31""
	|			ТОГДА 31
	|		КОГДА СвободныеЯчейки.Линия = ""031""
	|			ТОГДА 31
	|		КОГДА СвободныеЯчейки.Линия = ""32""
	|			ТОГДА 32
	|		КОГДА СвободныеЯчейки.Линия = ""032""
	|			ТОГДА 32
	|		КОГДА СвободныеЯчейки.Линия = ""33""
	|			ТОГДА 33
	|		КОГДА СвободныеЯчейки.Линия = ""033""
	|			ТОГДА 33
	|		КОГДА СвободныеЯчейки.Линия = ""34""
	|			ТОГДА 34
	|		КОГДА СвободныеЯчейки.Линия = ""034""
	|			ТОГДА 34
	|		КОГДА СвободныеЯчейки.Линия = ""35""
	|			ТОГДА 35
	|		КОГДА СвободныеЯчейки.Линия = ""035""
	|			ТОГДА 35
	|		КОГДА СвободныеЯчейки.Линия = ""36""
	|			ТОГДА 36
	|		КОГДА СвободныеЯчейки.Линия = ""036""
	|			ТОГДА 36
	|		КОГДА СвободныеЯчейки.Линия = ""37""
	|			ТОГДА 37
	|		КОГДА СвободныеЯчейки.Линия = ""037""
	|			ТОГДА 37
	|		КОГДА СвободныеЯчейки.Линия = ""38""
	|			ТОГДА 38
	|		КОГДА СвободныеЯчейки.Линия = ""038""
	|			ТОГДА 38
	|		КОГДА СвободныеЯчейки.Линия = ""39""
	|			ТОГДА 39
	|		КОГДА СвободныеЯчейки.Линия = ""039""
	|			ТОГДА 39
	|		КОГДА СвободныеЯчейки.Линия = ""40""
	|			ТОГДА 40
	|		КОГДА СвободныеЯчейки.Линия = ""040""
	|			ТОГДА 40
	|		КОГДА СвободныеЯчейки.Линия = ""41""
	|			ТОГДА 41
	|		КОГДА СвободныеЯчейки.Линия = ""041""
	|			ТОГДА 41
	|		КОГДА СвободныеЯчейки.Линия = ""42""
	|			ТОГДА 42
	|		КОГДА СвободныеЯчейки.Линия = ""042""
	|			ТОГДА 42
	|		КОГДА СвободныеЯчейки.Линия = ""43""
	|			ТОГДА 43
	|		КОГДА СвободныеЯчейки.Линия = ""043""
	|			ТОГДА 43
	|		КОГДА СвободныеЯчейки.Линия = ""44""
	|			ТОГДА 44
	|		КОГДА СвободныеЯчейки.Линия = ""044""
	|			ТОГДА 44
	|		КОГДА СвободныеЯчейки.Линия = ""45""
	|			ТОГДА 45
	|		КОГДА СвободныеЯчейки.Линия = ""045""
	|			ТОГДА 45
	|		КОГДА СвободныеЯчейки.Линия = ""46""
	|			ТОГДА 46
	|		КОГДА СвободныеЯчейки.Линия = ""046""
	|			ТОГДА 46
	|		КОГДА СвободныеЯчейки.Линия = ""47""
	|			ТОГДА 47
	|		КОГДА СвободныеЯчейки.Линия = ""047""
	|			ТОГДА 47
	|		КОГДА СвободныеЯчейки.Линия = ""48""
	|			ТОГДА 48
	|		КОГДА СвободныеЯчейки.Линия = ""048""
	|			ТОГДА 48
	|		КОГДА СвободныеЯчейки.Линия = ""49""
	|			ТОГДА 49
	|		КОГДА СвободныеЯчейки.Линия = ""049""
	|			ТОГДА 49
	|		КОГДА СвободныеЯчейки.Линия = ""50""
	|			ТОГДА 50
	|		КОГДА СвободныеЯчейки.Линия = ""050""
	|			ТОГДА 50
	|		КОГДА СвободныеЯчейки.Линия = ""51""
	|			ТОГДА 51
	|		КОГДА СвободныеЯчейки.Линия = ""051""
	|			ТОГДА 51
	|		КОГДА СвободныеЯчейки.Линия = ""52""
	|			ТОГДА 52
	|		КОГДА СвободныеЯчейки.Линия = ""052""
	|			ТОГДА 52
	|		КОГДА СвободныеЯчейки.Линия = ""53""
	|			ТОГДА 53
	|		КОГДА СвободныеЯчейки.Линия = ""053""
	|			ТОГДА 53
	|		КОГДА СвободныеЯчейки.Линия = ""54""
	|			ТОГДА 54
	|		КОГДА СвободныеЯчейки.Линия = ""054""
	|			ТОГДА 54
	|		КОГДА СвободныеЯчейки.Линия = ""55""
	|			ТОГДА 55
	|		КОГДА СвободныеЯчейки.Линия = ""055""
	|			ТОГДА 55
	|		КОГДА СвободныеЯчейки.Линия = ""56""
	|			ТОГДА 56
	|		КОГДА СвободныеЯчейки.Линия = ""056""
	|			ТОГДА 56
	|		КОГДА СвободныеЯчейки.Линия = ""57""
	|			ТОГДА 57
	|		КОГДА СвободныеЯчейки.Линия = ""057""
	|			ТОГДА 57
	|		КОГДА СвободныеЯчейки.Линия = ""58""
	|			ТОГДА 58
	|		КОГДА СвободныеЯчейки.Линия = ""058""
	|			ТОГДА 58
	|		КОГДА СвободныеЯчейки.Линия = ""59""
	|			ТОГДА 59
	|		КОГДА СвободныеЯчейки.Линия = ""059""
	|			ТОГДА 59
	|		КОГДА СвободныеЯчейки.Линия = ""60""
	|			ТОГДА 60
	|		КОГДА СвободныеЯчейки.Линия = ""060""
	|			ТОГДА 60
	|		КОГДА СвободныеЯчейки.Линия = ""61""
	|			ТОГДА 61
	|		КОГДА СвободныеЯчейки.Линия = ""061""
	|			ТОГДА 61
	|		КОГДА СвободныеЯчейки.Линия = ""62""
	|			ТОГДА 62
	|		КОГДА СвободныеЯчейки.Линия = ""062""
	|			ТОГДА 62
	|		КОГДА СвободныеЯчейки.Линия = ""63""
	|			ТОГДА 63
	|		КОГДА СвободныеЯчейки.Линия = ""063""
	|			ТОГДА 63
	|		КОГДА СвободныеЯчейки.Линия = ""64""
	|			ТОГДА 64
	|		КОГДА СвободныеЯчейки.Линия = ""064""
	|			ТОГДА 64
	|		КОГДА СвободныеЯчейки.Линия = ""65""
	|			ТОГДА 65
	|		КОГДА СвободныеЯчейки.Линия = ""065""
	|			ТОГДА 65
	|		КОГДА СвободныеЯчейки.Линия = ""66""
	|			ТОГДА 66
	|		КОГДА СвободныеЯчейки.Линия = ""066""
	|			ТОГДА 66
	|		КОГДА СвободныеЯчейки.Линия = ""67""
	|			ТОГДА 67
	|		КОГДА СвободныеЯчейки.Линия = ""067""
	|			ТОГДА 67
	|		КОГДА СвободныеЯчейки.Линия = ""68""
	|			ТОГДА 68
	|		КОГДА СвободныеЯчейки.Линия = ""068""
	|			ТОГДА 68
	|		КОГДА СвободныеЯчейки.Линия = ""69""
	|			ТОГДА 69
	|		КОГДА СвободныеЯчейки.Линия = ""069""
	|			ТОГДА 69
	|		КОГДА СвободныеЯчейки.Линия = ""70""
	|			ТОГДА 70
	|		КОГДА СвободныеЯчейки.Линия = ""070""
	|			ТОГДА 70
	|		КОГДА СвободныеЯчейки.Линия = ""71""
	|			ТОГДА 71
	|		КОГДА СвободныеЯчейки.Линия = ""071""
	|			ТОГДА 71
	|		КОГДА СвободныеЯчейки.Линия = ""72""
	|			ТОГДА 72
	|		КОГДА СвободныеЯчейки.Линия = ""072""
	|			ТОГДА 72
	|		КОГДА СвободныеЯчейки.Линия = ""73""
	|			ТОГДА 73
	|		КОГДА СвободныеЯчейки.Линия = ""073""
	|			ТОГДА 73
	|		КОГДА СвободныеЯчейки.Линия = ""74""
	|			ТОГДА 74
	|		КОГДА СвободныеЯчейки.Линия = ""074""
	|			ТОГДА 74
	|		КОГДА СвободныеЯчейки.Линия = ""75""
	|			ТОГДА 75
	|		КОГДА СвободныеЯчейки.Линия = ""075""
	|			ТОГДА 75
	|		КОГДА СвободныеЯчейки.Линия = ""76""
	|			ТОГДА 76
	|		КОГДА СвободныеЯчейки.Линия = ""076""
	|			ТОГДА 76
	|		КОГДА СвободныеЯчейки.Линия = ""77""
	|			ТОГДА 77
	|		КОГДА СвободныеЯчейки.Линия = ""077""
	|			ТОГДА 77
	|		КОГДА СвободныеЯчейки.Линия = ""78""
	|			ТОГДА 78
	|		КОГДА СвободныеЯчейки.Линия = ""078""
	|			ТОГДА 78
	|		КОГДА СвободныеЯчейки.Линия = ""79""
	|			ТОГДА 79
	|		КОГДА СвободныеЯчейки.Линия = ""079""
	|			ТОГДА 79
	|		КОГДА СвободныеЯчейки.Линия = ""80""
	|			ТОГДА 80
	|		КОГДА СвободныеЯчейки.Линия = ""080""
	|			ТОГДА 80
	|		КОГДА СвободныеЯчейки.Линия = ""81""
	|			ТОГДА 81
	|		КОГДА СвободныеЯчейки.Линия = ""081""
	|			ТОГДА 81
	|		КОГДА СвободныеЯчейки.Линия = ""82""
	|			ТОГДА 82
	|		КОГДА СвободныеЯчейки.Линия = ""082""
	|			ТОГДА 82
	|		КОГДА СвободныеЯчейки.Линия = ""83""
	|			ТОГДА 83
	|		КОГДА СвободныеЯчейки.Линия = ""083""
	|			ТОГДА 83
	|		КОГДА СвободныеЯчейки.Линия = ""84""
	|			ТОГДА 84
	|		КОГДА СвободныеЯчейки.Линия = ""084""
	|			ТОГДА 84
	|		КОГДА СвободныеЯчейки.Линия = ""85""
	|			ТОГДА 85
	|		КОГДА СвободныеЯчейки.Линия = ""085""
	|			ТОГДА 85
	|		КОГДА СвободныеЯчейки.Линия = ""86""
	|			ТОГДА 86
	|		КОГДА СвободныеЯчейки.Линия = ""086""
	|			ТОГДА 86
	|		КОГДА СвободныеЯчейки.Линия = ""87""
	|			ТОГДА 87
	|		КОГДА СвободныеЯчейки.Линия = ""087""
	|			ТОГДА 87
	|		КОГДА СвободныеЯчейки.Линия = ""88""
	|			ТОГДА 88
	|		КОГДА СвободныеЯчейки.Линия = ""088""
	|			ТОГДА 88
	|		КОГДА СвободныеЯчейки.Линия = ""89""
	|			ТОГДА 89
	|		КОГДА СвободныеЯчейки.Линия = ""089""
	|			ТОГДА 89
	|		КОГДА СвободныеЯчейки.Линия = ""90""
	|			ТОГДА 90
	|		КОГДА СвободныеЯчейки.Линия = ""090""
	|			ТОГДА 90
	|		КОГДА СвободныеЯчейки.Линия = ""91""
	|			ТОГДА 91
	|		КОГДА СвободныеЯчейки.Линия = ""091""
	|			ТОГДА 91
	|		КОГДА СвободныеЯчейки.Линия = ""92""
	|			ТОГДА 92
	|		КОГДА СвободныеЯчейки.Линия = ""092""
	|			ТОГДА 92
	|		КОГДА СвободныеЯчейки.Линия = ""93""
	|			ТОГДА 93
	|		КОГДА СвободныеЯчейки.Линия = ""093""
	|			ТОГДА 93
	|		КОГДА СвободныеЯчейки.Линия = ""94""
	|			ТОГДА 94
	|		КОГДА СвободныеЯчейки.Линия = ""094""
	|			ТОГДА 94
	|		КОГДА СвободныеЯчейки.Линия = ""95""
	|			ТОГДА 95
	|		КОГДА СвободныеЯчейки.Линия = ""095""
	|			ТОГДА 95
	|		КОГДА СвободныеЯчейки.Линия = ""96""
	|			ТОГДА 96
	|		КОГДА СвободныеЯчейки.Линия = ""096""
	|			ТОГДА 96
	|		КОГДА СвободныеЯчейки.Линия = ""97""
	|			ТОГДА 97
	|		КОГДА СвободныеЯчейки.Линия = ""097""
	|			ТОГДА 97
	|		КОГДА СвободныеЯчейки.Линия = ""98""
	|			ТОГДА 98
	|		КОГДА СвободныеЯчейки.Линия = ""098""
	|			ТОГДА 98
	|		КОГДА СвободныеЯчейки.Линия = ""99""
	|			ТОГДА 99
	|		КОГДА СвободныеЯчейки.Линия = ""099""
	|			ТОГДА 99
	|		КОГДА СвободныеЯчейки.Линия = ""100""
	|			ТОГДА 100
	|		КОГДА СвободныеЯчейки.Линия = ""0100""
	|			ТОГДА 100
	|		ИНАЧЕ СвободныеЯчейки.Линия
	|	КОНЕЦ КАК Линия,
	|	СвободныеЯчейки.Секция,
	|	СвободныеЯчейки.Стеллаж,
	|	СвободныеЯчейки.Ярус,
	|	СвободныеЯчейки.ПорядокОбхода,
	|	СвободныеЯчейки.КоличествоПаллет - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) КАК
	|		КоличествоПаллет,
	|	СвободныеЯчейки.НомерРяда_Пролета,
	|	СвободныеЯчейки.Зона
	|ПОМЕСТИТЬ ТаблицаАнализаСвободныхЯчеек
	|ИЗ
	|	СвободныеЯчейки КАК СвободныеЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПаллетМестГруппировка КАК ТаблицаПаллетМестГруппировка
	|		ПО СвободныеЯчейки.Ячейка = ТаблицаПаллетМестГруппировка.Ячейка
	|ГДЕ
	|	СвободныеЯчейки.КоличествоПаллет - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) >= 1
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПаллетМест
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПаллетМестГруппировка";
	
	Запрос.УстановитьПараметр("ТаблицаПаллетМест", ТаблицаПаллетМест);
	
	//@skip-warning
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры

Функция ЗапроситьИнформациюПоЯчейкамНоваяОграниченияПоЛиниям(МенеджерВременныхТаблиц,СтруктураДанных)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
	|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
	|	ТаблицаАнализаСвободныхЯчеек.Линия КАК Линия,
	|	ТаблицаАнализаСвободныхЯчеек.Секция,
	|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
	|	ТаблицаАнализаСвободныхЯчеек.Ярус,
	|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
	|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
	|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
	|	ТаблицаАнализаСвободныхЯчеек.Зона,
	|	ВЫБОР
	|		КОГДА &РазмещатьПоБлижайшейЗонеПриемки
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода >= 0
	|						ТОГДА ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода
	|					ИНАЧЕ -(ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокОбходаПоЗонеПриемки,
	|	ВЫБОР
	|		КОГДА &РазмещатьСПриоритетомХранения
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаАнализаСвободныхЯчеек.Зона = ЗНАЧЕНИЕ(Перечисление.итWMSЗоныСклада.Хранения)
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаАнализаСвободныхЯчеек.Зона = ЗНАЧЕНИЕ(Перечисление.итWMSЗоныСклада.Пикинга)
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ КАК ПриоритетЗоны
	|ПОМЕСТИТЬ ТаблицаОтбораСвободныхЯчеек
	|ИЗ
	|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(&СкладскоеПомещение, ЗНАЧЕНИЕ(Справочник.итСкладскиеПомещения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.итСкладскиеПомещения.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение = &СкладскоеПомещение
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СвободныеЯчейки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
	|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
	|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
	|	ТаблицаАнализаСвободныхЯчеек.Линия,
	|	ТаблицаАнализаСвободныхЯчеек.Секция,
	|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
	|	ТаблицаАнализаСвободныхЯчеек.Ярус,
	|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
	|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
	|	ТаблицаАнализаСвободныхЯчеек.Зона
	|ПОМЕСТИТЬ СвободныеЯчейки
	|ИЗ
	|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаАнализаСвободныхЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтбораСвободныхЯчеек.Ячейка КАК Ячейка,
	|	ТаблицаОтбораСвободныхЯчеек.СкладскоеПомещение,
	|	ТаблицаОтбораСвободныхЯчеек.Линия КАК Линия,
	|	ТаблицаОтбораСвободныхЯчеек.Секция,
	|	ТаблицаОтбораСвободныхЯчеек.Стеллаж,
	|	ТаблицаОтбораСвободныхЯчеек.Ярус,
	|	ТаблицаОтбораСвободныхЯчеек.ПорядокОбхода,
	|	ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет,
	|	ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета,
	|	ТаблицаОтбораСвободныхЯчеек.ПорядокОбходаПоЗонеПриемки КАК ПорядокОбходаПоЗонеПриемки
	|ИЗ
	|	ТаблицаОтбораСвободныхЯчеек КАК ТаблицаОтбораСвободныхЯчеек
	|ГДЕ
	|	ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет >= 1
	|	И ТаблицаОтбораСвободныхЯчеек.Линия МЕЖДУ &ЛинияС И &ЛинияПо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаОтбораСвободныхЯчеек.ПриоритетЗоны,
	|	ПорядокОбходаПоЗонеПриемки,
	|	Линия,
	|	Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаОтбораСвободныхЯчеек";
	
	Запрос.УстановитьПараметр("ЛинияС",СтруктураДанных.ЛинияС);
	Запрос.УстановитьПараметр("ЛинияПо",СтруктураДанных.ЛинияПо);
	Запрос.УстановитьПараметр("СкладскоеПомещение",СтруктураДанных.СкладскоеПомещениеКРазмещению);
	Запрос.УстановитьПараметр("РазмещатьСПриоритетомХранения",СтруктураДанных.РазмещатьСПриоритетомХранения);
	Запрос.УстановитьПараметр("РазмещатьПоБлижайшейЗонеПриемки",СтруктураДанных.РазмещатьПоБлижайшейЗонеПриемки);
	Запрос.УстановитьПараметр("НачалоОтсчетаПорядкаОбхода",СтруктураДанных.НачалоОтсчетаПорядкаОбхода);
	
	Возврат Запрос.Выполнить();
КонецФункции

Функция ЗапроситьИнформациюПоЯчейкамНоваяВРядИлиЛинию(МенеджерВременныхТаблиц,СтруктураДанных)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
	|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
	|	ТаблицаАнализаСвободныхЯчеек.Линия КАК Линия,
	|	ТаблицаАнализаСвободныхЯчеек.Секция,
	|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
	|	ТаблицаАнализаСвободныхЯчеек.Ярус,
	|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
	|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
	|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
	|	ТаблицаАнализаСвободныхЯчеек.Зона,
	|	ВЫБОР
	|		КОГДА &РазмещатьПоБлижайшейЗонеПриемки
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода >= 0
	|						ТОГДА ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода
	|					ИНАЧЕ -(ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокОбходаПоЗонеПриемки,
	|	ВЫБОР
	|		КОГДА &РазмещатьСПриоритетомХранения
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаАнализаСвободныхЯчеек.Зона = ЗНАЧЕНИЕ(Перечисление.итWMSЗоныСклада.Хранения)
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПриоритетЗоныХранения
	|ПОМЕСТИТЬ ТаблицаОтбораСвободныхЯчеек
	|ИЗ
	|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(&СкладскоеПомещение, ЗНАЧЕНИЕ(Справочник.итСкладскиеПомещения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.итСкладскиеПомещения.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение = &СкладскоеПомещение
	|		КОНЕЦ
	|	И ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВложенныйЗапрос.Линия, -1) КАК НомерЛинии,
	|	ВложенныйЗапрос.ПорядокОбходаПоЗонеПриемки
	|ПОМЕСТИТЬ ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаОтбораСвободныхЯчеек.Линия КАК Линия,
	|		СУММА(ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет) КАК КоличествоПаллет,
	|		МИНИМУМ(ТаблицаОтбораСвободныхЯчеек.ПорядокОбходаПоЗонеПриемки) КАК ПорядокОбходаПоЗонеПриемки
	|	ИЗ
	|		ТаблицаОтбораСвободныхЯчеек КАК ТаблицаОтбораСвободныхЯчеек
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаОтбораСвободныхЯчеек.Линия) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.КоличествоПаллет >= &КоличествоПаллет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВложенныйЗапрос.НомерРяда_Пролета, -1) КАК НомерРяда_Пролета,
	|	ВложенныйЗапрос.ПорядокОбходаПоЗонеПриемки
	|ПОМЕСТИТЬ РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета КАК НомерРяда_Пролета,
	|		СУММА(ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет) КАК КоличествоПаллет,
	|		МИНИМУМ(ТаблицаОтбораСвободныхЯчеек.ПорядокОбходаПоЗонеПриемки) КАК ПорядокОбходаПоЗонеПриемки
	|	ИЗ
	|		ТаблицаОтбораСвободныхЯчеек КАК ТаблицаОтбораСвободныхЯчеек
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.КоличествоПаллет >= &КоличествоПаллет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ячейка,
	|	ВложенныйЗапрос.СкладскоеПомещение,
	|	ВложенныйЗапрос.Линия,
	|	ВложенныйЗапрос.Секция,
	|	ВложенныйЗапрос.Стеллаж,
	|	ВложенныйЗапрос.Ярус,
	|	ВложенныйЗапрос.ПорядокОбхода,
	|	ВложенныйЗапрос.КоличествоПаллет,
	|	ВложенныйЗапрос.НомерРяда_Пролета,
	|	ВложенныйЗапрос.ЕстьРядУдовлетворяющийУсловиям,
	|	ВложенныйЗапрос.ЕстьЛинияУдовлетворяющаяУсловию,
	|	ВложенныйЗапрос.Зона,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЭтоЛинияПоУсловия
	|			ТОГДА ВложенныйЗапрос.ПорядокОбходаПоЗонеПриемкиЛинии
	|		КОГДА ВложенныйЗапрос.ЭтоРядПоУсловию
	|			ТОГДА ВложенныйЗапрос.ПорядокОбходаПоЗонеПриемкиРяда
	|		ИНАЧЕ ВложенныйЗапрос.ПорядокОбходаПоЗонеПриемки
	|	КОНЕЦ КАК ПорядокОбходаПоЗонеПриемки,
	|	ВложенныйЗапрос.ПриоритетЗоныХранения
	|ПОМЕСТИТЬ ДанныеОтборов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаОтбораСвободныхЯчеек.Ячейка КАК Ячейка,
	|		ТаблицаОтбораСвободныхЯчеек.СкладскоеПомещение КАК СкладскоеПомещение,
	|		ТаблицаОтбораСвободныхЯчеек.Линия КАК Линия,
	|		ТаблицаОтбораСвободныхЯчеек.Секция КАК Секция,
	|		ТаблицаОтбораСвободныхЯчеек.Стеллаж КАК Стеллаж,
	|		ТаблицаОтбораСвободныхЯчеек.Ярус КАК Ярус,
	|		ТаблицаОтбораСвободныхЯчеек.ПорядокОбхода КАК ПорядокОбхода,
	|		ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет КАК КоличествоПаллет,
	|		ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета КАК НомерРяда_Пролета,
	|		ВложенныйЗапрос.ЕстьРядУдовлетворяющийУсловиям КАК ЕстьРядУдовлетворяющийУсловиям,
	|		ВложенныйЗапрос.ЕстьЛинияУдовлетворяющаяУсловию КАК ЕстьЛинияУдовлетворяющаяУсловию,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ТаблицаОтбораСвободныхЯчеек.Линия, 0) = ЕСТЬNULL(ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии.НомерЛинии, -1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоЛинияПоУсловия,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета, 0) = ЕСТЬNULL(РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду.НомерРяда_Пролета, -1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоРядПоУсловию,
	|		ТаблицаОтбораСвободныхЯчеек.Зона КАК Зона,
	|		ТаблицаОтбораСвободныхЯчеек.ПорядокОбходаПоЗонеПриемки КАК ПорядокОбходаПоЗонеПриемки,
	|		ТаблицаОтбораСвободныхЯчеек.ПриоритетЗоныХранения КАК ПриоритетЗоныХранения,
	|		РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду.ПорядокОбходаПоЗонеПриемки КАК ПорядокОбходаПоЗонеПриемкиРяда,
	|		ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии.ПорядокОбходаПоЗонеПриемки КАК ПорядокОбходаПоЗонеПриемкиЛинии
	|	ИЗ
	|		ТаблицаОтбораСвободныхЯчеек КАК ТаблицаОтбораСвободныхЯчеек
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета, 0) = ЕСТЬNULL(РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду.НомерРяда_Пролета, -1)
	|							ТОГДА 1
	|						ИНАЧЕ 0
	|					КОНЕЦ) КАК ЕстьРядУдовлетворяющийУсловиям,
	|				МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(ТаблицаОтбораСвободныхЯчеек.Линия, 0) = ЕСТЬNULL(ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии.НомерЛинии, -1)
	|							ТОГДА 1
	|						ИНАЧЕ 0
	|					КОНЕЦ) КАК ЕстьЛинияУдовлетворяющаяУсловию
	|			ИЗ
	|				ТаблицаОтбораСвободныхЯчеек КАК ТаблицаОтбораСвободныхЯчеек
	|					ЛЕВОЕ СОЕДИНЕНИЕ РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду КАК РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду
	|					ПО (РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду.НомерРяда_Пролета = ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета)
	|					ЛЕВОЕ СОЕДИНЕНИЕ ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии КАК ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии
	|					ПО ТаблицаОтбораСвободныхЯчеек.Линия = ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии.НомерЛинии) КАК ВложенныйЗапрос
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии КАК ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии
	|			ПО ТаблицаОтбораСвободныхЯчеек.Линия = ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии.НомерЛинии
	|			ЛЕВОЕ СОЕДИНЕНИЕ РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду КАК РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду
	|			ПО ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета = РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду.НомерРяда_Пролета) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВложенныйЗапрос.ЕстьЛинияУдовлетворяющаяУсловию > 0
	|				ТОГДА ВложенныйЗапрос.ЭтоЛинияПоУсловия
	|			КОГДА ВложенныйЗапрос.ЕстьРядУдовлетворяющийУсловиям > 0
	|				ТОГДА ВложенныйЗапрос.ЭтоРядПоУсловию
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СвободныеЯчейки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
	|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
	|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
	|	ТаблицаАнализаСвободныхЯчеек.Линия,
	|	ТаблицаАнализаСвободныхЯчеек.Секция,
	|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
	|	ТаблицаАнализаСвободныхЯчеек.Ярус,
	|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
	|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
	|	ТаблицаАнализаСвободныхЯчеек.Зона
	|ПОМЕСТИТЬ СвободныеЯчейки
	|ИЗ
	|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаАнализаСвободныхЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОтборов.Ячейка КАК Ячейка,
	|	ДанныеОтборов.СкладскоеПомещение КАК СкладскоеПомещение,
	|	ДанныеОтборов.Линия КАК Линия,
	|	ДанныеОтборов.Секция,
	|	ДанныеОтборов.Стеллаж,
	|	ДанныеОтборов.Ярус,
	|	ДанныеОтборов.ПорядокОбхода,
	|	ДанныеОтборов.КоличествоПаллет,
	|	ДанныеОтборов.НомерРяда_Пролета КАК НомерРяда_Пролета,
	|	ДанныеОтборов.ПорядокОбходаПоЗонеПриемки КАК ПорядокОбходаПоЗонеПриемки
	|ИЗ
	|	ДанныеОтборов КАК ДанныеОтборов
	|ГДЕ
	|	ДанныеОтборов.КоличествоПаллет > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокОбходаПоЗонеПриемки,
	|	СкладскоеПомещение,
	|	НомерРяда_Пролета,
	|	Линия,
	|	ДанныеОтборов.ПриоритетЗоныХранения,
	|	Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаОтбораСвободныхЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеОтборов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЛинияУдовлетворяющаяУсловиямРазмещенияНа1Линии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РядУдовлетоваряющийУсловиямРазмещенияНа1Ряду";
	
	Запрос.УстановитьПараметр("СкладскоеПомещение",СтруктураДанных.СкладскоеПомещениеКРазмещению);
	Запрос.УстановитьПараметр("РазмещатьСПриоритетомХранения",СтруктураДанных.РазмещатьСПриоритетомХранения);
	Запрос.УстановитьПараметр("РазмещатьПоБлижайшейЗонеПриемки",СтруктураДанных.РазмещатьПоБлижайшейЗонеПриемки);
	Запрос.УстановитьПараметр("НачалоОтсчетаПорядкаОбхода",СтруктураДанных.НачалоОтсчетаПорядкаОбхода);
	Запрос.УстановитьПараметр("КоличествоПаллет",СтруктураДанных.КоличествоПаллетКРазмещению);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ЗапроситьИнформациюПоЯчейкамРядомСПриемкой(МенеджерВременныхТаблиц,СтруктураДанных)
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
	|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
	|	ТаблицаАнализаСвободныхЯчеек.Линия КАК Линия,
	|	ТаблицаАнализаСвободныхЯчеек.Секция,
	|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
	|	ТаблицаАнализаСвободныхЯчеек.Ярус,
	|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
	|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
	|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
	|	ТаблицаАнализаСвободныхЯчеек.Зона,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода >= 0
	|			ТОГДА ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода
	|		ИНАЧЕ -(ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода)
	|	КОНЕЦ КАК ПорядокОбходаПоЗонеПриемки
	|ПОМЕСТИТЬ ТаблицаОтбораСвободныхЯчеек
	|ИЗ
	|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(&СкладскоеПомещение, ЗНАЧЕНИЕ(Справочник.итСкладскиеПомещения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.итСкладскиеПомещения.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение = &СкладскоеПомещение
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СвободныеЯчейки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
	|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
	|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
	|	ТаблицаАнализаСвободныхЯчеек.Линия,
	|	ТаблицаАнализаСвободныхЯчеек.Секция,
	|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
	|	ТаблицаАнализаСвободныхЯчеек.Ярус,
	|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
	|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
	|	ТаблицаАнализаСвободныхЯчеек.Зона
	|ПОМЕСТИТЬ СвободныеЯчейки
	|ИЗ
	|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаАнализаСвободныхЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтбораСвободныхЯчеек.Ячейка КАК Ячейка,
	|	ТаблицаОтбораСвободныхЯчеек.СкладскоеПомещение,
	|	ТаблицаОтбораСвободныхЯчеек.Линия КАК Линия,
	|	ТаблицаОтбораСвободныхЯчеек.Секция,
	|	ТаблицаОтбораСвободныхЯчеек.Стеллаж,
	|	ТаблицаОтбораСвободныхЯчеек.Ярус,
	|	ТаблицаОтбораСвободныхЯчеек.ПорядокОбхода,
	|	ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет,
	|	ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета,
	|	ТаблицаОтбораСвободныхЯчеек.ПорядокОбходаПоЗонеПриемки КАК ПорядокОбходаПоЗонеПриемки
	|ИЗ
	|	ТаблицаОтбораСвободныхЯчеек КАК ТаблицаОтбораСвободныхЯчеек
	|ГДЕ
	|	ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокОбходаПоЗонеПриемки,
	|	Линия,
	|	Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаОтбораСвободныхЯчеек";
	Запрос.УстановитьПараметр("СкладскоеПомещение",СтруктураДанных.СкладскоеПомещениеКРазмещению);
	Запрос.УстановитьПараметр("НачалоОтсчетаПорядкаОбхода",СтруктураДанных.НачалоОтсчетаПорядкаОбхода);
	
	Возврат Запрос.Выполнить();
	
	
КонецФункции

Функция ТекстЗапросаПоискаЯчеекРазмещенияОПТ()
	Текст="ВЫБРАТЬ
	      |	Товары.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	      |	Товары.Номенклатура КАК Номенклатура,
	      |	Товары.СерияНоменклатуры КАК СерияНоменклатуры,
	      |	ЗНАЧЕНИЕ(Справочник.итскладскиеячейки.пустаяячейка) КАК ЯчейкаОтправитель
	      |ПОМЕСТИТЬ ТоварыДокумента
	      |ИЗ
	      |	&Товары КАК Товары
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	ТоварыДокумента.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	      |	ВЫРАЗИТЬ(ТоварыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	      |	ВЫРАЗИТЬ(ТоварыДокумента.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
	      |	ВЫБОР
	      |		КОГДА &СкладскоеПомещение = ЗНАЧЕНИЕ(Справочник.ИтСкладскиеПомещения.ПустаяСсылка)
	      |			ТОГДА ВЫРАЗИТЬ(ТоварыДокумента.Номенклатура КАК Справочник.Номенклатура).итПреоритетнаяЗонаРазмещения
	      |		ИНАЧЕ &СкладскоеПомещение
	      |	КОНЕЦ КАК СкладскоеПомещение,
	      |	ЛОЖЬ КАК КарантинПаллеты,
	      |	ВЫРАЗИТЬ(ТоварыДокумента.ЯчейкаОтправитель КАК Справочник.итСкладскиеЯчейки) КАК ЯчейкаОтправитель,
	      |	ЕСТЬNULL(ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчасткаСрезПоследних.АссортиментныйУчастокСклада, ЗНАЧЕНИЕ(Справочник.ит_WMS_АссортиментныеУчасткиСклада.ПустаяСсылка)) КАК АссортиментныйУчастокСклада
	      |ПОМЕСТИТЬ ТаблицаТоваровЗаготокаДляОбработки
	      |ИЗ
	      |	ТоварыДокумента КАК ТоварыДокумента
	      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка.СрезПоследних(, Организация = &Организация) КАК ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчасткаСрезПоследних
	      |		ПО ТоварыДокумента.Номенклатура = ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчасткаСрезПоследних.Номенклатура
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	ТоварыДокумента.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыДокумента.Номенклатура) КАК КоличествоРазличнойНомеклатуры,
	      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыДокумента.СерияНоменклатуры) КАК КоличествоРазличныхСерий,
	      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыДокумента.ЯчейкаОтправитель) КАК КоличествоРазличныхЯчеекОтправителей
	      |ПОМЕСТИТЬ РабиениеНаОднородныеНеОднородныеПаллеты
	      |ИЗ
	      |	ТоварыДокумента КАК ТоварыДокумента
	      |
	      |СГРУППИРОВАТЬ ПО
	      |	ТоварыДокумента.ИдентификаторУпаковки
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	РабиениеНаОднородныеНеОднородныеПаллеты.ИдентификаторУпаковки КАК ИдентификаторУпаковки
	      |ПОМЕСТИТЬ ОднородныеПаллеты
	      |ИЗ
	      |	РабиениеНаОднородныеНеОднородныеПаллеты КАК РабиениеНаОднородныеНеОднородныеПаллеты
	      |ГДЕ
	      |	РабиениеНаОднородныеНеОднородныеПаллеты.КоличествоРазличнойНомеклатуры = 1
	      |	И РабиениеНаОднородныеНеОднородныеПаллеты.КоличествоРазличныхСерий = 1
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	РабиениеНаОднородныеНеОднородныеПаллеты.ИдентификаторУпаковки КАК ИдентификаторУпаковки
	      |ПОМЕСТИТЬ НеОднородныеПаллеты
	      |ИЗ
	      |	РабиениеНаОднородныеНеОднородныеПаллеты КАК РабиениеНаОднородныеНеОднородныеПаллеты
	      |ГДЕ
	      |	РабиениеНаОднородныеНеОднородныеПаллеты.КоличествоРазличнойНомеклатуры > 1
	      |	И РабиениеНаОднородныеНеОднородныеПаллеты.КоличествоРазличныхСерий > 1
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	      |	ТаблицаТоваровЗаготокаДляОбработки.Номенклатура КАК Номенклатура,
	      |	ТаблицаТоваровЗаготокаДляОбработки.СкладскоеПомещение КАК НоменклатураитПреоритетнаяЗонаРазмещения,
	      |	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки КАК КоличествоПаллетНоменклатуры,
	      |	ТаблицаТоваровЗаготокаДляОбработки.СерияНоменклатуры КАК СерияНоменклатуры,
	      |	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК КоличествоРазличныхЯчеекОтправителей,
	      |	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	      |	ТаблицаТоваровЗаготокаДляОбработки.АссортиментныйУчастокСклада КАК АссортиментныйУчастокСклада
	      |ИЗ
	      |	ОднородныеПаллеты КАК ОднородныеПаллеты
	      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваровЗаготокаДляОбработки КАК ТаблицаТоваровЗаготокаДляОбработки
	      |		ПО ОднородныеПаллеты.ИдентификаторУпаковки = ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки
	      |ГДЕ
	      |	ТаблицаТоваровЗаготокаДляОбработки.КарантинПаллеты = ЛОЖЬ
	      |
	      |УПОРЯДОЧИТЬ ПО
	      |	СерияНоменклатуры
	      |ИТОГИ
	      |	МАКСИМУМ(НоменклатураитПреоритетнаяЗонаРазмещения),
	      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоПаллетНоменклатуры),
	      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоРазличныхЯчеекОтправителей),
	      |	МАКСИМУМ(ЯчейкаОтправитель),
	      |	МАКСИМУМ(АссортиментныйУчастокСклада)
	      |ПО
	      |	Номенклатура,
	      |	ИдентификаторУпаковки
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	      |	ТаблицаТоваровЗаготокаДляОбработки.СкладскоеПомещение КАК НоменклатураитПреоритетнаяЗонаРазмещения,
	      |	ТаблицаТоваровЗаготокаДляОбработки.Номенклатура КАК Номенклатура,
	      |	ТаблицаТоваровЗаготокаДляОбработки.СкладскоеПомещение КАК СкладскоеПомещение,
	      |	ТаблицаТоваровЗаготокаДляОбработки.СерияНоменклатуры КАК СерияНоменклатуры,
	      |	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК КоличествоРазличныхЯчеекОтправителей,
	      |	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
	      |	ТаблицаТоваровЗаготокаДляОбработки.АссортиментныйУчастокСклада КАК АссортиментныйУчастокСклада
	      |ИЗ
	      |	НеОднородныеПаллеты КАК НеОднородныеПаллеты
	      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваровЗаготокаДляОбработки КАК ТаблицаТоваровЗаготокаДляОбработки
	      |		ПО НеОднородныеПаллеты.ИдентификаторУпаковки = ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки
	      |ГДЕ
	      |	ТаблицаТоваровЗаготокаДляОбработки.КарантинПаллеты = ЛОЖЬ
	      |
	      |УПОРЯДОЧИТЬ ПО
	      |	СерияНоменклатуры
	      |ИТОГИ
	      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураитПреоритетнаяЗонаРазмещения),
	      |	МАКСИМУМ(СкладскоеПомещение),
	      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоРазличныхЯчеекОтправителей),
	      |	МАКСИМУМ(ЯчейкаОтправитель),
	      |	МАКСИМУМ(АссортиментныйУчастокСклада)
	      |ПО
	      |	ИдентификаторУпаковки
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	      |	&ЗонаКарантина КАК НоменклатураитПреоритетнаяЗонаРазмещения,
	      |	&ЗонаКарантина КАК СкладскоеПомещение,
	      |	ТаблицаТоваровЗаготокаДляОбработки.Номенклатура КАК Номенклатура,
	      |	ТаблицаТоваровЗаготокаДляОбработки.СерияНоменклатуры КАК СерияНоменклатуры,
	      |	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК КоличествоРазличныхЯчеекОтправителей,
	      |	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК ЯчейкаОтправитель
	      |ИЗ
	      |	ТаблицаТоваровЗаготокаДляОбработки КАК ТаблицаТоваровЗаготокаДляОбработки
	      |ГДЕ
	      |	ТаблицаТоваровЗаготокаДляОбработки.КарантинПаллеты = ИСТИНА
	      |
	      |УПОРЯДОЧИТЬ ПО
	      |	СерияНоменклатуры
	      |ИТОГИ
	      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураитПреоритетнаяЗонаРазмещения),
	      |	МАКСИМУМ(СкладскоеПомещение),
	      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоРазличныхЯчеекОтправителей),
	      |	МАКСИМУМ(ЯчейкаОтправитель)
	      |ПО
	      |	ИдентификаторУпаковки";
	Возврат Текст;
	КонецФункции

Процедура ЗапросСвободныхЯчеекСогласноПаллетМестОпт(МенеджерЗапроса,СтруктураДанных,ВидСкладскойДеятельности=Неопределено)	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерЗапроса;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итТоварыВЯчейках.Номенклатура,
	|	итТоварыВЯчейках.ИдентификаторУпаковки,
	|	итТоварыВЯчейках.ДатаРозлива,
	|	итТоварыВЯчейках.Качество,
	|	итТоварыВЯчейках.Организация,
	|	итТоварыВЯчейках.СерияНоменклатуры,
	|	итТоварыВЯчейках.Склад,
	|	итТоварыВЯчейках.Характеристика,
	|	итТоварыВЯчейках.Ячейка,
	|	СУММА(ВЫБОР
	|		КОГДА итТоварыВЯчейках.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА итТоварыВЯчейках.Количество + итТоварыВЯчейках.КРазмещению
	|		ИНАЧЕ -(итТоварыВЯчейках.Количество + итТоварыВЯчейках.КРазмещению)
	|	КОНЕЦ) КАК КоличествоДвиженияДокумента
	|ПОМЕСТИТЬ ДвиженияДокумента
	|ИЗ
	|	РегистрНакопления.итТоварыВЯчейках КАК итТоварыВЯчейках
	|ГДЕ
	|	итТоварыВЯчейках.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	итТоварыВЯчейках.ДатаРозлива,
	|	итТоварыВЯчейках.ИдентификаторУпаковки,
	|	итТоварыВЯчейках.Качество,
	|	итТоварыВЯчейках.Номенклатура,
	|	итТоварыВЯчейках.Организация,
	|	итТоварыВЯчейках.СерияНоменклатуры,
	|	итТоварыВЯчейках.Склад,
	|	итТоварыВЯчейках.Характеристика,
	|	итТоварыВЯчейках.Ячейка
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|	итТоварыВЯчейкахОстатки.КоличествоОстаток + итТоварыВЯчейкахОстатки.КРазмещениюОстаток +
	|		ЕСТЬNULL(ДвиженияДокумента.КоличествоДвиженияДокумента, 0) / ВЫБОР
	|		КОГДА ЕСТЬNULL(итТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмеренияМест.итКоличествоНаПаллете, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(итТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмеренияМест.итКоличествоНаПаллете, 0)
	|	КОНЕЦ КАК ПаллетВЯчейке
	|ПОМЕСТИТЬ ПаллетыВЯчейках
	|ИЗ
	|	РегистрНакопления.итТоварыВЯчейках.Остатки КАК итТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияДокумента КАК ДвиженияДокумента
	|		ПО итТоварыВЯчейкахОстатки.Организация = ДвиженияДокумента.Организация
	|		И итТоварыВЯчейкахОстатки.Склад = ДвиженияДокумента.Склад
	|		И итТоварыВЯчейкахОстатки.ИдентификаторУпаковки = ДвиженияДокумента.ИдентификаторУпаковки
	|		И итТоварыВЯчейкахОстатки.Ячейка = ДвиженияДокумента.Ячейка
	|		И итТоварыВЯчейкахОстатки.Номенклатура = ДвиженияДокумента.Номенклатура
	|		И итТоварыВЯчейкахОстатки.Характеристика = ДвиженияДокумента.Характеристика
	|		И итТоварыВЯчейкахОстатки.СерияНоменклатуры = ДвиженияДокумента.СерияНоменклатуры
	|		И итТоварыВЯчейкахОстатки.ДатаРозлива = ДвиженияДокумента.ДатаРозлива
	|		И итТоварыВЯчейкахОстатки.Качество = ДвиженияДокумента.Качество
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итСкладскиеЯчейки.Ссылка КАК Ячейка,
	|	ЕСТЬNULL(итСкладскиеЯчейки.КоличествоПалет, 0) - ЕСТЬNULL(ПаллетыВЯчейках.ПаллетВЯчейке, 0) КАК КоличествоПаллет,
	|	итСкладскиеЯчейки.СкладскоеПомещение,
	|	итСкладскиеЯчейки.Секция,
	|	итСкладскиеЯчейки.Стеллаж,
	|	итСкладскиеЯчейки.Линия,
	|	итСкладскиеЯчейки.Типоразмер,
	|	итСкладскиеЯчейки.ПорядокОбхода,
	|	итСкладскиеЯчейки.НомерРяда_Пролета,
	|	итСкладскиеЯчейки.Ярус,
	|	итСкладскиеЯчейки.Зона
	|ПОМЕСТИТЬ СвободныеЯчейки
	|ИЗ
	|	Справочник.итСкладскиеЯчейки КАК итСкладскиеЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПаллетыВЯчейках КАК ПаллетыВЯчейках
	|		ПО (ПаллетыВЯчейках.Ячейка = итСкладскиеЯчейки.Ссылка)
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ВидСкладскойДеятельности = ЗНАЧЕНИЕ(Перечисление.ит_wms_ВидыСкладскойДеятельности.Оптовая)
	|			ТОГДА ЕСТЬNULL(итСкладскиеЯчейки.КоличествоПалет, 0) - ЕСТЬNULL(ПаллетыВЯчейках.ПаллетВЯчейке, 0) >= 1
	|		ИНАЧЕ ЕСТЬNULL(итСкладскиеЯчейки.КоличествоПалет, 0) - ЕСТЬNULL(ПаллетыВЯчейках.ПаллетВЯчейке, 0) > 0
	|	КОНЕЦ
	|	И итСкладскиеЯчейки.ЭтоГруппа = ЛОЖЬ
	|	И итСкладскиеЯчейки.Заблокирована = ЛОЖЬ
	|	И ВЫБОР
	|		КОГДА &РазмещениеПоЗонам
	|			ТОГДА итСкладскиеЯчейки.Зона В (&МассивЗонКРазмещению)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И НЕ итСкладскиеЯчейки.ПометкаУдаления";
	
	Если СтруктураДанных.Свойство("МассивЗонКРазмещению") Тогда 
		РазмещениеПоЗонам=Истина;
		МассивЗонКРазмещению=СтруктураДанных.МассивЗонКРазмещению;
	иначе
		РазмещениеПоЗонам=Ложь;
		МассивЗонКРазмещению=новый Массив;
	КонецЕсли;
	Запрос.УстановитьПараметр("РазмещениеПоЗонам",РазмещениеПоЗонам);
	Запрос.УстановитьПараметр("МассивЗонКРазмещению",МассивЗонКРазмещению);
	Запрос.УстановитьПараметр("ВидСкладскойДеятельности",ВидСкладскойДеятельности);
	Запрос.УстановитьПараметр("Регистратор",Ссылка);
	
	//@skip-warning
	РезультатЗапроса = Запрос.Выполнить();	
КонецПроцедуры

Функция ЗапроситьИнформациюПоЯчейкамСогласноУчасткамОПТ(МенеджерВременныхТаблиц,СтруктураДанных)
	АссортиментныйУчасток=Справочники.ит_WMS_АссортиментныеУчасткиСклада.ПустаяСсылка();
	Если СтруктураДанных.Свойство("АссортиментныйУчасток") Тогда 
		АссортиментныйУчасток=СтруктураДанных.АссортиментныйУчасток;
	Иначе                                      
		АссортиментныйУчасток=СтруктураДанных.ТекущийАссортиментныйУчастокСклада;
	КонецЕсли;
	ТекущийКоэффициентПаллеты=0;
	Если СтруктураДанных.Свойство("ТекущийКоэффициентПаллеты") Тогда 
		ТекущийКоэффициентПаллеты=СтруктураДанных.ТекущийКоэффициентПаллеты;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек.Ячейка
		|ПОМЕСТИТЬ ЯчейкиАссортиметногоУчастка
		|ИЗ
		|	Справочник.ит_WMS_АссортиментныеУчасткиСклада.СоставЯчеек КАК ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек
		|ГДЕ
		|	ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек.Ссылка = &АссортиментныйУчасток
		|	И ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек.Ячейка.ВидСкладскойДеятельности = ЗНАЧЕНИЕ(Перечисление.ит_WMS_ВидыСкладскойДеятельности.Оптовая)
		|
		|СГРУППИРОВАТЬ ПО
		|	ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
		|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
		|	ТаблицаАнализаСвободныхЯчеек.Линия КАК Линия,
		|	ТаблицаАнализаСвободныхЯчеек.Секция,
		|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
		|	ТаблицаАнализаСвободныхЯчеек.Ярус,
		|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
		|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
		|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
		|	ТаблицаАнализаСвободныхЯчеек.Зона,
		|	ВЫБОР
		|		КОГДА &РазмещатьПоБлижайшейЗонеПриемки
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода >= 0
		|						ТОГДА ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода
		|					ИНАЧЕ -(ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода)
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПорядокОбходаПоЗонеПриемки,
		|	ВЫБОР
		|		КОГДА &РазмещатьСПриоритетомХранения
		|			ТОГДА ВЫБОР
		|					КОГДА ТаблицаАнализаСвободныхЯчеек.Зона = ЗНАЧЕНИЕ(Перечисление.итWMSЗоныСклада.Хранения)
		|						ТОГДА 0
		|					ИНАЧЕ 1
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТаблицаАнализаСвободныхЯчеек.Зона = ЗНАЧЕНИЕ(Перечисление.итWMSЗоныСклада.Пикинга)
		|					ТОГДА 0
		|				ИНАЧЕ 1
		|			КОНЕЦ
		|	КОНЕЦ КАК ПриоритетЗоныХранения,
		|	ВЫБОР
		|		КОГДА &ТекущийКоэффициентПаллеты > 0
		|				И &ТекущийКоэффициентПаллеты < 1
		|				И ЯчейкиАссортиметногоУчастка.Ячейка.КоличествоПалет < 1
		|			ТОГДА ВЫБОР
		|					КОГДА ЯчейкиАссортиметногоУчастка.Ячейка.КоличествоПалет - &ТекущийКоэффициентПаллеты < 0
		|						ТОГДА 1
		|					ИНАЧЕ -(&ТекущийКоэффициентПаллеты - ЯчейкиАссортиметногоУчастка.Ячейка.КоличествоПалет)
		|				КОНЕЦ
		|		КОГДА &ТекущийКоэффициентПаллеты > 0
		|				И &ТекущийКоэффициентПаллеты >= 1
		|				И ЯчейкиАссортиметногоУчастка.Ячейка.КоличествоПалет >= 1
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Порядок
		|ПОМЕСТИТЬ ТаблицаОтбораСвободныхЯчеек
		|ИЗ
		|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЯчейкиАссортиметногоУчастка КАК ЯчейкиАссортиметногоУчастка
		|		ПО ТаблицаАнализаСвободныхЯчеек.Ячейка = ЯчейкиАссортиметногоУчастка.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СвободныеЯчейки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
		|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
		|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
		|	ТаблицаАнализаСвободныхЯчеек.Линия,
		|	ТаблицаАнализаСвободныхЯчеек.Секция,
		|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
		|	ТаблицаАнализаСвободныхЯчеек.Ярус,
		|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
		|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
		|	ТаблицаАнализаСвободныхЯчеек.Зона
		|ПОМЕСТИТЬ СвободныеЯчейки
		|ИЗ
		|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаАнализаСвободныхЯчеек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаОтбораСвободныхЯчеек.Ячейка КАК Ячейка,
		|	ТаблицаОтбораСвободныхЯчеек.СкладскоеПомещение,
		|	ТаблицаОтбораСвободныхЯчеек.Линия КАК Линия,
		|	ТаблицаОтбораСвободныхЯчеек.Секция,
		|	ТаблицаОтбораСвободныхЯчеек.Стеллаж,
		|	ТаблицаОтбораСвободныхЯчеек.Ярус,
		|	ТаблицаОтбораСвободныхЯчеек.ПорядокОбхода,
		|	ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет,
		|	ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета,
		|	ТаблицаОтбораСвободныхЯчеек.ПорядокОбходаПоЗонеПриемки КАК ПорядокОбходаПоЗонеПриемки,
		|	ТаблицаОтбораСвободныхЯчеек.Порядок КАК Порядок,
		|	ТаблицаОтбораСвободныхЯчеек.ПриоритетЗоныХранения КАК ПриоритетЗоныХранения
		|ИЗ
		|	ТаблицаОтбораСвободныхЯчеек КАК ТаблицаОтбораСвободныхЯчеек
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ТекущийКоэффициентПаллеты > 0
		|				ТОГДА ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет >= &ТекущийКоэффициентПаллеты
		|			ИНАЧЕ ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет >= 1
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетЗоныХранения,
		|	Порядок,
		|	ПорядокОбходаПоЗонеПриемки,
		|	Ячейка,
		|	Линия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОтбораСвободныхЯчеек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЯчейкиАссортиметногоУчастка";
	
	Запрос.УстановитьПараметр("АссортиментныйУчасток", АссортиментныйУчасток);
	Запрос.УстановитьПараметр("РазмещатьСПриоритетомХранения",СтруктураДанных.РазмещатьСПриоритетомХранения);
	Запрос.УстановитьПараметр("РазмещатьПоБлижайшейЗонеПриемки",СтруктураДанных.РазмещатьПоБлижайшейЗонеПриемки);
	Запрос.УстановитьПараметр("НачалоОтсчетаПорядкаОбхода",СтруктураДанных.НачалоОтсчетаПорядкаОбхода);
    Запрос.УстановитьПараметр("ТекущийКоэффициентПаллеты",ТекущийКоэффициентПаллеты);

	
	Возврат Запрос.Выполнить();	
	КонецФункции
	
#КонецОбласти

#Область ЯчеечноеРазмещениеТовараРозница
Процедура ПоискЯчеекРазмещенияРозница( ЗонаКарантина,  МассивРезультатов,  СтруктураДанных)
	МенеджерВременныхТаблиц=новый МенеджерВременныхТаблиц;
	ЗапросСвободныхЯчеекСогласноПаллетМестРозница(МенеджерВременныхТаблиц);
	РазместитьНеОднородныеПаллетыРозница(МассивРезультатов[8],МенеджерВременныхТаблиц,СтруктураДанных);
	РазместитьОднородныеПаллетыРозница(МассивРезультатов[7],МенеджерВременныхТаблиц,СтруктураДанных);
	/////размещение карантинных паллет по алгоритмы не однородных, в зону карантина
	МенеджерВременныхТаблиц=новый МенеджерВременныхТаблиц;
	ЗаполнитьДанныеСвободнымиЯчейкамиКарантина(ЗонаКарантина,МенеджерВременныхТаблиц);
	РазместитьКарантинПаллеты(МассивРезультатов[9],МенеджерВременныхТаблиц,СтруктураДанных);

	КонецПроцедуры
	
Процедура РазместитьНеОднородныеПаллетыРозница(РезультатЗапроса,МенеджерВременныхТаблиц,СтруктураДанных)
	Если РезультатЗапроса.Пустой() тогда
		Возврат
	КонецЕсли;	
	ВыборкаНеоднороднойПаллеты=РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаПаллетМест=новый ТаблицаЗначений;
	ТаблицаПаллетМест.Колонки.Добавить("Ячейка",новый ОписаниеТипов("СправочникСсылка.итСкладскиеЯчейки"));
	ТаблицаПаллетМест.Колонки.Добавить("КоличествоЗанятыхПаллетМест",новый ОписаниеТипов("Число"));
	СтруктураДанных.Вставить("ТекущийАссортиментныйУчастокСклада",Неопределено);
	Пока  ВыборкаНеоднороднойПаллеты.Следующий() Цикл 
		СтруктураТекущеВыборки=новый Структура;
		СтруктураТекущеВыборки.Вставить("ВыборкаНеоднороднойПаллеты",ВыборкаНеоднороднойПаллеты);
		СтруктураТекущеВыборки.Вставить("ТаблицаПаллетМест",ТаблицаПаллетМест);
		СтруктураТекущеВыборки.Вставить("МенеджерВременныхТаблиц",МенеджерВременныхТаблиц);
		СтруктураТекущеВыборки.Вставить("КоличествоПаллетвЯчейке",0);
        СтруктураТекущеВыборки.Вставить("Ячейка",Справочники.итСкладскиеЯчейки.ПустаяСсылка());
        СтруктураТекущеВыборки.Вставить("ТекущийКоэффициентПаллеты",0);
		СтруктураТекущеВыборки.Вставить("СтруктураДанных",СтруктураДанных);
		ВыборкаПоПаллетноНеОднородныеПаллетыРозница(СтруктураТекущеВыборки);
	КонецЦикла;
	ОбработатьТаблицуПаллетМестРозница(ТаблицаПаллетМест,МенеджерВременныхТаблиц)
	
КонецПроцедуры

Процедура ВыборкаПоПаллетноНеОднородныеПаллетыРозница(СтруктураТекущеВыборки)
	СтруктураТекущеВыборки.Вставить("ТекущийКоэффициентПаллеты",СтруктураТекущеВыборки.ВыборкаНеоднороднойПаллеты.КоэффициентПаллеты);
	СтруктураДанных=СтруктураТекущеВыборки.СтруктураДанных;
	Если СтруктураТекущеВыборки.КоличествоПаллетвЯчейке > 0 Тогда 
		Если СтруктураДанных.ТекущийАссортиментныйУчастокСклада <> СтруктураТекущеВыборки.ВыборкаНеоднороднойПаллеты.АссортиментныйУчастокСклада Тогда 
			СтруктураТекущеВыборки.КоличествоПаллетвЯчейке=0;
		КонецЕсли;
	КонецЕсли;		
	СтруктураДанных.Вставить("ТекущийАссортиментныйУчастокСклада",СтруктураТекущеВыборки.ВыборкаНеоднороднойПаллеты.АссортиментныйУчастокСклада);
	СтрокиТабличнойЧасти=Товары.НайтиСтроки(новый Структура("ИдентификаторУпаковки",СтруктураТекущеВыборки.ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки));
	ТаблицаПаллетМест=СтруктураТекущеВыборки.ТаблицаПаллетМест;
		Если СтруктураТекущеВыборки.ВыборкаНеоднороднойПаллеты.КоличествоРазличныхЯчеекОтправителей>1 и СтруктураДанных.РазмещатьПоБлижайшейЗонеПриемки тогда
		Сообщить("паллета "+СтруктураТекущеВыборки.ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки+" размещена не будет т.к паллета размещена более чем на 1 ячейки приемки");
		Возврат;
	КонецЕсли;	
	
	Сообщить("Паллета "+СтруктураТекущеВыборки.ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки+" неоднородна, но ее приоритетное место расположение в 1 зоне , будет предложенно рекомендованное место ");
	Если СтруктураТекущеВыборки.ТекущийКоэффициентПаллеты > СтруктураТекущеВыборки.КоличествоПаллетвЯчейке Тогда
		СтруктураДанных.Вставить("ТекущийКоэффициентПаллеты",СтруктураТекущеВыборки.ТекущийКоэффициентПаллеты);
		СтруктураДанных.Вставить("НачалоОтсчетаПорядкаОбхода",СтруктураТекущеВыборки.ВыборкаНеоднороднойПаллеты.ЯчейкаОтправитель.ЯчейкаНачалаРазмещения.ПорядокОбхода);	
		РезультатСвободныхЯчеек=ЗапроситьИнформациюПоЯчейкамРозница(СтруктураТекущеВыборки.МенеджерВременныхТаблиц,ТаблицаПаллетМест,СтруктураДанных);
		ТаблицаПаллетМест.Очистить();
		ВыборкаСвободныхЯчеек=РезультатСвободныхЯчеек.Выбрать();
		Если не ВыборкаСвободныхЯчеек.Следующий() тогда
			Сообщить(" для паллеты "+ СтруктураТекущеВыборки.ВыборкаНеоднороднойПаллеты.ИдентификаторУпаковки +" не нашлось подходящей ячейки");
		КонецЕсли;
		СтруктураТекущеВыборки.Ячейка=ВыборкаСвободныхЯчеек.Ячейка;
		СтруктураТекущеВыборки.КоличествоПаллетвЯчейке=ВыборкаСвободныхЯчеек.ПаллетОстаток;
	КонецЕсли;
		для Каждого стр из СтрокиТабличнойЧасти цикл
			стр.ЯчейкаПолучатель=ВыборкаСвободныхЯчеек.Ячейка;
		КонецЦикла;
		СтруктураТекущеВыборки.КоличествоПаллетвЯчейке=СтруктураТекущеВыборки.КоличествоПаллетвЯчейке-СтруктураТекущеВыборки.ТекущийКоэффициентПаллеты;
		НоваяСтрока=ТаблицаПаллетМест.Добавить();
		НоваяСтрока.Ячейка=ВыборкаСвободныхЯчеек.Ячейка;
		НоваяСтрока.КоличествоЗанятыхПаллетМест=СтруктураТекущеВыборки.ТекущийКоэффициентПаллеты;
		//Если СтруктураТекущеВыборки.КоличествоПаллетвЯчейке>0 тогда
		//	Если  СтруктураТекущеВыборки.ВыборкаНеоднороднойПаллеты.Следующий() тогда
		//		ВыборкаПоПаллетноНеОднородныеПаллетыРозница(СтруктураТекущеВыборки);
		//	КонецЕсли;	
		//КонецЕсли;
	
КонецПроцедуры

Процедура РазместитьОднородныеПаллетыРозница(РезультатЗапроса,МенеджерВременныхТаблиц,СтруктураДанных)
	Если РезультатЗапроса.Пустой() тогда
		Возврат
	КонецЕсли;	
	ВыборкаНоменклатуры=РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаПаллетМест=новый ТаблицаЗначений;
	ТаблицаПаллетМест.Колонки.Добавить("Ячейка",новый ОписаниеТипов("СправочникСсылка.итСкладскиеЯчейки"));
	ТаблицаПаллетМест.Колонки.Добавить("КоличествоЗанятыхПаллетМест",новый ОписаниеТипов("Число"));
	
	
	Пока  ВыборкаНоменклатуры.Следующий() Цикл 
		
		СтруктураДанных.Вставить("ТекущийАссортиментныйУчастокСклада",ВыборкаНоменклатуры.АссортиментныйУчастокСклада);
		ВыборкаПоПаллетно=ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПаллетно.Следующий() цикл
			СтруктураТекущеВыборки=новый Структура;
			СтруктураТекущеВыборки.Вставить("ВыборкаПоПаллетно",ВыборкаПоПаллетно);
			СтруктураТекущеВыборки.Вставить("ТаблицаПаллетМест",ТаблицаПаллетМест);
			СтруктураТекущеВыборки.Вставить("МенеджерВременныхТаблиц",МенеджерВременныхТаблиц);
			СтруктураТекущеВыборки.Вставить("КоличествоПаллетвЯчейке",0);
            СтруктураТекущеВыборки.Вставить("Ячейка",Справочники.итСкладскиеЯчейки.ПустаяСсылка());
            СтруктураТекущеВыборки.Вставить("ТекущийКоэффициентПаллеты",0);
			СтруктураТекущеВыборки.Вставить("СтруктураДанных",СтруктураДанных);
			//СтруктураДанных.Вставить("ВыборкаПоПаллетно",ВыборкаПоПаллетно);
			ВыборкаПоПаллетноОднородныеПаллетыРозница(СтруктураТекущеВыборки);
		КонецЦикла;
		//Пока  ВыборкаДетальнойЗаписиТоваров.Следующий() Цикл 
		//КонецЦикла;
	КонецЦикла;
	ОбработатьТаблицуПаллетМестРозница(ТаблицаПаллетМест,МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ВыборкаПоПаллетноОднородныеПаллетыРозница(СтруктураТекущеВыборки)
	СтруктураДанных=СтруктураТекущеВыборки.СтруктураДанных;
	ТаблицаПаллетМест=СтруктураТекущеВыборки.ТаблицаПаллетМест;
	СтруктураТекущеВыборки.Вставить("ТекущийКоэффициентПаллеты",СтруктураТекущеВыборки.ВыборкаПоПаллетно.КоэффициентПаллеты);
	Если СтруктураТекущеВыборки.ВыборкаПоПаллетно.КоличествоРазличныхЯчеекОтправителей>1  тогда
		Сообщить("паллета "+СтруктураТекущеВыборки.ВыборкаПоПаллетно.ИдентификаторУпаковки+" размещена не будет т.к паллета размещена более чем на 1 ячейке");
		Возврат;
	КонецЕсли;	
	СтрокиТабличнойЧасти=Товары.НайтиСтроки(новый Структура("ИдентификаторУпаковки,Номенклатура",СтруктураТекущеВыборки.ВыборкаПоПаллетно.ИдентификаторУпаковки,СтруктураТекущеВыборки.ВыборкаПоПаллетно.Номенклатура));
	СтруктураДанных.Вставить("НачалоОтсчетаПорядкаОбхода",СтруктураТекущеВыборки.ВыборкаПоПаллетно.ЯчейкаОтправитель.ЯчейкаНачалаРазмещения.ПорядокОбхода);
	Если СтруктураТекущеВыборки.ТекущийКоэффициентПаллеты>СтруктураТекущеВыборки.КоличествоПаллетвЯчейке Тогда 
		СтруктураДанных.Вставить("ТекущийКоэффициентПаллеты",СтруктураТекущеВыборки.ТекущийКоэффициентПаллеты);
		РезультатСвободныхЯчеек=ЗапроситьИнформациюПоЯчейкамРозница(СтруктураТекущеВыборки.МенеджерВременныхТаблиц,ТаблицаПаллетМест,СтруктураДанных);
		ТаблицаПаллетМест.Очистить();
		ВыборкаСвободныхЯчеек=РезультатСвободныхЯчеек.Выбрать();			
		Если не ВыборкаСвободныхЯчеек.Следующий() тогда
			Сообщить(" для паллеты "+ СтруктураТекущеВыборки.ВыборкаПоПаллетно.ИдентификаторУпаковки +" и  номеклатуры "+СтруктураТекущеВыборки.ВыборкаПоПаллетно.Номенклатура+" не нашлось подходящей ячейки");
			Возврат;
		КонецЕсли;	
		СтруктураТекущеВыборки.КоличествоПаллетвЯчейке=ВыборкаСвободныхЯчеек.ПаллетОстаток;
		СтруктураТекущеВыборки.Ячейка=ВыборкаСвободныхЯчеек.Ячейка;
	КонецЕсли;
	для Каждого стр из СтрокиТабличнойЧасти цикл
		стр.ЯчейкаПолучатель=СтруктураТекущеВыборки.Ячейка;
	КонецЦикла;
	СтруктураТекущеВыборки.КоличествоПаллетвЯчейке=СтруктураТекущеВыборки.КоличествоПаллетвЯчейке-СтруктураТекущеВыборки.ТекущийКоэффициентПаллеты;
	НоваяСтрока=ТаблицаПаллетМест.Добавить();
	НоваяСтрока.Ячейка=СтруктураТекущеВыборки.Ячейка;
	НоваяСтрока.КоличествоЗанятыхПаллетМест=СтруктураТекущеВыборки.ТекущийКоэффициентПаллеты;
	//ОбработатьТаблицуПаллетМестРозница(ТаблицаПаллетМест,СтруктураТекущеВыборки.МенеджерВременныхТаблиц);
	//Если СтруктураТекущеВыборки.КоличествоПаллетвЯчейке>0 тогда
	//	Если   СтруктураТекущеВыборки.ВыборкаПоПаллетно.Следующий() тогда
	//		ВыборкаПоПаллетноОднородныеПаллетыРозница(СтруктураТекущеВыборки)
	//	КонецЕсли;	
	//КонецЕсли;				
		КонецПроцедуры
		
Процедура ОбработатьТаблицуПаллетМестРозница(ТаблицаПаллетМест,МенеджерВременныхТаблиц)
	Если ТаблицаПаллетМест.Количество()>0 тогда
		ИзъятьЗарезервированныеТоварыРозница(ТаблицаПаллетМест,МенеджерВременныхТаблиц);
	КонецЕсли;
КонецПроцедуры
	
Процедура ИзъятьЗарезервированныеТоварыРозница(ТаблицаПаллетМест,МенеджерВременныхТаблиц)
	 Если ТаблицаПаллетМест=Неопределено Тогда
		ТаблицаПаллетМест=новый ТаблицаЗначений;
		ТаблицаПаллетМест.Колонки.Добавить("Ячейка",новый ОписаниеТипов("СправочникСсылка.итСкладскиеЯчейки"));
		ТаблицаПаллетМест.Колонки.Добавить("КоличествоЗанятыхПаллетМест",новый ОписаниеТипов("Число"));
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПаллетМест.Ячейка,
		|	ТаблицаПаллетМест.КоличествоЗанятыхПаллетМест
		|ПОМЕСТИТЬ ТаблицаПаллетМест
		|ИЗ
		|	&ТаблицаПаллетМест КАК ТаблицаПаллетМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПаллетМест.Ячейка,
		|	СУММА(ТаблицаПаллетМест.КоличествоЗанятыхПаллетМест) КАК КоличествоЗанятыхПаллетМест
		|ПОМЕСТИТЬ ТаблицаПаллетМестГруппировка
		|ИЗ
		|	ТаблицаПаллетМест КАК ТаблицаПаллетМест
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПаллетМест.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвободныеЯчейки.Ячейка,
		|	СвободныеЯчейки.СкладскоеПомещение,
		|	ВЫБОР
		|		КОГДА СвободныеЯчейки.Линия = ""0""
		|			ТОГДА 0
		|		КОГДА СвободныеЯчейки.Линия = ""00""
		|			ТОГДА 0
		|		КОГДА СвободныеЯчейки.Линия = ""1""
		|			ТОГДА 1
		|		КОГДА СвободныеЯчейки.Линия = ""01""
		|			ТОГДА 1
		|		КОГДА СвободныеЯчейки.Линия = ""2""
		|			ТОГДА 2
		|		КОГДА СвободныеЯчейки.Линия = ""02""
		|			ТОГДА 2
		|		КОГДА СвободныеЯчейки.Линия = ""3""
		|			ТОГДА 3
		|		КОГДА СвободныеЯчейки.Линия = ""03""
		|			ТОГДА 3
		|		КОГДА СвободныеЯчейки.Линия = ""4""
		|			ТОГДА 4
		|		КОГДА СвободныеЯчейки.Линия = ""04""
		|			ТОГДА 4
		|		КОГДА СвободныеЯчейки.Линия = ""5""
		|			ТОГДА 5
		|		КОГДА СвободныеЯчейки.Линия = ""05""
		|			ТОГДА 5
		|		КОГДА СвободныеЯчейки.Линия = ""6""
		|			ТОГДА 6
		|		КОГДА СвободныеЯчейки.Линия = ""06""
		|			ТОГДА 6
		|		КОГДА СвободныеЯчейки.Линия = ""7""
		|			ТОГДА 7
		|		КОГДА СвободныеЯчейки.Линия = ""07""
		|			ТОГДА 7
		|		КОГДА СвободныеЯчейки.Линия = ""8""
		|			ТОГДА 8
		|		КОГДА СвободныеЯчейки.Линия = ""08""
		|			ТОГДА 8
		|		КОГДА СвободныеЯчейки.Линия = ""9""
		|			ТОГДА 9
		|		КОГДА СвободныеЯчейки.Линия = ""09""
		|			ТОГДА 9
		|		КОГДА СвободныеЯчейки.Линия = ""10""
		|			ТОГДА 10
		|		КОГДА СвободныеЯчейки.Линия = ""010""
		|			ТОГДА 10
		|		КОГДА СвободныеЯчейки.Линия = ""11""
		|			ТОГДА 11
		|		КОГДА СвободныеЯчейки.Линия = ""011""
		|			ТОГДА 11
		|		КОГДА СвободныеЯчейки.Линия = ""12""
		|			ТОГДА 12
		|		КОГДА СвободныеЯчейки.Линия = ""012""
		|			ТОГДА 12
		|		КОГДА СвободныеЯчейки.Линия = ""13""
		|			ТОГДА 13
		|		КОГДА СвободныеЯчейки.Линия = ""013""
		|			ТОГДА 13
		|		КОГДА СвободныеЯчейки.Линия = ""14""
		|			ТОГДА 14
		|		КОГДА СвободныеЯчейки.Линия = ""014""
		|			ТОГДА 14
		|		КОГДА СвободныеЯчейки.Линия = ""15""
		|			ТОГДА 15
		|		КОГДА СвободныеЯчейки.Линия = ""015""
		|			ТОГДА 15
		|		КОГДА СвободныеЯчейки.Линия = ""16""
		|			ТОГДА 16
		|		КОГДА СвободныеЯчейки.Линия = ""016""
		|			ТОГДА 16
		|		КОГДА СвободныеЯчейки.Линия = ""17""
		|			ТОГДА 17
		|		КОГДА СвободныеЯчейки.Линия = ""017""
		|			ТОГДА 17
		|		КОГДА СвободныеЯчейки.Линия = ""18""
		|			ТОГДА 18
		|		КОГДА СвободныеЯчейки.Линия = ""018""
		|			ТОГДА 18
		|		КОГДА СвободныеЯчейки.Линия = ""19""
		|			ТОГДА 19
		|		КОГДА СвободныеЯчейки.Линия = ""019""
		|			ТОГДА 19
		|		КОГДА СвободныеЯчейки.Линия = ""20""
		|			ТОГДА 20
		|		КОГДА СвободныеЯчейки.Линия = ""020""
		|			ТОГДА 20
		|		КОГДА СвободныеЯчейки.Линия = ""21""
		|			ТОГДА 21
		|		КОГДА СвободныеЯчейки.Линия = ""021""
		|			ТОГДА 21
		|		КОГДА СвободныеЯчейки.Линия = ""22""
		|			ТОГДА 22
		|		КОГДА СвободныеЯчейки.Линия = ""022""
		|			ТОГДА 22
		|		КОГДА СвободныеЯчейки.Линия = ""23""
		|			ТОГДА 23
		|		КОГДА СвободныеЯчейки.Линия = ""023""
		|			ТОГДА 23
		|		КОГДА СвободныеЯчейки.Линия = ""24""
		|			ТОГДА 24
		|		КОГДА СвободныеЯчейки.Линия = ""024""
		|			ТОГДА 24
		|		КОГДА СвободныеЯчейки.Линия = ""25""
		|			ТОГДА 25
		|		КОГДА СвободныеЯчейки.Линия = ""025""
		|			ТОГДА 25
		|		КОГДА СвободныеЯчейки.Линия = ""26""
		|			ТОГДА 26
		|		КОГДА СвободныеЯчейки.Линия = ""026""
		|			ТОГДА 26
		|		КОГДА СвободныеЯчейки.Линия = ""27""
		|			ТОГДА 27
		|		КОГДА СвободныеЯчейки.Линия = ""027""
		|			ТОГДА 27
		|		КОГДА СвободныеЯчейки.Линия = ""28""
		|			ТОГДА 28
		|		КОГДА СвободныеЯчейки.Линия = ""028""
		|			ТОГДА 28
		|		КОГДА СвободныеЯчейки.Линия = ""29""
		|			ТОГДА 29
		|		КОГДА СвободныеЯчейки.Линия = ""029""
		|			ТОГДА 29
		|		КОГДА СвободныеЯчейки.Линия = ""30""
		|			ТОГДА 30
		|		КОГДА СвободныеЯчейки.Линия = ""030""
		|			ТОГДА 30
		|		КОГДА СвободныеЯчейки.Линия = ""31""
		|			ТОГДА 31
		|		КОГДА СвободныеЯчейки.Линия = ""031""
		|			ТОГДА 31
		|		КОГДА СвободныеЯчейки.Линия = ""32""
		|			ТОГДА 32
		|		КОГДА СвободныеЯчейки.Линия = ""032""
		|			ТОГДА 32
		|		КОГДА СвободныеЯчейки.Линия = ""33""
		|			ТОГДА 33
		|		КОГДА СвободныеЯчейки.Линия = ""033""
		|			ТОГДА 33
		|		КОГДА СвободныеЯчейки.Линия = ""34""
		|			ТОГДА 34
		|		КОГДА СвободныеЯчейки.Линия = ""034""
		|			ТОГДА 34
		|		КОГДА СвободныеЯчейки.Линия = ""35""
		|			ТОГДА 35
		|		КОГДА СвободныеЯчейки.Линия = ""035""
		|			ТОГДА 35
		|		КОГДА СвободныеЯчейки.Линия = ""36""
		|			ТОГДА 36
		|		КОГДА СвободныеЯчейки.Линия = ""036""
		|			ТОГДА 36
		|		КОГДА СвободныеЯчейки.Линия = ""37""
		|			ТОГДА 37
		|		КОГДА СвободныеЯчейки.Линия = ""037""
		|			ТОГДА 37
		|		КОГДА СвободныеЯчейки.Линия = ""38""
		|			ТОГДА 38
		|		КОГДА СвободныеЯчейки.Линия = ""038""
		|			ТОГДА 38
		|		КОГДА СвободныеЯчейки.Линия = ""39""
		|			ТОГДА 39
		|		КОГДА СвободныеЯчейки.Линия = ""039""
		|			ТОГДА 39
		|		КОГДА СвободныеЯчейки.Линия = ""40""
		|			ТОГДА 40
		|		КОГДА СвободныеЯчейки.Линия = ""040""
		|			ТОГДА 40
		|		КОГДА СвободныеЯчейки.Линия = ""41""
		|			ТОГДА 41
		|		КОГДА СвободныеЯчейки.Линия = ""041""
		|			ТОГДА 41
		|		КОГДА СвободныеЯчейки.Линия = ""42""
		|			ТОГДА 42
		|		КОГДА СвободныеЯчейки.Линия = ""042""
		|			ТОГДА 42
		|		КОГДА СвободныеЯчейки.Линия = ""43""
		|			ТОГДА 43
		|		КОГДА СвободныеЯчейки.Линия = ""043""
		|			ТОГДА 43
		|		КОГДА СвободныеЯчейки.Линия = ""44""
		|			ТОГДА 44
		|		КОГДА СвободныеЯчейки.Линия = ""044""
		|			ТОГДА 44
		|		КОГДА СвободныеЯчейки.Линия = ""45""
		|			ТОГДА 45
		|		КОГДА СвободныеЯчейки.Линия = ""045""
		|			ТОГДА 45
		|		КОГДА СвободныеЯчейки.Линия = ""46""
		|			ТОГДА 46
		|		КОГДА СвободныеЯчейки.Линия = ""046""
		|			ТОГДА 46
		|		КОГДА СвободныеЯчейки.Линия = ""47""
		|			ТОГДА 47
		|		КОГДА СвободныеЯчейки.Линия = ""047""
		|			ТОГДА 47
		|		КОГДА СвободныеЯчейки.Линия = ""48""
		|			ТОГДА 48
		|		КОГДА СвободныеЯчейки.Линия = ""048""
		|			ТОГДА 48
		|		КОГДА СвободныеЯчейки.Линия = ""49""
		|			ТОГДА 49
		|		КОГДА СвободныеЯчейки.Линия = ""049""
		|			ТОГДА 49
		|		КОГДА СвободныеЯчейки.Линия = ""50""
		|			ТОГДА 50
		|		КОГДА СвободныеЯчейки.Линия = ""050""
		|			ТОГДА 50
		|		КОГДА СвободныеЯчейки.Линия = ""51""
		|			ТОГДА 51
		|		КОГДА СвободныеЯчейки.Линия = ""051""
		|			ТОГДА 51
		|		КОГДА СвободныеЯчейки.Линия = ""52""
		|			ТОГДА 52
		|		КОГДА СвободныеЯчейки.Линия = ""052""
		|			ТОГДА 52
		|		КОГДА СвободныеЯчейки.Линия = ""53""
		|			ТОГДА 53
		|		КОГДА СвободныеЯчейки.Линия = ""053""
		|			ТОГДА 53
		|		КОГДА СвободныеЯчейки.Линия = ""54""
		|			ТОГДА 54
		|		КОГДА СвободныеЯчейки.Линия = ""054""
		|			ТОГДА 54
		|		КОГДА СвободныеЯчейки.Линия = ""55""
		|			ТОГДА 55
		|		КОГДА СвободныеЯчейки.Линия = ""055""
		|			ТОГДА 55
		|		КОГДА СвободныеЯчейки.Линия = ""56""
		|			ТОГДА 56
		|		КОГДА СвободныеЯчейки.Линия = ""056""
		|			ТОГДА 56
		|		КОГДА СвободныеЯчейки.Линия = ""57""
		|			ТОГДА 57
		|		КОГДА СвободныеЯчейки.Линия = ""057""
		|			ТОГДА 57
		|		КОГДА СвободныеЯчейки.Линия = ""58""
		|			ТОГДА 58
		|		КОГДА СвободныеЯчейки.Линия = ""058""
		|			ТОГДА 58
		|		КОГДА СвободныеЯчейки.Линия = ""59""
		|			ТОГДА 59
		|		КОГДА СвободныеЯчейки.Линия = ""059""
		|			ТОГДА 59
		|		КОГДА СвободныеЯчейки.Линия = ""60""
		|			ТОГДА 60
		|		КОГДА СвободныеЯчейки.Линия = ""060""
		|			ТОГДА 60
		|		КОГДА СвободныеЯчейки.Линия = ""61""
		|			ТОГДА 61
		|		КОГДА СвободныеЯчейки.Линия = ""061""
		|			ТОГДА 61
		|		КОГДА СвободныеЯчейки.Линия = ""62""
		|			ТОГДА 62
		|		КОГДА СвободныеЯчейки.Линия = ""062""
		|			ТОГДА 62
		|		КОГДА СвободныеЯчейки.Линия = ""63""
		|			ТОГДА 63
		|		КОГДА СвободныеЯчейки.Линия = ""063""
		|			ТОГДА 63
		|		КОГДА СвободныеЯчейки.Линия = ""64""
		|			ТОГДА 64
		|		КОГДА СвободныеЯчейки.Линия = ""064""
		|			ТОГДА 64
		|		КОГДА СвободныеЯчейки.Линия = ""65""
		|			ТОГДА 65
		|		КОГДА СвободныеЯчейки.Линия = ""065""
		|			ТОГДА 65
		|		КОГДА СвободныеЯчейки.Линия = ""66""
		|			ТОГДА 66
		|		КОГДА СвободныеЯчейки.Линия = ""066""
		|			ТОГДА 66
		|		КОГДА СвободныеЯчейки.Линия = ""67""
		|			ТОГДА 67
		|		КОГДА СвободныеЯчейки.Линия = ""067""
		|			ТОГДА 67
		|		КОГДА СвободныеЯчейки.Линия = ""68""
		|			ТОГДА 68
		|		КОГДА СвободныеЯчейки.Линия = ""068""
		|			ТОГДА 68
		|		КОГДА СвободныеЯчейки.Линия = ""69""
		|			ТОГДА 69
		|		КОГДА СвободныеЯчейки.Линия = ""069""
		|			ТОГДА 69
		|		КОГДА СвободныеЯчейки.Линия = ""70""
		|			ТОГДА 70
		|		КОГДА СвободныеЯчейки.Линия = ""070""
		|			ТОГДА 70
		|		КОГДА СвободныеЯчейки.Линия = ""71""
		|			ТОГДА 71
		|		КОГДА СвободныеЯчейки.Линия = ""071""
		|			ТОГДА 71
		|		КОГДА СвободныеЯчейки.Линия = ""72""
		|			ТОГДА 72
		|		КОГДА СвободныеЯчейки.Линия = ""072""
		|			ТОГДА 72
		|		КОГДА СвободныеЯчейки.Линия = ""73""
		|			ТОГДА 73
		|		КОГДА СвободныеЯчейки.Линия = ""073""
		|			ТОГДА 73
		|		КОГДА СвободныеЯчейки.Линия = ""74""
		|			ТОГДА 74
		|		КОГДА СвободныеЯчейки.Линия = ""074""
		|			ТОГДА 74
		|		КОГДА СвободныеЯчейки.Линия = ""75""
		|			ТОГДА 75
		|		КОГДА СвободныеЯчейки.Линия = ""075""
		|			ТОГДА 75
		|		КОГДА СвободныеЯчейки.Линия = ""76""
		|			ТОГДА 76
		|		КОГДА СвободныеЯчейки.Линия = ""076""
		|			ТОГДА 76
		|		КОГДА СвободныеЯчейки.Линия = ""77""
		|			ТОГДА 77
		|		КОГДА СвободныеЯчейки.Линия = ""077""
		|			ТОГДА 77
		|		КОГДА СвободныеЯчейки.Линия = ""78""
		|			ТОГДА 78
		|		КОГДА СвободныеЯчейки.Линия = ""078""
		|			ТОГДА 78
		|		КОГДА СвободныеЯчейки.Линия = ""79""
		|			ТОГДА 79
		|		КОГДА СвободныеЯчейки.Линия = ""079""
		|			ТОГДА 79
		|		КОГДА СвободныеЯчейки.Линия = ""80""
		|			ТОГДА 80
		|		КОГДА СвободныеЯчейки.Линия = ""080""
		|			ТОГДА 80
		|		КОГДА СвободныеЯчейки.Линия = ""81""
		|			ТОГДА 81
		|		КОГДА СвободныеЯчейки.Линия = ""081""
		|			ТОГДА 81
		|		КОГДА СвободныеЯчейки.Линия = ""82""
		|			ТОГДА 82
		|		КОГДА СвободныеЯчейки.Линия = ""082""
		|			ТОГДА 82
		|		КОГДА СвободныеЯчейки.Линия = ""83""
		|			ТОГДА 83
		|		КОГДА СвободныеЯчейки.Линия = ""083""
		|			ТОГДА 83
		|		КОГДА СвободныеЯчейки.Линия = ""84""
		|			ТОГДА 84
		|		КОГДА СвободныеЯчейки.Линия = ""084""
		|			ТОГДА 84
		|		КОГДА СвободныеЯчейки.Линия = ""85""
		|			ТОГДА 85
		|		КОГДА СвободныеЯчейки.Линия = ""085""
		|			ТОГДА 85
		|		КОГДА СвободныеЯчейки.Линия = ""86""
		|			ТОГДА 86
		|		КОГДА СвободныеЯчейки.Линия = ""086""
		|			ТОГДА 86
		|		КОГДА СвободныеЯчейки.Линия = ""87""
		|			ТОГДА 87
		|		КОГДА СвободныеЯчейки.Линия = ""087""
		|			ТОГДА 87
		|		КОГДА СвободныеЯчейки.Линия = ""88""
		|			ТОГДА 88
		|		КОГДА СвободныеЯчейки.Линия = ""088""
		|			ТОГДА 88
		|		КОГДА СвободныеЯчейки.Линия = ""89""
		|			ТОГДА 89
		|		КОГДА СвободныеЯчейки.Линия = ""089""
		|			ТОГДА 89
		|		КОГДА СвободныеЯчейки.Линия = ""90""
		|			ТОГДА 90
		|		КОГДА СвободныеЯчейки.Линия = ""090""
		|			ТОГДА 90
		|		КОГДА СвободныеЯчейки.Линия = ""91""
		|			ТОГДА 91
		|		КОГДА СвободныеЯчейки.Линия = ""091""
		|			ТОГДА 91
		|		КОГДА СвободныеЯчейки.Линия = ""92""
		|			ТОГДА 92
		|		КОГДА СвободныеЯчейки.Линия = ""092""
		|			ТОГДА 92
		|		КОГДА СвободныеЯчейки.Линия = ""93""
		|			ТОГДА 93
		|		КОГДА СвободныеЯчейки.Линия = ""093""
		|			ТОГДА 93
		|		КОГДА СвободныеЯчейки.Линия = ""94""
		|			ТОГДА 94
		|		КОГДА СвободныеЯчейки.Линия = ""094""
		|			ТОГДА 94
		|		КОГДА СвободныеЯчейки.Линия = ""95""
		|			ТОГДА 95
		|		КОГДА СвободныеЯчейки.Линия = ""095""
		|			ТОГДА 95
		|		КОГДА СвободныеЯчейки.Линия = ""96""
		|			ТОГДА 96
		|		КОГДА СвободныеЯчейки.Линия = ""096""
		|			ТОГДА 96
		|		КОГДА СвободныеЯчейки.Линия = ""97""
		|			ТОГДА 97
		|		КОГДА СвободныеЯчейки.Линия = ""097""
		|			ТОГДА 97
		|		КОГДА СвободныеЯчейки.Линия = ""98""
		|			ТОГДА 98
		|		КОГДА СвободныеЯчейки.Линия = ""098""
		|			ТОГДА 98
		|		КОГДА СвободныеЯчейки.Линия = ""99""
		|			ТОГДА 99
		|		КОГДА СвободныеЯчейки.Линия = ""099""
		|			ТОГДА 99
		|		КОГДА СвободныеЯчейки.Линия = ""100""
		|			ТОГДА 100
		|		КОГДА СвободныеЯчейки.Линия = ""0100""
		|			ТОГДА 100
		|		ИНАЧЕ СвободныеЯчейки.Линия
		|	КОНЕЦ КАК Линия,
		|	СвободныеЯчейки.Секция,
		|	СвободныеЯчейки.Стеллаж,
		|	СвободныеЯчейки.Ярус,
		|	СвободныеЯчейки.ПорядокОбхода,
		|	СвободныеЯчейки.КоличествоПаллет КАК КоличествоПаллет,
		|	СвободныеЯчейки.НомерРяда_Пролета,
		|	СвободныеЯчейки.Зона,
		|	СвободныеЯчейки.ПаллетОстаток - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) КАК ПаллетОстаток
		|ПОМЕСТИТЬ ТаблицаАнализаСвободныхЯчеек
		|ИЗ
		|	СвободныеЯчейки КАК СвободныеЯчейки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПаллетМестГруппировка КАК ТаблицаПаллетМестГруппировка
		|		ПО СвободныеЯчейки.Ячейка = ТаблицаПаллетМестГруппировка.Ячейка
		|ГДЕ
		|	СвободныеЯчейки.КоличествоПаллет - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаПаллетМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаПаллетМестГруппировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СвободныеЯчейки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
		|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
		|	ТаблицаАнализаСвободныхЯчеек.Линия,
		|	ТаблицаАнализаСвободныхЯчеек.Секция,
		|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
		|	ТаблицаАнализаСвободныхЯчеек.Ярус,
		|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
		|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
		|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
		|	ТаблицаАнализаСвободныхЯчеек.Зона,
		|	ТаблицаАнализаСвободныхЯчеек.ПаллетОстаток
		|ПОМЕСТИТЬ СвободныеЯчейки
		|ИЗ
		|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаАнализаСвободныхЯчеек";
	
	Запрос.УстановитьПараметр("ТаблицаПаллетМест", ТаблицаПаллетМест);
	
	//@skip-warning
	РезультатЗапроса = Запрос.Выполнить();	
	
	КонецПроцедуры

	
Функция ЗапроситьИнформациюПоЯчейкамРозница(МенеджерВременныхТаблиц,ТаблицаПаллетМест=Неопределено,СтруктураДанных)
	ЗапроситьИнформациюПоЯчейкамОбщийФрагментРозница(ТаблицаПаллетМест, МенеджерВременныхТаблиц);
	РезультатЗапроса=Неопределено;		
	Если СтруктураДанных.Стратегия = "РаместитьТоварПоУчасткамПриоритетХранения" Тогда
		 РезультатЗапроса=ЗапроситьИнформациюПоЯчейкамСогласноУчасткамРозница(МенеджерВременныхТаблиц,СтруктураДанных);
    КонецЕсли;
	
	Возврат РезультатЗапроса;
КонецФункции


Процедура ЗапроситьИнформациюПоЯчейкамОбщийФрагментРозница(ТаблицаПаллетМест=Неопределено,  МенеджерВременныхТаблиц)
	
	Если ТаблицаПаллетМест=Неопределено Тогда
		ТаблицаПаллетМест=новый ТаблицаЗначений;
		ТаблицаПаллетМест.Колонки.Добавить("Ячейка",новый ОписаниеТипов("СправочникСсылка.итСкладскиеЯчейки"));
		ТаблицаПаллетМест.Колонки.Добавить("КоличествоЗанятыхПаллетМест",новый ОписаниеТипов("Число"));
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПаллетМест.Ячейка,
	|	ТаблицаПаллетМест.КоличествоЗанятыхПаллетМест
	|ПОМЕСТИТЬ ТаблицаПаллетМест
	|ИЗ
	|	&ТаблицаПаллетМест КАК ТаблицаПаллетМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПаллетМест.Ячейка,
	|	СУММА(ТаблицаПаллетМест.КоличествоЗанятыхПаллетМест) КАК КоличествоЗанятыхПаллетМест
	|ПОМЕСТИТЬ ТаблицаПаллетМестГруппировка
	|ИЗ
	|	ТаблицаПаллетМест КАК ТаблицаПаллетМест
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПаллетМест.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеЯчейки.Ячейка,
	|	СвободныеЯчейки.СкладскоеПомещение,
	|	ВЫБОР
	|		КОГДА СвободныеЯчейки.Линия = ""0""
	|			ТОГДА 0
	|		КОГДА СвободныеЯчейки.Линия = ""00""
	|			ТОГДА 0
	|		КОГДА СвободныеЯчейки.Линия = ""1""
	|			ТОГДА 1
	|		КОГДА СвободныеЯчейки.Линия = ""01""
	|			ТОГДА 1
	|		КОГДА СвободныеЯчейки.Линия = ""2""
	|			ТОГДА 2
	|		КОГДА СвободныеЯчейки.Линия = ""02""
	|			ТОГДА 2
	|		КОГДА СвободныеЯчейки.Линия = ""3""
	|			ТОГДА 3
	|		КОГДА СвободныеЯчейки.Линия = ""03""
	|			ТОГДА 3
	|		КОГДА СвободныеЯчейки.Линия = ""4""
	|			ТОГДА 4
	|		КОГДА СвободныеЯчейки.Линия = ""04""
	|			ТОГДА 4
	|		КОГДА СвободныеЯчейки.Линия = ""5""
	|			ТОГДА 5
	|		КОГДА СвободныеЯчейки.Линия = ""05""
	|			ТОГДА 5
	|		КОГДА СвободныеЯчейки.Линия = ""6""
	|			ТОГДА 6
	|		КОГДА СвободныеЯчейки.Линия = ""06""
	|			ТОГДА 6
	|		КОГДА СвободныеЯчейки.Линия = ""7""
	|			ТОГДА 7
	|		КОГДА СвободныеЯчейки.Линия = ""07""
	|			ТОГДА 7
	|		КОГДА СвободныеЯчейки.Линия = ""8""
	|			ТОГДА 8
	|		КОГДА СвободныеЯчейки.Линия = ""08""
	|			ТОГДА 8
	|		КОГДА СвободныеЯчейки.Линия = ""9""
	|			ТОГДА 9
	|		КОГДА СвободныеЯчейки.Линия = ""09""
	|			ТОГДА 9
	|		КОГДА СвободныеЯчейки.Линия = ""10""
	|			ТОГДА 10
	|		КОГДА СвободныеЯчейки.Линия = ""010""
	|			ТОГДА 10
	|		КОГДА СвободныеЯчейки.Линия = ""11""
	|			ТОГДА 11
	|		КОГДА СвободныеЯчейки.Линия = ""011""
	|			ТОГДА 11
	|		КОГДА СвободныеЯчейки.Линия = ""12""
	|			ТОГДА 12
	|		КОГДА СвободныеЯчейки.Линия = ""012""
	|			ТОГДА 12
	|		КОГДА СвободныеЯчейки.Линия = ""13""
	|			ТОГДА 13
	|		КОГДА СвободныеЯчейки.Линия = ""013""
	|			ТОГДА 13
	|		КОГДА СвободныеЯчейки.Линия = ""14""
	|			ТОГДА 14
	|		КОГДА СвободныеЯчейки.Линия = ""014""
	|			ТОГДА 14
	|		КОГДА СвободныеЯчейки.Линия = ""15""
	|			ТОГДА 15
	|		КОГДА СвободныеЯчейки.Линия = ""015""
	|			ТОГДА 15
	|		КОГДА СвободныеЯчейки.Линия = ""16""
	|			ТОГДА 16
	|		КОГДА СвободныеЯчейки.Линия = ""016""
	|			ТОГДА 16
	|		КОГДА СвободныеЯчейки.Линия = ""17""
	|			ТОГДА 17
	|		КОГДА СвободныеЯчейки.Линия = ""017""
	|			ТОГДА 17
	|		КОГДА СвободныеЯчейки.Линия = ""18""
	|			ТОГДА 18
	|		КОГДА СвободныеЯчейки.Линия = ""018""
	|			ТОГДА 18
	|		КОГДА СвободныеЯчейки.Линия = ""19""
	|			ТОГДА 19
	|		КОГДА СвободныеЯчейки.Линия = ""019""
	|			ТОГДА 19
	|		КОГДА СвободныеЯчейки.Линия = ""20""
	|			ТОГДА 20
	|		КОГДА СвободныеЯчейки.Линия = ""020""
	|			ТОГДА 20
	|		КОГДА СвободныеЯчейки.Линия = ""21""
	|			ТОГДА 21
	|		КОГДА СвободныеЯчейки.Линия = ""021""
	|			ТОГДА 21
	|		КОГДА СвободныеЯчейки.Линия = ""22""
	|			ТОГДА 22
	|		КОГДА СвободныеЯчейки.Линия = ""022""
	|			ТОГДА 22
	|		КОГДА СвободныеЯчейки.Линия = ""23""
	|			ТОГДА 23
	|		КОГДА СвободныеЯчейки.Линия = ""023""
	|			ТОГДА 23
	|		КОГДА СвободныеЯчейки.Линия = ""24""
	|			ТОГДА 24
	|		КОГДА СвободныеЯчейки.Линия = ""024""
	|			ТОГДА 24
	|		КОГДА СвободныеЯчейки.Линия = ""25""
	|			ТОГДА 25
	|		КОГДА СвободныеЯчейки.Линия = ""025""
	|			ТОГДА 25
	|		КОГДА СвободныеЯчейки.Линия = ""26""
	|			ТОГДА 26
	|		КОГДА СвободныеЯчейки.Линия = ""026""
	|			ТОГДА 26
	|		КОГДА СвободныеЯчейки.Линия = ""27""
	|			ТОГДА 27
	|		КОГДА СвободныеЯчейки.Линия = ""027""
	|			ТОГДА 27
	|		КОГДА СвободныеЯчейки.Линия = ""28""
	|			ТОГДА 28
	|		КОГДА СвободныеЯчейки.Линия = ""028""
	|			ТОГДА 28
	|		КОГДА СвободныеЯчейки.Линия = ""29""
	|			ТОГДА 29
	|		КОГДА СвободныеЯчейки.Линия = ""029""
	|			ТОГДА 29
	|		КОГДА СвободныеЯчейки.Линия = ""30""
	|			ТОГДА 30
	|		КОГДА СвободныеЯчейки.Линия = ""030""
	|			ТОГДА 30
	|		КОГДА СвободныеЯчейки.Линия = ""31""
	|			ТОГДА 31
	|		КОГДА СвободныеЯчейки.Линия = ""031""
	|			ТОГДА 31
	|		КОГДА СвободныеЯчейки.Линия = ""32""
	|			ТОГДА 32
	|		КОГДА СвободныеЯчейки.Линия = ""032""
	|			ТОГДА 32
	|		КОГДА СвободныеЯчейки.Линия = ""33""
	|			ТОГДА 33
	|		КОГДА СвободныеЯчейки.Линия = ""033""
	|			ТОГДА 33
	|		КОГДА СвободныеЯчейки.Линия = ""34""
	|			ТОГДА 34
	|		КОГДА СвободныеЯчейки.Линия = ""034""
	|			ТОГДА 34
	|		КОГДА СвободныеЯчейки.Линия = ""35""
	|			ТОГДА 35
	|		КОГДА СвободныеЯчейки.Линия = ""035""
	|			ТОГДА 35
	|		КОГДА СвободныеЯчейки.Линия = ""36""
	|			ТОГДА 36
	|		КОГДА СвободныеЯчейки.Линия = ""036""
	|			ТОГДА 36
	|		КОГДА СвободныеЯчейки.Линия = ""37""
	|			ТОГДА 37
	|		КОГДА СвободныеЯчейки.Линия = ""037""
	|			ТОГДА 37
	|		КОГДА СвободныеЯчейки.Линия = ""38""
	|			ТОГДА 38
	|		КОГДА СвободныеЯчейки.Линия = ""038""
	|			ТОГДА 38
	|		КОГДА СвободныеЯчейки.Линия = ""39""
	|			ТОГДА 39
	|		КОГДА СвободныеЯчейки.Линия = ""039""
	|			ТОГДА 39
	|		КОГДА СвободныеЯчейки.Линия = ""40""
	|			ТОГДА 40
	|		КОГДА СвободныеЯчейки.Линия = ""040""
	|			ТОГДА 40
	|		КОГДА СвободныеЯчейки.Линия = ""41""
	|			ТОГДА 41
	|		КОГДА СвободныеЯчейки.Линия = ""041""
	|			ТОГДА 41
	|		КОГДА СвободныеЯчейки.Линия = ""42""
	|			ТОГДА 42
	|		КОГДА СвободныеЯчейки.Линия = ""042""
	|			ТОГДА 42
	|		КОГДА СвободныеЯчейки.Линия = ""43""
	|			ТОГДА 43
	|		КОГДА СвободныеЯчейки.Линия = ""043""
	|			ТОГДА 43
	|		КОГДА СвободныеЯчейки.Линия = ""44""
	|			ТОГДА 44
	|		КОГДА СвободныеЯчейки.Линия = ""044""
	|			ТОГДА 44
	|		КОГДА СвободныеЯчейки.Линия = ""45""
	|			ТОГДА 45
	|		КОГДА СвободныеЯчейки.Линия = ""045""
	|			ТОГДА 45
	|		КОГДА СвободныеЯчейки.Линия = ""46""
	|			ТОГДА 46
	|		КОГДА СвободныеЯчейки.Линия = ""046""
	|			ТОГДА 46
	|		КОГДА СвободныеЯчейки.Линия = ""47""
	|			ТОГДА 47
	|		КОГДА СвободныеЯчейки.Линия = ""047""
	|			ТОГДА 47
	|		КОГДА СвободныеЯчейки.Линия = ""48""
	|			ТОГДА 48
	|		КОГДА СвободныеЯчейки.Линия = ""048""
	|			ТОГДА 48
	|		КОГДА СвободныеЯчейки.Линия = ""49""
	|			ТОГДА 49
	|		КОГДА СвободныеЯчейки.Линия = ""049""
	|			ТОГДА 49
	|		КОГДА СвободныеЯчейки.Линия = ""50""
	|			ТОГДА 50
	|		КОГДА СвободныеЯчейки.Линия = ""050""
	|			ТОГДА 50
	|		КОГДА СвободныеЯчейки.Линия = ""51""
	|			ТОГДА 51
	|		КОГДА СвободныеЯчейки.Линия = ""051""
	|			ТОГДА 51
	|		КОГДА СвободныеЯчейки.Линия = ""52""
	|			ТОГДА 52
	|		КОГДА СвободныеЯчейки.Линия = ""052""
	|			ТОГДА 52
	|		КОГДА СвободныеЯчейки.Линия = ""53""
	|			ТОГДА 53
	|		КОГДА СвободныеЯчейки.Линия = ""053""
	|			ТОГДА 53
	|		КОГДА СвободныеЯчейки.Линия = ""54""
	|			ТОГДА 54
	|		КОГДА СвободныеЯчейки.Линия = ""054""
	|			ТОГДА 54
	|		КОГДА СвободныеЯчейки.Линия = ""55""
	|			ТОГДА 55
	|		КОГДА СвободныеЯчейки.Линия = ""055""
	|			ТОГДА 55
	|		КОГДА СвободныеЯчейки.Линия = ""56""
	|			ТОГДА 56
	|		КОГДА СвободныеЯчейки.Линия = ""056""
	|			ТОГДА 56
	|		КОГДА СвободныеЯчейки.Линия = ""57""
	|			ТОГДА 57
	|		КОГДА СвободныеЯчейки.Линия = ""057""
	|			ТОГДА 57
	|		КОГДА СвободныеЯчейки.Линия = ""58""
	|			ТОГДА 58
	|		КОГДА СвободныеЯчейки.Линия = ""058""
	|			ТОГДА 58
	|		КОГДА СвободныеЯчейки.Линия = ""59""
	|			ТОГДА 59
	|		КОГДА СвободныеЯчейки.Линия = ""059""
	|			ТОГДА 59
	|		КОГДА СвободныеЯчейки.Линия = ""60""
	|			ТОГДА 60
	|		КОГДА СвободныеЯчейки.Линия = ""060""
	|			ТОГДА 60
	|		КОГДА СвободныеЯчейки.Линия = ""61""
	|			ТОГДА 61
	|		КОГДА СвободныеЯчейки.Линия = ""061""
	|			ТОГДА 61
	|		КОГДА СвободныеЯчейки.Линия = ""62""
	|			ТОГДА 62
	|		КОГДА СвободныеЯчейки.Линия = ""062""
	|			ТОГДА 62
	|		КОГДА СвободныеЯчейки.Линия = ""63""
	|			ТОГДА 63
	|		КОГДА СвободныеЯчейки.Линия = ""063""
	|			ТОГДА 63
	|		КОГДА СвободныеЯчейки.Линия = ""64""
	|			ТОГДА 64
	|		КОГДА СвободныеЯчейки.Линия = ""064""
	|			ТОГДА 64
	|		КОГДА СвободныеЯчейки.Линия = ""65""
	|			ТОГДА 65
	|		КОГДА СвободныеЯчейки.Линия = ""065""
	|			ТОГДА 65
	|		КОГДА СвободныеЯчейки.Линия = ""66""
	|			ТОГДА 66
	|		КОГДА СвободныеЯчейки.Линия = ""066""
	|			ТОГДА 66
	|		КОГДА СвободныеЯчейки.Линия = ""67""
	|			ТОГДА 67
	|		КОГДА СвободныеЯчейки.Линия = ""067""
	|			ТОГДА 67
	|		КОГДА СвободныеЯчейки.Линия = ""68""
	|			ТОГДА 68
	|		КОГДА СвободныеЯчейки.Линия = ""068""
	|			ТОГДА 68
	|		КОГДА СвободныеЯчейки.Линия = ""69""
	|			ТОГДА 69
	|		КОГДА СвободныеЯчейки.Линия = ""069""
	|			ТОГДА 69
	|		КОГДА СвободныеЯчейки.Линия = ""70""
	|			ТОГДА 70
	|		КОГДА СвободныеЯчейки.Линия = ""070""
	|			ТОГДА 70
	|		КОГДА СвободныеЯчейки.Линия = ""71""
	|			ТОГДА 71
	|		КОГДА СвободныеЯчейки.Линия = ""071""
	|			ТОГДА 71
	|		КОГДА СвободныеЯчейки.Линия = ""72""
	|			ТОГДА 72
	|		КОГДА СвободныеЯчейки.Линия = ""072""
	|			ТОГДА 72
	|		КОГДА СвободныеЯчейки.Линия = ""73""
	|			ТОГДА 73
	|		КОГДА СвободныеЯчейки.Линия = ""073""
	|			ТОГДА 73
	|		КОГДА СвободныеЯчейки.Линия = ""74""
	|			ТОГДА 74
	|		КОГДА СвободныеЯчейки.Линия = ""074""
	|			ТОГДА 74
	|		КОГДА СвободныеЯчейки.Линия = ""75""
	|			ТОГДА 75
	|		КОГДА СвободныеЯчейки.Линия = ""075""
	|			ТОГДА 75
	|		КОГДА СвободныеЯчейки.Линия = ""76""
	|			ТОГДА 76
	|		КОГДА СвободныеЯчейки.Линия = ""076""
	|			ТОГДА 76
	|		КОГДА СвободныеЯчейки.Линия = ""77""
	|			ТОГДА 77
	|		КОГДА СвободныеЯчейки.Линия = ""077""
	|			ТОГДА 77
	|		КОГДА СвободныеЯчейки.Линия = ""78""
	|			ТОГДА 78
	|		КОГДА СвободныеЯчейки.Линия = ""078""
	|			ТОГДА 78
	|		КОГДА СвободныеЯчейки.Линия = ""79""
	|			ТОГДА 79
	|		КОГДА СвободныеЯчейки.Линия = ""079""
	|			ТОГДА 79
	|		КОГДА СвободныеЯчейки.Линия = ""80""
	|			ТОГДА 80
	|		КОГДА СвободныеЯчейки.Линия = ""080""
	|			ТОГДА 80
	|		КОГДА СвободныеЯчейки.Линия = ""81""
	|			ТОГДА 81
	|		КОГДА СвободныеЯчейки.Линия = ""081""
	|			ТОГДА 81
	|		КОГДА СвободныеЯчейки.Линия = ""82""
	|			ТОГДА 82
	|		КОГДА СвободныеЯчейки.Линия = ""082""
	|			ТОГДА 82
	|		КОГДА СвободныеЯчейки.Линия = ""83""
	|			ТОГДА 83
	|		КОГДА СвободныеЯчейки.Линия = ""083""
	|			ТОГДА 83
	|		КОГДА СвободныеЯчейки.Линия = ""84""
	|			ТОГДА 84
	|		КОГДА СвободныеЯчейки.Линия = ""084""
	|			ТОГДА 84
	|		КОГДА СвободныеЯчейки.Линия = ""85""
	|			ТОГДА 85
	|		КОГДА СвободныеЯчейки.Линия = ""085""
	|			ТОГДА 85
	|		КОГДА СвободныеЯчейки.Линия = ""86""
	|			ТОГДА 86
	|		КОГДА СвободныеЯчейки.Линия = ""086""
	|			ТОГДА 86
	|		КОГДА СвободныеЯчейки.Линия = ""87""
	|			ТОГДА 87
	|		КОГДА СвободныеЯчейки.Линия = ""087""
	|			ТОГДА 87
	|		КОГДА СвободныеЯчейки.Линия = ""88""
	|			ТОГДА 88
	|		КОГДА СвободныеЯчейки.Линия = ""088""
	|			ТОГДА 88
	|		КОГДА СвободныеЯчейки.Линия = ""89""
	|			ТОГДА 89
	|		КОГДА СвободныеЯчейки.Линия = ""089""
	|			ТОГДА 89
	|		КОГДА СвободныеЯчейки.Линия = ""90""
	|			ТОГДА 90
	|		КОГДА СвободныеЯчейки.Линия = ""090""
	|			ТОГДА 90
	|		КОГДА СвободныеЯчейки.Линия = ""91""
	|			ТОГДА 91
	|		КОГДА СвободныеЯчейки.Линия = ""091""
	|			ТОГДА 91
	|		КОГДА СвободныеЯчейки.Линия = ""92""
	|			ТОГДА 92
	|		КОГДА СвободныеЯчейки.Линия = ""092""
	|			ТОГДА 92
	|		КОГДА СвободныеЯчейки.Линия = ""93""
	|			ТОГДА 93
	|		КОГДА СвободныеЯчейки.Линия = ""093""
	|			ТОГДА 93
	|		КОГДА СвободныеЯчейки.Линия = ""94""
	|			ТОГДА 94
	|		КОГДА СвободныеЯчейки.Линия = ""094""
	|			ТОГДА 94
	|		КОГДА СвободныеЯчейки.Линия = ""95""
	|			ТОГДА 95
	|		КОГДА СвободныеЯчейки.Линия = ""095""
	|			ТОГДА 95
	|		КОГДА СвободныеЯчейки.Линия = ""96""
	|			ТОГДА 96
	|		КОГДА СвободныеЯчейки.Линия = ""096""
	|			ТОГДА 96
	|		КОГДА СвободныеЯчейки.Линия = ""97""
	|			ТОГДА 97
	|		КОГДА СвободныеЯчейки.Линия = ""097""
	|			ТОГДА 97
	|		КОГДА СвободныеЯчейки.Линия = ""98""
	|			ТОГДА 98
	|		КОГДА СвободныеЯчейки.Линия = ""098""
	|			ТОГДА 98
	|		КОГДА СвободныеЯчейки.Линия = ""99""
	|			ТОГДА 99
	|		КОГДА СвободныеЯчейки.Линия = ""099""
	|			ТОГДА 99
	|		КОГДА СвободныеЯчейки.Линия = ""100""
	|			ТОГДА 100
	|		КОГДА СвободныеЯчейки.Линия = ""0100""
	|			ТОГДА 100
	|		ИНАЧЕ СвободныеЯчейки.Линия
	|	КОНЕЦ КАК Линия,
	|	СвободныеЯчейки.Секция,
	|	СвободныеЯчейки.Стеллаж,
	|	СвободныеЯчейки.Ярус,
	|	СвободныеЯчейки.ПорядокОбхода,
	|	СвободныеЯчейки.ПаллетОстаток - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) КАК ПаллетОстаток,
	|	СвободныеЯчейки.НомерРяда_Пролета,
	|	СвободныеЯчейки.Зона,
	|	СвободныеЯчейки.КоличествоПаллет КАК КоличествоПаллет
	|ПОМЕСТИТЬ ТаблицаАнализаСвободныхЯчеек
	|ИЗ
	|	СвободныеЯчейки КАК СвободныеЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПаллетМестГруппировка КАК ТаблицаПаллетМестГруппировка
	|		ПО СвободныеЯчейки.Ячейка = ТаблицаПаллетМестГруппировка.Ячейка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СвободныеЯчейки.КоличествоПаллет < 0.3
	|				ТОГДА СвободныеЯчейки.ПаллетОстаток - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) > 0
	|			КОГДА СвободныеЯчейки.КоличествоПаллет > 1
	|				ТОГДА СвободныеЯчейки.ПаллетОстаток - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) > 1
	|			ИНАЧЕ СвободныеЯчейки.КоличествоПаллет = СвободныеЯчейки.ПаллетОстаток - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПаллетМест
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПаллетМестГруппировка";
	
	Запрос.УстановитьПараметр("ТаблицаПаллетМест", ТаблицаПаллетМест);
	
	//@skip-warning
	 Запрос.Выполнить();
	
КонецПроцедуры

Функция ТекстЗапросаПоискаЯчеекРазмещенияРозница()
		Текст="ВЫБРАТЬ
		|	Товары.ИдентификаторУпаковки,
		|	Товары.Номенклатура,
		|	Товары.СерияНоменклатуры,
		|	Товары.КарантинПаллеты,
		|	Товары.ЯчейкаОтправитель,
		|	Товары.Количество
		|ПОМЕСТИТЬ ТоварыДокумента
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыДокумента.ИдентификаторУпаковки,
		|	ВЫРАЗИТЬ(ТоварыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ТоварыДокумента.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры,
		|	ВЫБОР
		|		КОГДА &СкладскоеПомещение = ЗНАЧЕНИЕ(Справочник.ИтСкладскиеПомещения.ПустаяСсылка)
		|			ТОГДА ВЫРАЗИТЬ(ТоварыДокумента.Номенклатура КАК Справочник.Номенклатура).итПреоритетнаяЗонаРазмещения
		|		ИНАЧЕ &СкладскоеПомещение
		|	КОНЕЦ КАК СкладскоеПомещение,
		|	ЕСТЬNULL(ТоварыДокумента.КарантинПаллеты, ИСТИНА) КАК КарантинПаллеты,
		|	ВЫРАЗИТЬ(ТоварыДокумента.ЯчейкаОтправитель КАК Справочник.итСкладскиеЯчейки) КАК ЯчейкаОтправитель,
		|	ЕСТЬNULL(ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчасткаСрезПоследних.АссортиментныйУчастокСклада,
		|		ЗНАЧЕНИЕ(Справочник.ит_WMS_АссортиментныеУчасткиСклада.ПустаяСсылка)) КАК АссортиментныйУчастокСклада,
		|	ТоварыДокумента.Количество,
		|	ВЫРАЗИТЬ(ТоварыДокумента.Номенклатура КАК Справочник.Номенклатура).ЕдиницаИзмеренияМест.итКоличествоНаПаллете КАК
		|		КоличествоНаПаллете,
		|	ТоварыДокумента.Количество / ВЫБОР
		|		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ТоварыДокумента.Номенклатура КАК
		|			Справочник.Номенклатура).ЕдиницаИзмеренияМест.итКоличествоНаПаллете, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ТоварыДокумента.Номенклатура КАК
		|			Справочник.Номенклатура).ЕдиницаИзмеренияМест.итКоличествоНаПаллете, 0)
		|	КОНЕЦ КАК КоэффициентПаллеты
		|ПОМЕСТИТЬ ТаблицаТоваровЗаготокаДляОбработки
		|ИЗ
		|	ТоварыДокумента КАК ТоварыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка.СрезПоследних(,
		|			Организация = &Организация) КАК ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчасткаСрезПоследних
		|		ПО ТоварыДокумента.Номенклатура = ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчасткаСрезПоследних.Номенклатура
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки,
		|	СУММА(ТаблицаТоваровЗаготокаДляОбработки.КоэффициентПаллеты) КАК КоэффициентПаллеты
		|ПОМЕСТИТЬ ВтКоэффициентПаллеты
		|ИЗ
		|	ТаблицаТоваровЗаготокаДляОбработки КАК ТаблицаТоваровЗаготокаДляОбработки
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыДокумента.ИдентификаторУпаковки,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыДокумента.Номенклатура) КАК КоличествоРазличнойНомеклатуры,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыДокумента.СерияНоменклатуры) КАК КоличествоРазличныхСерий,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыДокумента.ЯчейкаОтправитель) КАК КоличествоРазличныхЯчеекОтправителей
		|ПОМЕСТИТЬ РабиениеНаОднородныеНеОднородныеПаллеты
		|ИЗ
		|	ТоварыДокумента КАК ТоварыДокумента
		|СГРУППИРОВАТЬ ПО
		|	ТоварыДокумента.ИдентификаторУпаковки
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабиениеНаОднородныеНеОднородныеПаллеты.ИдентификаторУпаковки
		|ПОМЕСТИТЬ ОднородныеПаллеты
		|ИЗ
		|	РабиениеНаОднородныеНеОднородныеПаллеты КАК РабиениеНаОднородныеНеОднородныеПаллеты
		|ГДЕ
		|	РабиениеНаОднородныеНеОднородныеПаллеты.КоличествоРазличнойНомеклатуры = 1
		|	И РабиениеНаОднородныеНеОднородныеПаллеты.КоличествоРазличныхСерий = 1
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабиениеНаОднородныеНеОднородныеПаллеты.ИдентификаторУпаковки
		|ПОМЕСТИТЬ НеОднородныеПаллеты
		|ИЗ
		|	РабиениеНаОднородныеНеОднородныеПаллеты КАК РабиениеНаОднородныеНеОднородныеПаллеты
		|ГДЕ
		|	РабиениеНаОднородныеНеОднородныеПаллеты.КоличествоРазличнойНомеклатуры > 1
		|	И РабиениеНаОднородныеНеОднородныеПаллеты.КоличествоРазличныхСерий > 1
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
		|	СУММА(ТаблицаТоваровЗаготокаДляОбработки.КоэффициентПаллеты) КАК КоэффициентПаллеты
		|ПОМЕСТИТЬ КоэффициентНеОднароднойПаллеты
		|ИЗ
		|	НеОднородныеПаллеты КАК НеОднородныеПаллеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваровЗаготокаДляОбработки КАК ТаблицаТоваровЗаготокаДляОбработки
		|		ПО НеОднородныеПаллеты.ИдентификаторУпаковки = ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки
		|ГДЕ
		|	ТаблицаТоваровЗаготокаДляОбработки.КарантинПаллеты = ЛОЖЬ
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
		|	ТаблицаТоваровЗаготокаДляОбработки.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваровЗаготокаДляОбработки.СкладскоеПомещение КАК НоменклатураитПреоритетнаяЗонаРазмещения,
		|	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки КАК КоличествоПаллетНоменклатуры,
		|	ТаблицаТоваровЗаготокаДляОбработки.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК КоличествоРазличныхЯчеекОтправителей,
		|	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
		|	ТаблицаТоваровЗаготокаДляОбработки.АссортиментныйУчастокСклада КАК АссортиментныйУчастокСклада,
		|	ВтКоэффициентПаллеты.КоэффициентПаллеты КАК КоэффициентПаллеты
		|ИЗ
		|	ОднородныеПаллеты КАК ОднородныеПаллеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваровЗаготокаДляОбработки КАК ТаблицаТоваровЗаготокаДляОбработки
		|		ПО ОднородныеПаллеты.ИдентификаторУпаковки = ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКоэффициентПаллеты КАК ВтКоэффициентПаллеты
		|		ПО ОднородныеПаллеты.ИдентификаторУпаковки = ВтКоэффициентПаллеты.ИдентификаторУпаковки
		|ГДЕ
		|	ТаблицаТоваровЗаготокаДляОбработки.КарантинПаллеты = ЛОЖЬ
		|УПОРЯДОЧИТЬ ПО
		|	СерияНоменклатуры
		|ИТОГИ
		|	МАКСИМУМ(НоменклатураитПреоритетнаяЗонаРазмещения),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоПаллетНоменклатуры),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоРазличныхЯчеекОтправителей),
		|	МАКСИМУМ(ЯчейкаОтправитель),
		|	МАКСИМУМ(АссортиментныйУчастокСклада),
		|	МАКСИМУМ(КоэффициентПаллеты)
		|ПО
		|	Номенклатура,
		|	ИдентификаторУпаковки
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
		|	ТаблицаТоваровЗаготокаДляОбработки.СкладскоеПомещение КАК НоменклатураитПреоритетнаяЗонаРазмещения,
		|	ТаблицаТоваровЗаготокаДляОбработки.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваровЗаготокаДляОбработки.СкладскоеПомещение КАК СкладскоеПомещение,
		|	ТаблицаТоваровЗаготокаДляОбработки.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК КоличествоРазличныхЯчеекОтправителей,
		|	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
		|	ТаблицаТоваровЗаготокаДляОбработки.АссортиментныйУчастокСклада КАК АссортиментныйУчастокСклада,
		|	КоэффициентНеОднароднойПаллеты.КоэффициентПаллеты КАК КоэффициентПаллеты
		|ИЗ
		|	НеОднородныеПаллеты КАК НеОднородныеПаллеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваровЗаготокаДляОбработки КАК ТаблицаТоваровЗаготокаДляОбработки
		|		ПО НеОднородныеПаллеты.ИдентификаторУпаковки = ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоэффициентНеОднароднойПаллеты КАК КоэффициентНеОднароднойПаллеты
		|		ПО НеОднородныеПаллеты.ИдентификаторУпаковки = КоэффициентНеОднароднойПаллеты.ИдентификаторУпаковки
		|ГДЕ
		|	ТаблицаТоваровЗаготокаДляОбработки.КарантинПаллеты = ЛОЖЬ
		|УПОРЯДОЧИТЬ ПО
		|	СерияНоменклатуры
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураитПреоритетнаяЗонаРазмещения),
		|	МАКСИМУМ(СкладскоеПомещение),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоРазличныхЯчеекОтправителей),
		|	МАКСИМУМ(ЯчейкаОтправитель),
		|	МАКСИМУМ(АссортиментныйУчастокСклада),
		|	МАКСИМУМ(КоэффициентПаллеты)
		|ПО
		|	ИдентификаторУпаковки
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваровЗаготокаДляОбработки.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
		|	&ЗонаКарантина КАК НоменклатураитПреоритетнаяЗонаРазмещения,
		|	&ЗонаКарантина КАК СкладскоеПомещение,
		|	ТаблицаТоваровЗаготокаДляОбработки.Номенклатура,
		|	ТаблицаТоваровЗаготокаДляОбработки.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК КоличествоРазличныхЯчеекОтправителей,
		|	ТаблицаТоваровЗаготокаДляОбработки.ЯчейкаОтправитель КАК ЯчейкаОтправитель,
		|	ТаблицаТоваровЗаготокаДляОбработки.КоэффициентПаллеты КАК КоэффициентПаллеты
		|ИЗ
		|	ТаблицаТоваровЗаготокаДляОбработки КАК ТаблицаТоваровЗаготокаДляОбработки
		|ГДЕ
		|	ТаблицаТоваровЗаготокаДляОбработки.КарантинПаллеты = ИСТИНА
		|УПОРЯДОЧИТЬ ПО
		|	СерияНоменклатуры
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураитПреоритетнаяЗонаРазмещения),
		|	МАКСИМУМ(СкладскоеПомещение),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоРазличныхЯчеекОтправителей),
		|	МАКСИМУМ(ЯчейкаОтправитель),
		|	МАКСИМУМ(КоэффициентПаллеты)
		|ПО
		|	ИдентификаторУпаковки";
	Возврат Текст;

КонецФункции

Процедура ЗапросСвободныхЯчеекСогласноПаллетМестРозница(МенеджерЗапроса)	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерЗапроса;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итТоварыВЯчейках.Организация,
	|	итТоварыВЯчейках.Склад,
	|	итТоварыВЯчейках.ИдентификаторУпаковки,
	|	итТоварыВЯчейках.Ячейка,
	|	итТоварыВЯчейках.Номенклатура,
	|	итТоварыВЯчейках.Характеристика,
	|	итТоварыВЯчейках.СерияНоменклатуры,
	|	итТоварыВЯчейках.ДатаРозлива,
	|	итТоварыВЯчейках.Качество,
	|	СУММА(ВЫБОР
	|		КОГДА итТоварыВЯчейках.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА итТоварыВЯчейках.Количество + итТоварыВЯчейках.КРазмещению
	|		ИНАЧЕ -(итТоварыВЯчейках.Количество + итТоварыВЯчейках.КРазмещению)
	|	КОНЕЦ) КАК ДвижениеДокумента
	|ПОМЕСТИТЬ ДанныеДвиженияДокумента
	|ИЗ
	|	РегистрНакопления.итТоварыВЯчейках КАК итТоварыВЯчейках
	|ГДЕ
	|	итТоварыВЯчейках.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	итТоварыВЯчейках.ДатаРозлива,
	|	итТоварыВЯчейках.ИдентификаторУпаковки,
	|	итТоварыВЯчейках.Качество,
	|	итТоварыВЯчейках.Номенклатура,
	|	итТоварыВЯчейках.Организация,
	|	итТоварыВЯчейках.СерияНоменклатуры,
	|	итТоварыВЯчейках.Склад,
	|	итТоварыВЯчейках.Характеристика,
	|	итТоварыВЯчейках.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итТоварыВЯчейкахОстатки.Склад,
	|	итТоварыВЯчейкахОстатки.Ячейка,
	|	итТоварыВЯчейкахОстатки.ИдентификаторУпаковки,
	|	итТоварыВЯчейкахОстатки.Номенклатура,
	|	итТоварыВЯчейкахОстатки.Характеристика,
	|	итТоварыВЯчейкахОстатки.СерияНоменклатуры,
	|	итТоварыВЯчейкахОстатки.ДатаРозлива,
	|	итТоварыВЯчейкахОстатки.Качество,
	|	итТоварыВЯчейкахОстатки.КоличествоОстаток + итТоварыВЯчейкахОстатки.КРазмещениюОстаток +
	|		ЕСТЬNULL(ДанныеДвиженияДокумента.ДвижениеДокумента, 0) КАК КоличествоОстаток,
	|	итТоварыВЯчейкахОстатки.КоличествоОстаток + итТоварыВЯчейкахОстатки.КРазмещениюОстаток +
	|		ДанныеДвиженияДокумента.ДвижениеДокумента / ВЫБОР
	|		КОГДА ЕСТЬNULL(итТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмеренияМест.итКоличествоНаПаллете, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(итТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмеренияМест.итКоличествоНаПаллете, 0)
	|	КОНЕЦ КАК ПаллетОстаток,
	|	итТоварыВЯчейкахОстатки.Организация
	|ПОМЕСТИТЬ ВтОстаткиПоЯчейкам
	|ИЗ
	|	РегистрНакопления.итТоварыВЯчейках.Остатки КАК итТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДвиженияДокумента КАК ДанныеДвиженияДокумента
	|		ПО итТоварыВЯчейкахОстатки.Склад = ДанныеДвиженияДокумента.Склад
	|		И итТоварыВЯчейкахОстатки.Ячейка = ДанныеДвиженияДокумента.Ячейка
	|		И итТоварыВЯчейкахОстатки.ИдентификаторУпаковки = ДанныеДвиженияДокумента.ИдентификаторУпаковки
	|		И итТоварыВЯчейкахОстатки.Номенклатура = ДанныеДвиженияДокумента.Номенклатура
	|		И итТоварыВЯчейкахОстатки.Характеристика = ДанныеДвиженияДокумента.Характеристика
	|		И итТоварыВЯчейкахОстатки.СерияНоменклатуры = ДанныеДвиженияДокумента.СерияНоменклатуры
	|		И итТоварыВЯчейкахОстатки.ДатаРозлива = ДанныеДвиженияДокумента.ДатаРозлива
	|		И итТоварыВЯчейкахОстатки.Качество = ДанныеДвиженияДокумента.Качество
	|		И итТоварыВЯчейкахОстатки.Организация = ДанныеДвиженияДокумента.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОстаткиПоЯчейкам.Ячейка,
	|	СУММА(ВтОстаткиПоЯчейкам.ПаллетОстаток) КАК ПаллетОстаток
	|ПОМЕСТИТЬ ОстаткиЯчеекГруппировка
	|ИЗ
	|	ВтОстаткиПоЯчейкам КАК ВтОстаткиПоЯчейкам
	|СГРУППИРОВАТЬ ПО
	|	ВтОстаткиПоЯчейкам.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итСкладскиеЯчейки.Ссылка КАК Ячейка,
	|	итСкладскиеЯчейки.Линия,
	|	итСкладскиеЯчейки.Секция,
	|	итСкладскиеЯчейки.Стеллаж,
	|	итСкладскиеЯчейки.Ярус,
	|	итСкладскиеЯчейки.НомерРяда_Пролета,
	|	итСкладскиеЯчейки.Зона,
	|	итСкладскиеЯчейки.ЯчейкаНачалаРазмещения,
	|	итСкладскиеЯчейки.КоличествоПалет,
	|	итСкладскиеЯчейки.СкладскоеПомещение,
	|	итСкладскиеЯчейки.ПорядокОбхода
	|ПОМЕСТИТЬ ВтЯчейки
	|ИЗ
	|	Справочник.итСкладскиеЯчейки КАК итСкладскиеЯчейки
	|ГДЕ
	|	НЕ итСкладскиеЯчейки.ЭтоГруппа
	|	И НЕ итСкладскиеЯчейки.ПометкаУдаления
	|	И НЕ итСкладскиеЯчейки.Заблокирована
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЯчейки.Ячейка,
	|	ВтЯчейки.Линия,
	|	ВтЯчейки.Секция,
	|	ВтЯчейки.Стеллаж,
	|	ВтЯчейки.Ярус,
	|	ВтЯчейки.НомерРяда_Пролета,
	|	ВтЯчейки.Зона,
	|	ВтЯчейки.ЯчейкаНачалаРазмещения,
	|	ВтЯчейки.КоличествоПалет - ЕСТЬNULL(ОстаткиЯчеекГруппировка.ПаллетОстаток, 0) КАК ПаллетОстаток,
	|	ВтЯчейки.КоличествоПалет,
	|	ВтЯчейки.СкладскоеПомещение,
	|	ВтЯчейки.ПорядокОбхода
	|ПОМЕСТИТЬ СвободныеЯчейкиОтбор
	|ИЗ
	|	ВтЯчейки КАК ВтЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиЯчеекГруппировка КАК ОстаткиЯчеекГруппировка
	|		ПО ВтЯчейки.Ячейка = ОстаткиЯчеекГруппировка.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеЯчейкиОтбор.Ячейка,
	|	СвободныеЯчейкиОтбор.Линия,
	|	СвободныеЯчейкиОтбор.Секция,
	|	СвободныеЯчейкиОтбор.Стеллаж,
	|	СвободныеЯчейкиОтбор.Ярус,
	|	СвободныеЯчейкиОтбор.НомерРяда_Пролета,
	|	СвободныеЯчейкиОтбор.Зона,
	|	СвободныеЯчейкиОтбор.ЯчейкаНачалаРазмещения,
	|	СвободныеЯчейкиОтбор.ПаллетОстаток,
	|	СвободныеЯчейкиОтбор.КоличествоПалет КАК КоличествоПаллет,
	|	СвободныеЯчейкиОтбор.СкладскоеПомещение,
	|	СвободныеЯчейкиОтбор.ПорядокОбхода
	|ПОМЕСТИТЬ СвободныеЯчейки
	|ИЗ
	|	СвободныеЯчейкиОтбор КАК СвободныеЯчейкиОтбор
	|ГДЕ
	|	ВЫБОР
	|		КОГДА СвободныеЯчейкиОтбор.КоличествоПалет < 0.3
	|			ТОГДА СвободныеЯчейкиОтбор.ПаллетОстаток > 0
	|		КОГДА СвободныеЯчейкиОтбор.КоличествоПалет > 1
	|			ТОГДА СвободныеЯчейкиОтбор.ПаллетОстаток > 1
	|		ИНАЧЕ СвободныеЯчейкиОтбор.КоличествоПалет = СвободныеЯчейкиОтбор.ПаллетОстаток
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОстаткиПоЯчейкам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОстаткиЯчеекГруппировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтЯчейки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СвободныеЯчейкиОтбор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеДвиженияДокумента";
	Запрос.УстановитьПараметр("Регистратор",Ссылка);
	
	//@skip-warning
	РезультатЗапроса = Запрос.Выполнить();	
КонецПроцедуры

Функция ЗапроситьИнформациюПоЯчейкамСогласноУчасткамРозница(МенеджерВременныхТаблиц,СтруктураДанных)
	АссортиментныйУчасток=Справочники.ит_WMS_АссортиментныеУчасткиСклада.ПустаяСсылка();
	Если СтруктураДанных.Свойство("АссортиментныйУчасток") Тогда 
		АссортиментныйУчасток=СтруктураДанных.АссортиментныйУчасток;
	Иначе                                      
		АссортиментныйУчасток=СтруктураДанных.ТекущийАссортиментныйУчастокСклада;
	КонецЕсли;
	ТекущийКоэффициентПаллеты=0;
	Если СтруктураДанных.Свойство("ТекущийКоэффициентПаллеты") Тогда 
		ТекущийКоэффициентПаллеты=СтруктураДанных.ТекущийКоэффициентПаллеты;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек.Ячейка
		|ПОМЕСТИТЬ ЯчейкиАссортиметногоУчастка
		|ИЗ
		|	Справочник.ит_WMS_АссортиментныеУчасткиСклада.СоставЯчеек КАК ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек
		|ГДЕ
		|	ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек.Ссылка = &АссортиментныйУчасток
		|	И ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек.Ячейка.ВидСкладскойДеятельности = ЗНАЧЕНИЕ(Перечисление.ит_WMS_ВидыСкладскойДеятельности.Розничная)
		|
		|СГРУППИРОВАТЬ ПО
		|	ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
		|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
		|	ТаблицаАнализаСвободныхЯчеек.Линия КАК Линия,
		|	ТаблицаАнализаСвободныхЯчеек.Секция,
		|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
		|	ТаблицаАнализаСвободныхЯчеек.Ярус,
		|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
		|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
		|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
		|	ТаблицаАнализаСвободныхЯчеек.Зона,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода >= 0
		|			ТОГДА ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода
		|		ИНАЧЕ -(ЕСТЬNULL(&НачалоОтсчетаПорядкаОбхода, 0) - ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода)
		|	КОНЕЦ КАК ПорядокОбходаПоЗонеПриемки,
		|	ВЫБОР
		|		КОГДА ТаблицаАнализаСвободныхЯчеек.Зона = ЗНАЧЕНИЕ(Перечисление.итWMSЗоныСклада.Хранения)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПриоритетЗоныХранения,
		|	ВЫБОР
		|		КОГДА &ТекущийКоэффициентПаллеты > 0
		|				И &ТекущийКоэффициентПаллеты < 1
		|				И ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет < 1
		|			ТОГДА ВЫБОР
		|					КОГДА ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет - &ТекущийКоэффициентПаллеты < 0
		|						ТОГДА 1
		|					ИНАЧЕ -(&ТекущийКоэффициентПаллеты - ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет)
		|				КОНЕЦ
		|		КОГДА &ТекущийКоэффициентПаллеты > 0
		|				И &ТекущийКоэффициентПаллеты >= 1
		|				И ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет >= 1
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Порядок,
		|	ТаблицаАнализаСвободныхЯчеек.ПаллетОстаток
		|ПОМЕСТИТЬ ТаблицаОтбораСвободныхЯчеек
		|ИЗ
		|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЯчейкиАссортиметногоУчастка КАК ЯчейкиАссортиметногоУчастка
		|		ПО ТаблицаАнализаСвободныхЯчеек.Ячейка = ЯчейкиАссортиметногоУчастка.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СвободныеЯчейки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
		|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
		|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
		|	ТаблицаАнализаСвободныхЯчеек.Линия,
		|	ТаблицаАнализаСвободныхЯчеек.Секция,
		|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
		|	ТаблицаАнализаСвободныхЯчеек.Ярус,
		|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
		|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
		|	ТаблицаАнализаСвободныхЯчеек.Зона,
		|	ТаблицаАнализаСвободныхЯчеек.ПаллетОстаток
		|ПОМЕСТИТЬ СвободныеЯчейки
		|ИЗ
		|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаАнализаСвободныхЯчеек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаОтбораСвободныхЯчеек.Ячейка КАК Ячейка,
		|	ТаблицаОтбораСвободныхЯчеек.СкладскоеПомещение,
		|	ТаблицаОтбораСвободныхЯчеек.Линия КАК Линия,
		|	ТаблицаОтбораСвободныхЯчеек.Секция,
		|	ТаблицаОтбораСвободныхЯчеек.Стеллаж,
		|	ТаблицаОтбораСвободныхЯчеек.Ярус,
		|	ТаблицаОтбораСвободныхЯчеек.ПорядокОбхода,
		|	ТаблицаОтбораСвободныхЯчеек.КоличествоПаллет,
		|	ТаблицаОтбораСвободныхЯчеек.НомерРяда_Пролета,
		|	ТаблицаОтбораСвободныхЯчеек.ПорядокОбходаПоЗонеПриемки КАК ПорядокОбходаПоЗонеПриемки,
		|	ТаблицаОтбораСвободныхЯчеек.Порядок КАК Порядок,
		|	ТаблицаОтбораСвободныхЯчеек.ПриоритетЗоныХранения КАК ПриоритетЗоныХранения,
		|	ТаблицаОтбораСвободныхЯчеек.ПаллетОстаток
		|ИЗ
		|	ТаблицаОтбораСвободныхЯчеек КАК ТаблицаОтбораСвободныхЯчеек
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ТекущийКоэффициентПаллеты > 0
		|				ТОГДА ТаблицаОтбораСвободныхЯчеек.ПаллетОстаток >= &ТекущийКоэффициентПаллеты
		|			ИНАЧЕ ТаблицаОтбораСвободныхЯчеек.ПаллетОстаток >= 1
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетЗоныХранения,
		|	Порядок,
		|	ПорядокОбходаПоЗонеПриемки,
		|	Ячейка,
		|	Линия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОтбораСвободныхЯчеек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЯчейкиАссортиметногоУчастка";
	
	Запрос.УстановитьПараметр("АссортиментныйУчасток", АссортиментныйУчасток);
	Запрос.УстановитьПараметр("НачалоОтсчетаПорядкаОбхода",СтруктураДанных.НачалоОтсчетаПорядкаОбхода);
    Запрос.УстановитьПараметр("ТекущийКоэффициентПаллеты",ТекущийКоэффициентПаллеты);

	
	Возврат Запрос.Выполнить();	
	КонецФункции

#КонецОбласти


Процедура ПоискЯчеекРазмещения(СтруктураДанных)Экспорт
	//////////// Получение данных настроек wms
	НастройкиWMS=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилищаПоСвойствам("ЯчейкиИсключенияАвтоматическогоРазмещения");
	Если итWMSСлужебныеПроцедурыИФункции.ТиповойОбработчикВыявленияОшибок(НастройкиWMS) Тогда
		итWMSСлужебныеПроцедурыИФункции.WMSОповещениеОТиповыхОшибках(НастройкиWMS);
		Возврат;
	КонецЕсли;
	//////////////////////////////////
	ЗонаКарантина=Константы.ЗонаКарантина.Получить();
	СтруктураДанных.Вставить("ЯчейкиИсключенияАвтоматическогоРазмещения",НастройкиWMS.ЯчейкиИсключенияАвтоматическогоРазмещения.ВыгрузитьКолонку("Ячейка"));
	УстановкаОбязательныхПараметров(СтруктураДанных);
	ТаблицаДляЗапроса=Товары.Выгрузить();
	ВидСкладскойДеятельности=Неопределено;
    СтруктураДанных.Свойство("ВидСкладскойДеятельности",ВидСкладскойДеятельности); 
    Если ВидСкладскойДеятельности=Неопределено Тогда
		 ВидСкладскойДеятельности=итWMSСлужебныеПроцедурыИФункции.ВидСкладскойДеятельностиПоУмолчанию(Организация);
	КонецЕсли;
	Запрос = Новый Запрос;
	Если ВидСкладскойДеятельности=Перечисления.ит_WMS_ВидыСкладскойДеятельности.Розничная Тогда 
	Запрос.Текст = ТекстЗапросаПоискаЯчеекРазмещенияРозница();
	Иначе 
	Запрос.Текст = ТекстЗапросаПоискаЯчеекРазмещенияОПТ();
	КонецЕсли;
	Запрос.УстановитьПараметр("Товары",ТаблицаДляЗапроса);
	Запрос.УстановитьПараметр("СкладскоеПомещение",СкладскоеПомещениеРазмещения);
	Запрос.УстановитьПараметр("ЗонаКарантина",ЗонаКарантина);
	Запрос.УстановитьПараметр("Организация",Организация);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	Если ВидСкладскойДеятельности=Перечисления.ит_WMS_ВидыСкладскойДеятельности.Розничная Тогда
	ПоискЯчеекРазмещенияРозница(ЗонаКарантина, МассивРезультатов, СтруктураДанных);
	иначе
	ПоискЯчеекРазмещенияОпт(ЗонаКарантина, МассивРезультатов, СтруктураДанных);
    КонецЕсли;
	
	
	
	
	
КонецПроцедуры




// Описание
// 
// Параметры:
// 	СтруктураДанных - Структура - Описание:
// * НачалоОтсчетаПорядкаОбхода - Число - устанавливает 0 по умолчанию, если свойство не установлено 
// * РазмещатьСПриоритетомХранения - Булево - устанавливает Истина по умолчанию, если свойство не установлено
// * РазмещатьПоБлижайшейЗонеПриемки - Булево - устанавливает Истина по умолчанию, если свойство не установлено
Процедура УстановкаОбязательныхПараметров( СтруктураДанных)
	
	Если  не СтруктураДанных.Свойство("НачалоОтсчетаПорядкаОбхода") тогда
		СтруктураДанных.Вставить("НачалоОтсчетаПорядкаОбхода",0);
	КонецЕсли;
	Если не СтруктураДанных.Свойство("РазмещатьСПриоритетомХранения") Тогда 
		СтруктураДанных.Вставить("РазмещатьСПриоритетомХранения",Истина);
	КонецЕсли;
	Если не СтруктураДанных.Свойство("РазмещатьПоБлижайшейЗонеПриемки") Тогда 
		СтруктураДанных.Вставить("РазмещатьПоБлижайшейЗонеПриемки",Истина);
	КонецЕсли;
	
КонецПроцедуры







Процедура РазместитьКарантинПаллеты(РезультатЗапроса,МенеджерВременныхТаблиц,СтруктураДанных)
	ТаблицаПаллетМест=новый ТаблицаЗначений;
	ТаблицаПаллетМест.Колонки.Добавить("Ячейка",новый ОписаниеТипов("СправочникСсылка.итСкладскиеЯчейки"));
	ТаблицаПаллетМест.Колонки.Добавить("КоличествоЗанятыхПаллетМест",новый ОписаниеТипов("Число"));
	ВыборкаКарантинПаллеты=РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока  ВыборкаКарантинПаллеты.Следующий() Цикл 
		Если ВыборкаКарантинПаллеты.НоменклатураитПреоритетнаяЗонаРазмещения>1 тогда
			Сообщить("для паллеты карантина "+ВыборкаКарантинПаллеты.ИдентификаторУпаковки+" место размещения не найдено");
			Продолжить;
		КонецЕсли;	
		Сообщить("Паллета "+ВыборкаКарантинПаллеты.ИдентификаторУпаковки+" размещается в зону карантина");
		РезультатСвободныхЯчеек=ЗапроситьИнформациюПоЯчейкамКарантина(МенеджерВременныхТаблиц,ТаблицаПаллетМест);
		ТаблицаПаллетМест.Очистить();
		ВыборкаСвободныхЯчеек=РезультатСвободныхЯчеек.Выбрать();
		СтрокиТабличнойЧасти=Товары.НайтиСтроки(новый Структура("ИдентификаторУпаковки",ВыборкаКарантинПаллеты.ИдентификаторУпаковки));
		Если ВыборкаСвободныхЯчеек.Следующий() тогда
			КоличествоПаллет=ВыборкаСвободныхЯчеек.КоличествоПаллет;
			пока КоличествоПаллет>0 цикл
				для Каждого стр из СтрокиТабличнойЧасти цикл
					стр.ЯчейкаПолучатель=ВыборкаСвободныхЯчеек.Ячейка;
				КонецЦикла;
				КоличествоПаллет=КоличествоПаллет-1;
				СтрокаТаблицыПаллетМест=ТаблицаПаллетМест.Добавить();
				СтрокаТаблицыПаллетМест.Ячейка=ВыборкаСвободныхЯчеек.Ячейка;
				СтрокаТаблицыПаллетМест.КоличествоЗанятыхПаллетМест=1;
				Если КоличествоПаллет>0 тогда
					Если   ВыборкаКарантинПаллеты.Следующий() тогда
						СтрокиТабличнойЧасти=Товары.НайтиСтроки(новый Структура("ИдентификаторУпаковки",ВыборкаКарантинПаллеты.ИдентификаторУпаковки));
						Сообщить("Паллета "+ВыборкаКарантинПаллеты.ИдентификаторУпаковки+" размещается в зону карантина");
					иначе
						Прервать;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
		иначе
			Сообщить(" для паллеты карантина "+ ВыборкаКарантинПаллеты.ИдентификаторУпаковки +" не нашлось подходящей ячейки");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Процедура ЗаполнитьДанныеСвободнымиЯчейкамиКарантина(СкладскоеПомещение,МенеджерЗапроса)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерЗапроса;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	Товары.ИдентификаторУпаковки КАК ИдентификаторУпаковки
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТовары.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтТовары.ИдентификаторУпаковки) КАК ЗанятоеКоличествоПаллетоМест
	|ПОМЕСТИТЬ ВтРассчетЗанятыхПаллетоМест
	|ИЗ
	|	ВтТовары КАК ВтТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТовары.ЯчейкаПолучатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ячейка КАК Ячейка,
	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.ПаллетВЯчейке, 0)) КАК ПаллетВЯчейке
	|ПОМЕСТИТЬ ПаллетыВЯчейках
	|ИЗ
	|	(ВЫБРАТЬ
	|		итТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|		ЕСТЬNULL(итТоварыВЯчейкахОстатки.КоличествоОстаток, 0) + итТоварыВЯчейкахОстатки.КРазмещениюОстаток / ВЫБОР
	|			КОГДА ЕСТЬNULL(итТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмеренияМест.итКоличествоНаПаллете, 1) = 0
	|				ТОГДА 1
	|			ИНАЧЕ ЕСТЬNULL(итТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмеренияМест.итКоличествоНаПаллете, 1)
	|		КОНЕЦ КАК ПаллетВЯчейке
	|	ИЗ
	|		РегистрНакопления.итТоварыВЯчейках.Остатки КАК итТоварыВЯчейкахОстатки) КАК ВложенныйЗапрос
	|ГДЕ
	|	НЕ ВложенныйЗапрос.Ячейка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итСкладскиеЯчейки.Ссылка КАК Ячейка,
	|	ЕСТЬNULL(итСкладскиеЯчейки.КоличествоПалет, 0) - ЕСТЬNULL(ПаллетыВЯчейках.ПаллетВЯчейке, 0) - ЕСТЬNULL(ВтРассчетЗанятыхПаллетоМест.ЗанятоеКоличествоПаллетоМест, 0) КАК КоличествоПаллет,
	|	итСкладскиеЯчейки.СкладскоеПомещение КАК СкладскоеПомещение,
	|	итСкладскиеЯчейки.Секция КАК Секция,
	|	итСкладскиеЯчейки.Стеллаж КАК Стеллаж,
	|	итСкладскиеЯчейки.Линия КАК Линия,
	|	итСкладскиеЯчейки.Типоразмер КАК Типоразмер,
	|	итСкладскиеЯчейки.ПорядокОбхода КАК ПорядокОбхода,
	|	итСкладскиеЯчейки.НомерРяда_Пролета КАК НомерРяда_Пролета,
	|	итСкладскиеЯчейки.Ярус КАК Ярус,
	|	итСкладскиеЯчейки.Зона КАК Зона
	|ПОМЕСТИТЬ СвободныеЯчейки
	|ИЗ
	|	Справочник.итСкладскиеЯчейки КАК итСкладскиеЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПаллетыВЯчейках КАК ПаллетыВЯчейках
	|		ПО (ПаллетыВЯчейках.Ячейка = итСкладскиеЯчейки.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРассчетЗанятыхПаллетоМест КАК ВтРассчетЗанятыхПаллетоМест
	|		ПО итСкладскиеЯчейки.Ссылка = ВтРассчетЗанятыхПаллетоМест.ЯчейкаПолучатель
	|ГДЕ
	|	ЕСТЬNULL(итСкладскиеЯчейки.КоличествоПалет, 0) - ЕСТЬNULL(ПаллетыВЯчейках.ПаллетВЯчейке, 0) - ЕСТЬNULL(ВтРассчетЗанятыхПаллетоМест.ЗанятоеКоличествоПаллетоМест, 0) >= 1
	|	И итСкладскиеЯчейки.СкладскоеПомещение = &СкладскоеПомещение
	|	И итСкладскиеЯчейки.ЭтоГруппа = ЛОЖЬ
	|	И итСкладскиеЯчейки.Заблокирована = ЛОЖЬ
	|	И НЕ итСкладскиеЯчейки.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("СкладскоеПомещение",СкладскоеПомещение);
	Запрос.УстановитьПараметр("Товары",Товары);
	
	//@skip-warning
	РезультатЗапроса = Запрос.Выполнить();	

	КонецПроцедуры
	
Функция ЗапроситьИнформациюПоЯчейкамКарантина(МенеджерЗапроса,ТаблицаПаллетМест)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерЗапроса;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПаллетМест.Ячейка,
		|	ТаблицаПаллетМест.КоличествоЗанятыхПаллетМест
		|ПОМЕСТИТЬ ТаблицаПаллетМест
		|ИЗ
		|	&ТаблицаПаллетМест КАК ТаблицаПаллетМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПаллетМест.Ячейка,
		|	СУММА(ТаблицаПаллетМест.КоличествоЗанятыхПаллетМест) КАК КоличествоЗанятыхПаллетМест
		|ПОМЕСТИТЬ ТаблицаПаллетМестГруппировка
		|ИЗ
		|	ТаблицаПаллетМест КАК ТаблицаПаллетМест
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПаллетМест.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвободныеЯчейки.Ячейка,
		|	СвободныеЯчейки.СкладскоеПомещение,
		|	ВЫБОР
		|		КОГДА СвободныеЯчейки.Линия = ""0""
		|			ТОГДА 0
		|		КОГДА СвободныеЯчейки.Линия = ""00""
		|			ТОГДА 0
		|		КОГДА СвободныеЯчейки.Линия = ""1""
		|			ТОГДА 1
		|		КОГДА СвободныеЯчейки.Линия = ""01""
		|			ТОГДА 1
		|		КОГДА СвободныеЯчейки.Линия = ""2""
		|			ТОГДА 2
		|		КОГДА СвободныеЯчейки.Линия = ""02""
		|			ТОГДА 2
		|		КОГДА СвободныеЯчейки.Линия = ""3""
		|			ТОГДА 3
		|		КОГДА СвободныеЯчейки.Линия = ""03""
		|			ТОГДА 3
		|		КОГДА СвободныеЯчейки.Линия = ""4""
		|			ТОГДА 4
		|		КОГДА СвободныеЯчейки.Линия = ""04""
		|			ТОГДА 4
		|		КОГДА СвободныеЯчейки.Линия = ""5""
		|			ТОГДА 5
		|		КОГДА СвободныеЯчейки.Линия = ""05""
		|			ТОГДА 5
		|		КОГДА СвободныеЯчейки.Линия = ""6""
		|			ТОГДА 6
		|		КОГДА СвободныеЯчейки.Линия = ""06""
		|			ТОГДА 6
		|		КОГДА СвободныеЯчейки.Линия = ""7""
		|			ТОГДА 7
		|		КОГДА СвободныеЯчейки.Линия = ""07""
		|			ТОГДА 7
		|		КОГДА СвободныеЯчейки.Линия = ""8""
		|			ТОГДА 8
		|		КОГДА СвободныеЯчейки.Линия = ""08""
		|			ТОГДА 8
		|		КОГДА СвободныеЯчейки.Линия = ""9""
		|			ТОГДА 9
		|		КОГДА СвободныеЯчейки.Линия = ""09""
		|			ТОГДА 9
		|		КОГДА СвободныеЯчейки.Линия = ""10""
		|			ТОГДА 10
		|		КОГДА СвободныеЯчейки.Линия = ""010""
		|			ТОГДА 10
		|		КОГДА СвободныеЯчейки.Линия = ""11""
		|			ТОГДА 11
		|		КОГДА СвободныеЯчейки.Линия = ""011""
		|			ТОГДА 11
		|		КОГДА СвободныеЯчейки.Линия = ""12""
		|			ТОГДА 12
		|		КОГДА СвободныеЯчейки.Линия = ""012""
		|			ТОГДА 12
		|		КОГДА СвободныеЯчейки.Линия = ""13""
		|			ТОГДА 13
		|		КОГДА СвободныеЯчейки.Линия = ""013""
		|			ТОГДА 13
		|		КОГДА СвободныеЯчейки.Линия = ""14""
		|			ТОГДА 14
		|		КОГДА СвободныеЯчейки.Линия = ""014""
		|			ТОГДА 14
		|		КОГДА СвободныеЯчейки.Линия = ""15""
		|			ТОГДА 15
		|		КОГДА СвободныеЯчейки.Линия = ""015""
		|			ТОГДА 15
		|		КОГДА СвободныеЯчейки.Линия = ""16""
		|			ТОГДА 16
		|		КОГДА СвободныеЯчейки.Линия = ""016""
		|			ТОГДА 16
		|		КОГДА СвободныеЯчейки.Линия = ""17""
		|			ТОГДА 17
		|		КОГДА СвободныеЯчейки.Линия = ""017""
		|			ТОГДА 17
		|		КОГДА СвободныеЯчейки.Линия = ""18""
		|			ТОГДА 18
		|		КОГДА СвободныеЯчейки.Линия = ""018""
		|			ТОГДА 18
		|		КОГДА СвободныеЯчейки.Линия = ""19""
		|			ТОГДА 19
		|		КОГДА СвободныеЯчейки.Линия = ""019""
		|			ТОГДА 19
		|		КОГДА СвободныеЯчейки.Линия = ""20""
		|			ТОГДА 20
		|		КОГДА СвободныеЯчейки.Линия = ""020""
		|			ТОГДА 20
		|		КОГДА СвободныеЯчейки.Линия = ""21""
		|			ТОГДА 21
		|		КОГДА СвободныеЯчейки.Линия = ""021""
		|			ТОГДА 21
		|		КОГДА СвободныеЯчейки.Линия = ""22""
		|			ТОГДА 22
		|		КОГДА СвободныеЯчейки.Линия = ""022""
		|			ТОГДА 22
		|		КОГДА СвободныеЯчейки.Линия = ""23""
		|			ТОГДА 23
		|		КОГДА СвободныеЯчейки.Линия = ""023""
		|			ТОГДА 23
		|		КОГДА СвободныеЯчейки.Линия = ""24""
		|			ТОГДА 24
		|		КОГДА СвободныеЯчейки.Линия = ""024""
		|			ТОГДА 24
		|		КОГДА СвободныеЯчейки.Линия = ""25""
		|			ТОГДА 25
		|		КОГДА СвободныеЯчейки.Линия = ""025""
		|			ТОГДА 25
		|		КОГДА СвободныеЯчейки.Линия = ""26""
		|			ТОГДА 26
		|		КОГДА СвободныеЯчейки.Линия = ""026""
		|			ТОГДА 26
		|		КОГДА СвободныеЯчейки.Линия = ""27""
		|			ТОГДА 27
		|		КОГДА СвободныеЯчейки.Линия = ""027""
		|			ТОГДА 27
		|		КОГДА СвободныеЯчейки.Линия = ""28""
		|			ТОГДА 28
		|		КОГДА СвободныеЯчейки.Линия = ""028""
		|			ТОГДА 28
		|		КОГДА СвободныеЯчейки.Линия = ""29""
		|			ТОГДА 29
		|		КОГДА СвободныеЯчейки.Линия = ""029""
		|			ТОГДА 29
		|		КОГДА СвободныеЯчейки.Линия = ""30""
		|			ТОГДА 30
		|		КОГДА СвободныеЯчейки.Линия = ""030""
		|			ТОГДА 30
		|		КОГДА СвободныеЯчейки.Линия = ""31""
		|			ТОГДА 31
		|		КОГДА СвободныеЯчейки.Линия = ""031""
		|			ТОГДА 31
		|		КОГДА СвободныеЯчейки.Линия = ""32""
		|			ТОГДА 32
		|		КОГДА СвободныеЯчейки.Линия = ""032""
		|			ТОГДА 32
		|		КОГДА СвободныеЯчейки.Линия = ""33""
		|			ТОГДА 33
		|		КОГДА СвободныеЯчейки.Линия = ""033""
		|			ТОГДА 33
		|		КОГДА СвободныеЯчейки.Линия = ""34""
		|			ТОГДА 34
		|		КОГДА СвободныеЯчейки.Линия = ""034""
		|			ТОГДА 34
		|		КОГДА СвободныеЯчейки.Линия = ""35""
		|			ТОГДА 35
		|		КОГДА СвободныеЯчейки.Линия = ""035""
		|			ТОГДА 35
		|		КОГДА СвободныеЯчейки.Линия = ""36""
		|			ТОГДА 36
		|		КОГДА СвободныеЯчейки.Линия = ""036""
		|			ТОГДА 36
		|		КОГДА СвободныеЯчейки.Линия = ""37""
		|			ТОГДА 37
		|		КОГДА СвободныеЯчейки.Линия = ""037""
		|			ТОГДА 37
		|		КОГДА СвободныеЯчейки.Линия = ""38""
		|			ТОГДА 38
		|		КОГДА СвободныеЯчейки.Линия = ""038""
		|			ТОГДА 38
		|		КОГДА СвободныеЯчейки.Линия = ""39""
		|			ТОГДА 39
		|		КОГДА СвободныеЯчейки.Линия = ""039""
		|			ТОГДА 39
		|		КОГДА СвободныеЯчейки.Линия = ""40""
		|			ТОГДА 40
		|		КОГДА СвободныеЯчейки.Линия = ""040""
		|			ТОГДА 40
		|		КОГДА СвободныеЯчейки.Линия = ""41""
		|			ТОГДА 41
		|		КОГДА СвободныеЯчейки.Линия = ""041""
		|			ТОГДА 41
		|		КОГДА СвободныеЯчейки.Линия = ""42""
		|			ТОГДА 42
		|		КОГДА СвободныеЯчейки.Линия = ""042""
		|			ТОГДА 42
		|		КОГДА СвободныеЯчейки.Линия = ""43""
		|			ТОГДА 43
		|		КОГДА СвободныеЯчейки.Линия = ""043""
		|			ТОГДА 43
		|		КОГДА СвободныеЯчейки.Линия = ""44""
		|			ТОГДА 44
		|		КОГДА СвободныеЯчейки.Линия = ""044""
		|			ТОГДА 44
		|		КОГДА СвободныеЯчейки.Линия = ""45""
		|			ТОГДА 45
		|		КОГДА СвободныеЯчейки.Линия = ""045""
		|			ТОГДА 45
		|		КОГДА СвободныеЯчейки.Линия = ""46""
		|			ТОГДА 46
		|		КОГДА СвободныеЯчейки.Линия = ""046""
		|			ТОГДА 46
		|		КОГДА СвободныеЯчейки.Линия = ""47""
		|			ТОГДА 47
		|		КОГДА СвободныеЯчейки.Линия = ""047""
		|			ТОГДА 47
		|		КОГДА СвободныеЯчейки.Линия = ""48""
		|			ТОГДА 48
		|		КОГДА СвободныеЯчейки.Линия = ""048""
		|			ТОГДА 48
		|		КОГДА СвободныеЯчейки.Линия = ""49""
		|			ТОГДА 49
		|		КОГДА СвободныеЯчейки.Линия = ""049""
		|			ТОГДА 49
		|		КОГДА СвободныеЯчейки.Линия = ""50""
		|			ТОГДА 50
		|		КОГДА СвободныеЯчейки.Линия = ""050""
		|			ТОГДА 50
		|		КОГДА СвободныеЯчейки.Линия = ""51""
		|			ТОГДА 51
		|		КОГДА СвободныеЯчейки.Линия = ""051""
		|			ТОГДА 51
		|		КОГДА СвободныеЯчейки.Линия = ""52""
		|			ТОГДА 52
		|		КОГДА СвободныеЯчейки.Линия = ""052""
		|			ТОГДА 52
		|		КОГДА СвободныеЯчейки.Линия = ""53""
		|			ТОГДА 53
		|		КОГДА СвободныеЯчейки.Линия = ""053""
		|			ТОГДА 53
		|		КОГДА СвободныеЯчейки.Линия = ""54""
		|			ТОГДА 54
		|		КОГДА СвободныеЯчейки.Линия = ""054""
		|			ТОГДА 54
		|		КОГДА СвободныеЯчейки.Линия = ""55""
		|			ТОГДА 55
		|		КОГДА СвободныеЯчейки.Линия = ""055""
		|			ТОГДА 55
		|		КОГДА СвободныеЯчейки.Линия = ""56""
		|			ТОГДА 56
		|		КОГДА СвободныеЯчейки.Линия = ""056""
		|			ТОГДА 56
		|		КОГДА СвободныеЯчейки.Линия = ""57""
		|			ТОГДА 57
		|		КОГДА СвободныеЯчейки.Линия = ""057""
		|			ТОГДА 57
		|		КОГДА СвободныеЯчейки.Линия = ""58""
		|			ТОГДА 58
		|		КОГДА СвободныеЯчейки.Линия = ""058""
		|			ТОГДА 58
		|		КОГДА СвободныеЯчейки.Линия = ""59""
		|			ТОГДА 59
		|		КОГДА СвободныеЯчейки.Линия = ""059""
		|			ТОГДА 59
		|		КОГДА СвободныеЯчейки.Линия = ""60""
		|			ТОГДА 60
		|		КОГДА СвободныеЯчейки.Линия = ""060""
		|			ТОГДА 60
		|		КОГДА СвободныеЯчейки.Линия = ""61""
		|			ТОГДА 61
		|		КОГДА СвободныеЯчейки.Линия = ""061""
		|			ТОГДА 61
		|		КОГДА СвободныеЯчейки.Линия = ""62""
		|			ТОГДА 62
		|		КОГДА СвободныеЯчейки.Линия = ""062""
		|			ТОГДА 62
		|		КОГДА СвободныеЯчейки.Линия = ""63""
		|			ТОГДА 63
		|		КОГДА СвободныеЯчейки.Линия = ""063""
		|			ТОГДА 63
		|		КОГДА СвободныеЯчейки.Линия = ""64""
		|			ТОГДА 64
		|		КОГДА СвободныеЯчейки.Линия = ""064""
		|			ТОГДА 64
		|		КОГДА СвободныеЯчейки.Линия = ""65""
		|			ТОГДА 65
		|		КОГДА СвободныеЯчейки.Линия = ""065""
		|			ТОГДА 65
		|		КОГДА СвободныеЯчейки.Линия = ""66""
		|			ТОГДА 66
		|		КОГДА СвободныеЯчейки.Линия = ""066""
		|			ТОГДА 66
		|		КОГДА СвободныеЯчейки.Линия = ""67""
		|			ТОГДА 67
		|		КОГДА СвободныеЯчейки.Линия = ""067""
		|			ТОГДА 67
		|		КОГДА СвободныеЯчейки.Линия = ""68""
		|			ТОГДА 68
		|		КОГДА СвободныеЯчейки.Линия = ""068""
		|			ТОГДА 68
		|		КОГДА СвободныеЯчейки.Линия = ""69""
		|			ТОГДА 69
		|		КОГДА СвободныеЯчейки.Линия = ""069""
		|			ТОГДА 69
		|		КОГДА СвободныеЯчейки.Линия = ""70""
		|			ТОГДА 70
		|		КОГДА СвободныеЯчейки.Линия = ""070""
		|			ТОГДА 70
		|		КОГДА СвободныеЯчейки.Линия = ""71""
		|			ТОГДА 71
		|		КОГДА СвободныеЯчейки.Линия = ""071""
		|			ТОГДА 71
		|		КОГДА СвободныеЯчейки.Линия = ""72""
		|			ТОГДА 72
		|		КОГДА СвободныеЯчейки.Линия = ""072""
		|			ТОГДА 72
		|		КОГДА СвободныеЯчейки.Линия = ""73""
		|			ТОГДА 73
		|		КОГДА СвободныеЯчейки.Линия = ""073""
		|			ТОГДА 73
		|		КОГДА СвободныеЯчейки.Линия = ""74""
		|			ТОГДА 74
		|		КОГДА СвободныеЯчейки.Линия = ""074""
		|			ТОГДА 74
		|		КОГДА СвободныеЯчейки.Линия = ""75""
		|			ТОГДА 75
		|		КОГДА СвободныеЯчейки.Линия = ""075""
		|			ТОГДА 75
		|		КОГДА СвободныеЯчейки.Линия = ""76""
		|			ТОГДА 76
		|		КОГДА СвободныеЯчейки.Линия = ""076""
		|			ТОГДА 76
		|		КОГДА СвободныеЯчейки.Линия = ""77""
		|			ТОГДА 77
		|		КОГДА СвободныеЯчейки.Линия = ""077""
		|			ТОГДА 77
		|		КОГДА СвободныеЯчейки.Линия = ""78""
		|			ТОГДА 78
		|		КОГДА СвободныеЯчейки.Линия = ""078""
		|			ТОГДА 78
		|		КОГДА СвободныеЯчейки.Линия = ""79""
		|			ТОГДА 79
		|		КОГДА СвободныеЯчейки.Линия = ""079""
		|			ТОГДА 79
		|		КОГДА СвободныеЯчейки.Линия = ""80""
		|			ТОГДА 80
		|		КОГДА СвободныеЯчейки.Линия = ""080""
		|			ТОГДА 80
		|		КОГДА СвободныеЯчейки.Линия = ""81""
		|			ТОГДА 81
		|		КОГДА СвободныеЯчейки.Линия = ""081""
		|			ТОГДА 81
		|		КОГДА СвободныеЯчейки.Линия = ""82""
		|			ТОГДА 82
		|		КОГДА СвободныеЯчейки.Линия = ""082""
		|			ТОГДА 82
		|		КОГДА СвободныеЯчейки.Линия = ""83""
		|			ТОГДА 83
		|		КОГДА СвободныеЯчейки.Линия = ""083""
		|			ТОГДА 83
		|		КОГДА СвободныеЯчейки.Линия = ""84""
		|			ТОГДА 84
		|		КОГДА СвободныеЯчейки.Линия = ""084""
		|			ТОГДА 84
		|		КОГДА СвободныеЯчейки.Линия = ""85""
		|			ТОГДА 85
		|		КОГДА СвободныеЯчейки.Линия = ""085""
		|			ТОГДА 85
		|		КОГДА СвободныеЯчейки.Линия = ""86""
		|			ТОГДА 86
		|		КОГДА СвободныеЯчейки.Линия = ""086""
		|			ТОГДА 86
		|		КОГДА СвободныеЯчейки.Линия = ""87""
		|			ТОГДА 87
		|		КОГДА СвободныеЯчейки.Линия = ""087""
		|			ТОГДА 87
		|		КОГДА СвободныеЯчейки.Линия = ""88""
		|			ТОГДА 88
		|		КОГДА СвободныеЯчейки.Линия = ""088""
		|			ТОГДА 88
		|		КОГДА СвободныеЯчейки.Линия = ""89""
		|			ТОГДА 89
		|		КОГДА СвободныеЯчейки.Линия = ""089""
		|			ТОГДА 89
		|		КОГДА СвободныеЯчейки.Линия = ""90""
		|			ТОГДА 90
		|		КОГДА СвободныеЯчейки.Линия = ""090""
		|			ТОГДА 90
		|		КОГДА СвободныеЯчейки.Линия = ""91""
		|			ТОГДА 91
		|		КОГДА СвободныеЯчейки.Линия = ""091""
		|			ТОГДА 91
		|		КОГДА СвободныеЯчейки.Линия = ""92""
		|			ТОГДА 92
		|		КОГДА СвободныеЯчейки.Линия = ""092""
		|			ТОГДА 92
		|		КОГДА СвободныеЯчейки.Линия = ""93""
		|			ТОГДА 93
		|		КОГДА СвободныеЯчейки.Линия = ""093""
		|			ТОГДА 93
		|		КОГДА СвободныеЯчейки.Линия = ""94""
		|			ТОГДА 94
		|		КОГДА СвободныеЯчейки.Линия = ""094""
		|			ТОГДА 94
		|		КОГДА СвободныеЯчейки.Линия = ""95""
		|			ТОГДА 95
		|		КОГДА СвободныеЯчейки.Линия = ""095""
		|			ТОГДА 95
		|		КОГДА СвободныеЯчейки.Линия = ""96""
		|			ТОГДА 96
		|		КОГДА СвободныеЯчейки.Линия = ""096""
		|			ТОГДА 96
		|		КОГДА СвободныеЯчейки.Линия = ""97""
		|			ТОГДА 97
		|		КОГДА СвободныеЯчейки.Линия = ""097""
		|			ТОГДА 97
		|		КОГДА СвободныеЯчейки.Линия = ""98""
		|			ТОГДА 98
		|		КОГДА СвободныеЯчейки.Линия = ""098""
		|			ТОГДА 98
		|		КОГДА СвободныеЯчейки.Линия = ""99""
		|			ТОГДА 99
		|		КОГДА СвободныеЯчейки.Линия = ""099""
		|			ТОГДА 99
		|		КОГДА СвободныеЯчейки.Линия = ""100""
		|			ТОГДА 100
		|		КОГДА СвободныеЯчейки.Линия = ""0100""
		|			ТОГДА 100
		|		ИНАЧЕ СвободныеЯчейки.Линия
		|	КОНЕЦ КАК Линия,
		|	СвободныеЯчейки.Секция,
		|	СвободныеЯчейки.Стеллаж,
		|	СвободныеЯчейки.Ярус,
		|	СвободныеЯчейки.ПорядокОбхода,
		|	СвободныеЯчейки.КоличествоПаллет - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) КАК КоличествоПаллет,
		|	СвободныеЯчейки.НомерРяда_Пролета,
		|	СвободныеЯчейки.Зона
		|ПОМЕСТИТЬ ТаблицаАнализаСвободныхЯчеек
		|ИЗ
		|	СвободныеЯчейки КАК СвободныеЯчейки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПаллетМестГруппировка КАК ТаблицаПаллетМестГруппировка
		|		ПО СвободныеЯчейки.Ячейка = ТаблицаПаллетМестГруппировка.Ячейка
		|ГДЕ
		|	СвободныеЯчейки.КоличествоПаллет - ЕСТЬNULL(ТаблицаПаллетМестГруппировка.КоличествоЗанятыхПаллетМест, 0) >= 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаПаллетМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаПаллетМестГруппировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СвободныеЯчейки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаАнализаСвободныхЯчеек.Ячейка,
		|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение,
		|	ТаблицаАнализаСвободныхЯчеек.Линия,
		|	ТаблицаАнализаСвободныхЯчеек.Секция,
		|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
		|	ТаблицаАнализаСвободныхЯчеек.Ярус,
		|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода,
		|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
		|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета,
		|	ТаблицаАнализаСвободныхЯчеек.Зона
		|ПОМЕСТИТЬ СвободныеЯчейки
		|ИЗ
		|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаАнализаСвободныхЯчеек.Ячейка КАК Ячейка,
		|	ТаблицаАнализаСвободныхЯчеек.СкладскоеПомещение КАК СкладскоеПомещение,
		|	ТаблицаАнализаСвободныхЯчеек.Линия КАК Линия,
		|	ТаблицаАнализаСвободныхЯчеек.Секция,
		|	ТаблицаАнализаСвободныхЯчеек.Стеллаж,
		|	ТаблицаАнализаСвободныхЯчеек.Ярус,
		|	ТаблицаАнализаСвободныхЯчеек.ПорядокОбхода КАК ПорядокОбхода,
		|	ТаблицаАнализаСвободныхЯчеек.КоличествоПаллет,
		|	ТаблицаАнализаСвободныхЯчеек.НомерРяда_Пролета КАК НомерРяда_Пролета,
		|	ТаблицаАнализаСвободныхЯчеек.Зона
		|ИЗ
		|	ТаблицаАнализаСвободныхЯчеек КАК ТаблицаАнализаСвободныхЯчеек
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкладскоеПомещение,
		|	ПорядокОбхода,
		|	Линия,
		|	НомерРяда_Пролета,
		|	Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаАнализаСвободныхЯчеек";
	
	   Запрос.УстановитьПараметр("ТаблицаПаллетМест",ТаблицаПаллетМест);
	
	   Возврат Запрос.Выполнить();
	
	
КонецФункции
	








#КонецОбласти	

Функция НайтиЗначенияВСтруктурированномМассиве(Массив,ИмяПоля)
	Для Каждого стр из Массив цикл
		Если НРег(стр.имя)=НРег(ИмяПоля) Тогда 
			Возврат стр.Значение;
		КонецЕсли;	
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	итWMSСлужебныеПроцедурыИФункции.УстановитьРежимПроведенияЗавершенногоДокумента(СтатусДокумента,РежимПроведения);
	Если Проведен и РежимЗаписи=РежимЗаписиДокумента.Запись тогда
		Если не ОбменДанными.Загрузка Тогда 
		РежимЗаписи=РежимЗаписиДокумента.Проведение;
		КонецЕсли;
	КонецЕсли;	
	Если  РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
		ПередЗаписьюПроведение(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;	
	Если ЭтотОбъект.Проведен и РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения тогда
		ПередЗаписьюОтменаПроведения(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	ЗаписьПараметровСтратегии();
	Если ОбменДанными.Загрузка Тогда 
		Отказ=Ложь;
	КонецЕсли;	
КонецПроцедуры
Процедура ПередЗаписьюОтменаПроведения(Отказ, РежимЗаписи, РежимПроведения)
	Если СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен Тогда 
		СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан;
	КонецЕсли;
	
	КонецПроцедуры
Процедура ПередЗаписьюПроведение(Отказ, РежимЗаписи, РежимПроведения)
	Если СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан Тогда  
		СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен;
	КонецЕсли;
КонецПроцедуры
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
    
	Если Отказ тогда
		Возврат
	КонецЕсли;
	УстановитьБлокировкиДанныхИОчиститьРегистры();
	Если СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен тогда
		ПроведениеПоРегистрамНакопления(Отказ, РежимПроведения);
	КонецЕсли;
	ПроверкаНаСоответсвиеДанныхЯчеек(Отказ, РежимПроведения);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	КонецПроцедуры
	
Процедура УстановитьБлокировкиДанныхИОчиститьРегистры()
	
	БлокировкаДанных = новый БлокировкаДанных;
	
	#Область БлокировкаитТоварыВЯчейках	
	
	СтруктураПараметров=итWMSСлужебныеПроцедурыИФункции.СоздатьСтруктуруПараметровБлокировкиДанных(Товары,БлокировкаДанных);
	СтруктураПараметров.ПолеПространствоБлокировок="Ячейка";
	СтруктураПараметров.ПолеИсточника="ЯчейкаПолучатель";
	СтруктураПараметров.ПространствоБлокировки="РегистрНакопления.итТоварыВЯчейках";
	итWMSСлужебныеПроцедурыИФункции.УстановкаЭлементаБлокировокДанныхWMS(СтруктураПараметров);
	
	#КонецОбласти
	
	
	
	БлокировкаДанных.Заблокировать();
	
	
	НаборЗаписей=РегистрыНакопления.итТоварыВЯчейках.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	
	
КонецПроцедуры
	
Процедура ПроведениеПоРегистрамНакопления(Отказ, РежимПроведения)
	ПроведениеПоТоварамВЯчейках(Отказ, РежимПроведения);
КонецПроцедуры
процедура ПроведениеПоТоварамВЯчейках(Отказ, РежимПроведения)
		
	итТоварыВЯчейках=Движения.итТоварыВЯчейках;
    КачествоПустаяСсылка=Справочники.Качество.ПустаяСсылка();
	КачествоНовый=Справочники.Качество.Новый;
	
	для Каждого стр из Товары цикл
		///движение Приход
		НоваяЗапись=итТоварыВЯчейках.Добавить();
		НоваяЗапись.Период=Дата;
		НоваяЗапись.Регистратор=Ссылка;
		НоваяЗапись.Организация=Организация;
		НоваяЗапись.Ячейка=стр.ЯчейкаПолучатель;
		НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
		НоваяЗапись.ИдентификаторУпаковки=стр.ИдентификаторУпаковки;
		НоваяЗапись.Номенклатура=стр.Номенклатура;
		НоваяЗапись.Характеристика=стр.Характеристика;
		НоваяЗапись.ДатаРозлива=стр.ДатаРозлива;
		НоваяЗапись.Качество=?(стр.Качество=КачествоПустаяСсылка,КачествоНовый,стр.Качество);
		НоваяЗапись.Количество=стр.Количество;
		НоваяЗапись.СерияНоменклатуры=стр.СерияНоменклатуры;
		НоваяЗапись.Склад=?(стр.Склад=Справочники.Склады.ПустаяСсылка(),Склад,стр.Склад);		
	КонецЦикла;
	итТоварыВЯчейках.Записать();
КонецПроцедуры



Процедура ЗаписьПараметровСтратегии()
	Если АдресХраненияПараметров="" Тогда 
		Возврат
	КонецЕсли;	
	ДанныеХранилища=ПолучитьИзВременногоХранилища(АдресХраненияПараметров);
	Если ДанныеХранилища=Неопределено тогда
		АдресХраненияПараметров="";
		Возврат
	КонецЕсли;	
	ЭтотОбъект.ПараметрыСтратегии=новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресХраненияПараметров));
	АдресХраненияПараметров="";
КонецПроцедуры



Процедура ПроверкаНаСоответсвиеДанныхЯчеек(Отказ, РежимПроведения)

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	итWMSРучноеРазмещениеТовары.ЯчейкаПолучатель
		|ПОМЕСТИТЬ ВтЯчейкиРазмещения
		|ИЗ
		|	Документ.итWMSРучноеРазмещение.Товары КАК итWMSРучноеРазмещениеТовары
		|ГДЕ
		|	итWMSРучноеРазмещениеТовары.Ссылка = &Ссылка
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итТоварыВЯчейкахОстатки.Организация,
		|	итТоварыВЯчейкахОстатки.Склад,
		|	итТоварыВЯчейкахОстатки.ИдентификаторУпаковки,
		|	итТоварыВЯчейкахОстатки.Ячейка,
		|	итТоварыВЯчейкахОстатки.Номенклатура,
		|	итТоварыВЯчейкахОстатки.Характеристика,
		|	итТоварыВЯчейкахОстатки.СерияНоменклатуры,
		|	итТоварыВЯчейкахОстатки.ДатаРозлива,
		|	итТоварыВЯчейкахОстатки.Качество,
		|	итТоварыВЯчейкахОстатки.КоличествоОстаток,
		|	итТоварыВЯчейкахОстатки.КОтборуОстаток,
		|	итТоварыВЯчейкахОстатки.КРазмещениюОстаток
		|ПОМЕСТИТЬ ОстаткиПоЯчейкам
		|ИЗ
		|	ВтЯчейкиРазмещения КАК ВтЯчейкиРазмещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.итТоварыВЯчейках.Остатки(&Период,) КАК итТоварыВЯчейкахОстатки
		|		ПО ВтЯчейкиРазмещения.ЯчейкаПолучатель = итТоварыВЯчейкахОстатки.Ячейка
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиПоЯчейкам.Ячейка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОстаткиПоЯчейкам.ИдентификаторУпаковки) КАК КоличествоПаллет,
		|	ОстаткиПоЯчейкам.Ячейка.КоличествоПалет КАК МаксКоличествоПалет
		|ПОМЕСТИТЬ ПаллетОстаткиПоЯчейкам
		|ИЗ
		|	ОстаткиПоЯчейкам КАК ОстаткиПоЯчейкам
		|ГДЕ
		|	ОстаткиПоЯчейкам.Ячейка.ВидСкладскойДеятельности = ЗНАЧЕНИЕ(Перечисление.ит_WMS_ВидыСкладскойДеятельности.Оптовая)
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПоЯчейкам.Ячейка,
		|	ОстаткиПоЯчейкам.Ячейка.КоличествоПалет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиПоЯчейкам.Ячейка,
		|	СУММА(ОстаткиПоЯчейкам.КоличествоОстаток / ВЫБОР
		|		КОГДА ОстаткиПоЯчейкам.Номенклатура.ЕдиницаИзмеренияМест.итКоличествоНаПаллете = 0
		|			ТОГДА 1
		|		ИНАЧЕ ОстаткиПоЯчейкам.Номенклатура.ЕдиницаИзмеренияМест.итКоличествоНаПаллете
		|	КОНЕЦ) КАК Поле1,
		|	ОстаткиПоЯчейкам.Ячейка.КоличествоПалет
		|ИЗ
		|	ОстаткиПоЯчейкам КАК ОстаткиПоЯчейкам
		|ГДЕ
		|	ОстаткиПоЯчейкам.Ячейка.ВидСкладскойДеятельности = ЗНАЧЕНИЕ(Перечисление.ит_WMS_ВидыСкладскойДеятельности.Розничная)
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПоЯчейкам.Ячейка,
		|	ОстаткиПоЯчейкам.Ячейка.КоличествоПалет
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПаллетОстаткиПоЯчейкам.Ячейка,
		|	ПаллетОстаткиПоЯчейкам.КоличествоПаллет,
		|	ПаллетОстаткиПоЯчейкам.МаксКоличествоПалет
		|ИЗ
		|	ПаллетОстаткиПоЯчейкам КАК ПаллетОстаткиПоЯчейкам
		|ГДЕ
		|	ПаллетОстаткиПоЯчейкам.МаксКоличествоПалет < ПаллетОстаткиПоЯчейкам.КоличествоПаллет";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период",новый Граница(новый МоментВремени(Дата,Ссылка ),ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("в ячейке "+Строка(ВыборкаДетальныеЗаписи.Ячейка)+" превышен лими на "+Строка(ВыборкаДетальныеЗаписи.КоличествоПаллет-ВыборкаДетальныеЗаписи.МаксКоличествоПалет));
		Отказ=Истина;
	КонецЦикла;
	

	
	КонецПроцедуры
	

	
	
#Область Печать
Процедура ПечатьЭтикетокЯчеекНаПаллеты(ТабличныйДокумент,СсылкаНаДокумент)Экспорт 
	ТабличныйДокумент=новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб=Истина;
	ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итWMSРучноеРазмещениеТовары.ЯчейкаПолучатель
	|ИЗ
	|	Документ.итWMSРучноеРазмещение.Товары КАК итWMSРучноеРазмещениеТовары
	|ГДЕ
	|	итWMSРучноеРазмещениеТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	итWMSРучноеРазмещениеТовары.ЯчейкаПолучатель";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Макет=ПолучитьМакет("ЭтикеткиЯчеекНаПаллеты");	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.Ячейка=ВыборкаДетальныеЗаписи.ЯчейкаПолучатель;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры
Процедура ПечатьМакетВсеНаОдномЛисте(ТабличныйДокумент,СсылкаНаДокумент) Экспорт 
	ТабличныйДокумент=новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб=Истина;
	ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Макет=ПолучитьМакет("МакетВсеНаОдномЛисте");
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата = СсылкаНаДокумент.Дата;
	ОбластьШапка.Параметры.Номер= СсылкаНаДокумент.Номер;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итWMSРучноеРазмещениеТовары.ИдентификаторУпаковки,
	|	итWMSРучноеРазмещениеТовары.Номенклатура КАК Наименование,
	|	итWMSРучноеРазмещениеТовары.ДатаРозлива КАК Дата,
	|	СУММА(итWMSРучноеРазмещениеТовары.Количество) КАК Количество,
	|	итWMSРучноеРазмещениеТовары.ЯчейкаПолучатель КАК Ячейка
	|ИЗ
	|	Документ.итWMSРучноеРазмещение.Товары КАК итWMSРучноеРазмещениеТовары
	|ГДЕ
	|	итWMSРучноеРазмещениеТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	итWMSРучноеРазмещениеТовары.ИдентификаторУпаковки,
	|	итWMSРучноеРазмещениеТовары.Номенклатура,
	|	итWMSРучноеРазмещениеТовары.ДатаРозлива,
	|	итWMSРучноеРазмещениеТовары.ЯчейкаПолучатель";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	НомерСтроки=1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьСтрока.Параметры.НомерПП=НомерСтроки;
		ОбластьСтрока.Параметры.Дата =  Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=dd.MM.yyyy");
		НомерСтроки=НомерСтроки+1;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	ОбластьПодвал=Макет.ПолучитьОбласть("Подписи");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры
	#КонецОбласти

#Область ОбязательныеПроцедурыИФункции

//@skip-warning
Процедура ДействияПриОтказеОтИсполненияДокумента()Экспорт 
КонецПроцедуры

//@skip-warning
Процедура ДействияПриФиксацииЗадачДокумента() Экспорт 
КонецПроцедуры
#КонецОбласти