
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОтборИерархии") тогда
		ОтборПоИерархии=истина;
		ССылканаИерархию=Параметры.ОтборИерархии;
		//НовыйОтбор=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовыйОтбор.ЛевоеЗначение=новый ПолеКомпоновкиДанных("Ссылка");
		//НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии;
		//НовыйОтбор.ПравоеЗначение=Параметры.ОтборИерархии;
		//НовыйОтбор.Использование=Истина;
	иначе
		ОтборПоИерархии=Ложь;
		ССылканаИерархию=Справочники.итWMSСтратегии.ПустаяСсылка();
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоИерархии",ОтборПоИерархии);
    Список.Параметры.УстановитьЗначениеПараметра("Ссылка",ССылканаИерархию);
КонецПроцедуры
