#Область ОписаниеПеременных

// ПодключаемоеОборудование
Перем глПодключаемоеОборудование Экспорт; // Для кэширования на клиенте
// Конец ПодключаемоеОборудование

#КонецОбласти


Процедура ПриНачалеРаботыСистемы()
	НачатьПервоначальноеЗаполнениеСистемы();
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование
КонецПроцедуры

Процедура НачатьПервоначальноеЗаполнениеСистемы()
	Если итWMSПривилегированныйМодуль.ЭтоПервыйЗапуск() Тогда 
		итWMSПривилегированныйМодуль.УстановитьСтратегииWMS();
		итWMSПривилегированныйМодуль.УстановитьПризнакПервоначальногоЗаполнения();
	КонецЕсли;
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)
	Если итWMSСлужебныеПроцедурыИФункции.ПользовательЗаблокирован() Тогда 
		Отказ=Истина;
		Возврат;
	КонецЕсли;	
	#Если  ВебКлиент  Тогда
		Если не итWMSСлужебныеПроцедурыИФункции.ПользовательИспользуетДвойнуюАутентификацию() Тогда 
			Отказ=Истина;
			Возврат;
		КонецЕсли;	
	#КонецЕсли
	#Если  МобильныйКлиент  Тогда
		Если не итWMSСлужебныеПроцедурыИФункции.ПользовательИспользуетМобильныйДоступ() Тогда 
			Отказ=Истина;
			Возврат;
		КонецЕсли;
	#КонецЕсли
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередНачаломРаботыСистемы();
	// Конец ПодключаемоеОборудование
КонецПроцедуры

#Область ОбработчикиСобытий

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	// ПодключаемоеОборудование
	
	ОписаниеОшибки  = "";
	// Подготовить данные
	ОписаниеСобытия = Новый Структура();
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);
	// Передать на обработку данные.
	Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	Если Не Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='При обработке внешнего события от устройства произошла ошибка.'") + Символы.ПС + ОписаниеОшибки);
	КонецЕсли;
	
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти