
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
 ТекущийПользователь=Неопределено;
 ПользовательИБ=ПользователиИнформационнойБазы.ТекущийПользователь();
 Пользователь=итWMSПривилегированныйМодуль.НайтиПользователяВБазе(ПользовательИБ.УникальныйИдентификатор);
 Если Пользователь=Неопределено Тогда 
	НовыйПользователь=Справочники.Пользователи.СоздатьЭлемент(); 
	НовыйПользователь.ПользовательИБ=ПользовательИБ.УникальныйИдентификатор;
	Если ПользовательИБ.Имя="" Тогда 
	НовыйПользователь.Наименование="DefUser";
		иначе
	НовыйПользователь.Наименование=ПользовательИБ.Имя;
	КонецЕсли;
	НовыйПользователь.Записать();
	ТекущийПользователь=НовыйПользователь.Ссылка;
иначе
	Если Пользователь.Наименование<>ПользовательИБ.Имя и ПользовательИБ.Имя<>"" Тогда 
		ОбъектПользователя=Пользователь.ПолучитьОбъект();
		ОбъектПользователя.Наименование=ПользовательИБ.Имя;
		ОбъектПользователя.Записать();
	КонецЕсли;
	ТекущийПользователь=Пользователь.Ссылка;
 КонецЕсли;	
 ПараметрыСеанса.ТекущийПользователь=ТекущийПользователь;
// ПодключаемоеОборудование
МенеджерОборудованияВызовСервера.УстановкаПараметровСеанса(ТребуемыеПараметры);
// Конец ПодключаемоеОборудование

КонецПроцедуры
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#КонецЕсли