
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда
		
		//Если ТипСкладскойЯчейки <> Перечисления.ТипыСкладскихЯчеек.Хранение
		//		И ТипСкладскойЯчейки <> Перечисления.ТипыСкладскихЯчеек.Архив
		//	 Тогда
		//	
		//	ОбластьХранения 	= Справочники.ОбластиХранения.ПустаяСсылка();
		//	УровеньДоступности 	= 0;
		//	Типоразмер  		= Справочники.ТипоразмерыЯчеек.ПустаяСсылка();
		//	МаксимальныйКоэффициентНаполненностиПоВесу 		= 0;
		//	МаксимальныйКоэффициентНаполненностиПоОбъему    = 0;
		//	
		//
		//		ТипСкладскойЯчейки  = Перечисления.ТипыСкладскихЯчеек.ПустаяСсылка();
		//	
		//		РабочийУчасток  	                         = Справочники.РабочиеУчастки.ПустаяСсылка();
		//		ОбластьХранения                              = Справочники.ОбластиХранения.ПустаяСсылка();
		//		ПорядокОбхода 		                         = 0;
		//		УровеньДоступности                           = 0;
		//		МаксимальныйКоэффициентНаполненностиПоВесу   = 0;
		//		МаксимальныйКоэффициентНаполненностиПоОбъему = 0;
		//	
		//	
		//Иначе
		//	Если УровеньДоступности = 0 Тогда
		//	
		//		УровеньДоступности = 1;
		//		
		//	КонецЕсли;
			
			Если МаксимальныйКоэффициентНаполненностиПоВесу = 0 Тогда
				
				МаксимальныйКоэффициентНаполненностиПоВесу = 100;
				
			КонецЕсли;
			
			Если МаксимальныйКоэффициентНаполненностиПоОбъему = 0 Тогда
				
				МаксимальныйКоэффициентНаполненностиПоОбъему = 100;
				
			КонецЕсли;
			
		//КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

