
&НаКлиенте
Процедура ПолучитьИзКлассификатора(Команда)
	ОткрытьФорму("Справочник.КлассификаторСтранМира.Форма.ФормаПодбораИзКлассификатора",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы="Справочник.КлассификаторСтранМира.Форма.ФормаПодбораИзКлассификатора" Тогда
		Объект.Код=ВыбранноеЗначение.КодЧисловой;
		Объект.Наименование=ВыбранноеЗначение.НаименованиеКраткое;
		Объект.НаименованиеПолное= ВыбранноеЗначение.НаименованиеПолное;
		Объект.КодАльфа2=ВыбранноеЗначение.КодАльфа2;
	КонецЕсли;
КонецПроцедуры
