
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СписокИдентификаторУпаковки") тогда
		Если Параметры.СписокИдентификаторУпаковки.Количество()>0 тогда
			для Каждого стр из  Параметры.СписокИдентификаторУпаковки цикл
				Список.Добавить(стр);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Организация=Параметры.Организация;
	Ответственный=Параметры.Ответственный;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	ОповеститьОВыборе(Элемент.ТекущиеДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьНовыйSSCC(Команда)
Филиал=Неопределено;
ПолучитьФилиал(Филиал);
Если Филиал=Неопределено тогда
	Возврат
КонецЕсли;	
SSCC=итWMSОбработчикSSCC.ПолучитьНовыеSSCC(Филиал, ,Ответственный.ФизическоеЛицо);
ОповеститьОВыборе(SSCC);
КонецПроцедуры
&НаСервере
Процедура ПолучитьФилиал(Филиал)
    //////////// Получение данных настроек wms
	НастройкиWMS=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилищаПоСвойствам("СоответствиеФилиаловИорганизация");
	Если итWMSСлужебныеПроцедурыИФункции.ТиповойОбработчикВыявленияОшибок(НастройкиWMS) Тогда
		итWMSСлужебныеПроцедурыИФункции.WMSОповещениеОТиповыхОшибках(НастройкиWMS);
		Возврат;
	КонецЕсли;
	//////////////////////////////////
	Строка=НастройкиWMS.СоответствиеФилиаловИорганизация.Найти(Организация);
	Если Строка=Неопределено Тогда
		 Возврат;
	КонецЕсли;
	Филиал=Строка.Филиал;
	КонецПроцедуры
&НаКлиенте
Процедура ВыбратьДанные(Команда)
	ОповеститьОВыборе(ТекущийЭлемент.ТекущиеДанные.Значение);
КонецПроцедуры
