
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.ЯчейкаОтправитель=Запись.ЯчейкаПолучатель Тогда 
		Отказ=Истина;
		Сообщить("Ячейка не может быть отправителем и получаетелм одновременно");
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		Если ДублироватьСвязь Тогда
		МенеджерЗаписи=РегистрыСведений.ит_WMS_СвязиЯчеек.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЯчейкаОтправитель=Запись.ЯчейкаПолучатель;
		МенеджерЗаписи.ЯчейкаПолучатель=Запись.ЯчейкаОтправитель;
		МенеджерЗаписи.СтоимостьПерехода=Запись.СтоимостьПерехода;
		МенеджерЗаписи.Записать();
		КонецЕсли;
КонецПроцедуры

