


&НаСервере
Процедура УстановитьДанныеФормыПоСрезуПоследних()
	Запрос=ЗадатьЗапросНаСрезПоследних();
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		Роль=ВыборкаДетальныеЗаписи.Роль;
		ТерриторияСклада=ВыборкаДетальныеЗаписи.ТерриторияСклада;
		ПринтерПоУмолчанию=ВыборкаДетальныеЗаписи.ПринтерПоУмолчанию;
	КонецЕсли;	
ДолжностиСотрудника();
	
КонецПроцедуры
&НаСервере
Процедура  ДолжностиСотрудника()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыеИзмененияРаботниковСкладаСрезПоследних.Организация КАК Организация,
		|	КадровыеИзмененияРаботниковСкладаСрезПоследних.Должность КАК Должность,
		|	КадровыеИзмененияРаботниковСкладаСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.КадровыеИзмененияРаботниковСклада.СрезПоследних КАК КадровыеИзмененияРаботниковСкладаСрезПоследних
		|ГДЕ
		|	КадровыеИзмененияРаботниковСкладаСрезПоследних.РаботникСклада = &РаботникСклада
		|	И КадровыеИзмененияРаботниковСкладаСрезПоследних.ПризнакАктивности";
	
	Запрос.УстановитьПараметр("РаботникСклада", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ДолжностиСотрудника.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока=ДолжностиСотрудника.Добавить();
		НоваяСтрока.ДатаУстановки=ВыборкаДетальныеЗаписи.Период;
		НоваяСтрока.Должность=ВыборкаДетальныеЗаписи.Должность;
		НоваяСтрока.Организация=ВыборкаДетальныеЗаписи.Организация;
	КонецЦикла;
	

	
	
	КонецПроцедуры
&НаСервере
Функция ЗадатьЗапросНаСрезПоследних()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	итWMSПараметрыРаботниковСкладаСрезПоследних.Роль,
		|	итWMSПараметрыРаботниковСкладаСрезПоследних.ТерриторияСклада,
		|	итWMSПараметрыРаботниковСкладаСрезПоследних.ПринтерПоУмолчанию
		|ИЗ
		|	РегистрСведений.итWMSПараметрыРаботниковСклада.СрезПоследних(&Дата, ) КАК итWMSПараметрыРаботниковСкладаСрезПоследних
		|ГДЕ
		|	итWMSПараметрыРаботниковСкладаСрезПоследних.РаботникСклада = &РаботникСклада";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("РаботникСклада", Объект.Ссылка);
	
	Возврат Запрос
	КонецФункции
&НаСервере
Процедура СделатьЗапись_В_РегистрСведений()
Если ПроверкаНаНеобходимостьЗаписи() тогда
НаборЗаписей= РегистрыСведений.итWMSПараметрыРаботниковСклада.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.РаботникСклада.Установить(Объект.Ссылка);
НаборЗаписей.Прочитать();
НоваяЗапись=НаборЗаписей.Добавить();
НоваяЗапись.Период=ТекущаяДата();
НоваяЗапись.РаботникСклада=Объект.Ссылка;
НоваяЗапись.Роль=Роль;
НоваяЗапись.ТерриторияСклада=ТерриторияСклада;
НоваяЗапись.ПринтерПоУмолчанию=ПринтерПоУмолчанию;
НаборЗаписей.Записать();
КонецЕсли;
КонецПроцедуры
&НаСервере
Функция  ПроверкаНаНеобходимостьЗаписи()
	Запрос=ЗадатьЗапросНаСрезПоследних();
	Результат=Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		Если Роль=ВыборкаДетальныеЗаписи.Роль и ТерриторияСклада=ВыборкаДетальныеЗаписи.ТерриторияСклада 
			и ПринтерПоУмолчанию=ВыборкаДетальныеЗаписи.ПринтерПоУмолчанию тогда
			Возврат ложь;
		иначе 
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	
	Возврат Истина;
КонецФункции
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
   УстановитьДанныеФормыПоСрезуПоследних();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
СделатьЗапись_В_РегистрСведений();	
КонецПроцедуры

&НаКлиенте
Процедура ПринтерПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.ИтWMSОборудование.Форма.ФормаВыбора",новый Структура("ГруппаОборудования",ПолучитьГруппуПринтеры()),Элемент);
КонецПроцедуры
&НаСервере
Функция ПолучитьГруппуПринтеры()
	Возврат Справочники.ИтWMSОборудование.Принтеры;
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Массив=новый Массив;
	Массив.Добавить(Объект.Ссылка);
	ТабличныйДокумент=новый ТабличныйДокумент;
	ПечатьНаСервере(ТабличныйДокумент, Массив);
	ТабличныйДокумент.Показать();
КонецПроцедуры


&НаСервере
Процедура ПечатьНаСервере(ТабличныйДокумент, Массив)
	Справочники.итWMSРаботникиСклада.ПечатьШкРаботниковСклада(Массив,ТабличныйДокумент);
КонецПроцедуры



