
Функция PostTwoFactorPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Тело = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF16);
	МассивСтрок1=итWMSСлужебныеПроцедурыИФункции.Split(Тело,";");
    Строка1=МассивСтрок1[0];
	Строка2=МассивСтрок1[1];
	МассивСтрокСКодом=итWMSСлужебныеПроцедурыИФункции.Split(Строка1,":");
    Код=МассивСтрокСКодом[1];
	МассивСтрокСПользователем=итWMSСлужебныеПроцедурыИФункции.Split(Строка2,":");
    Пользователь=Справочники.Пользователи.ПолучитьСсылку(новый УникальныйИдентификатор(МассивСтрокСПользователем[1]));
	АдресПочты=Пользователь.Email.АдресЭлектроннойПочты;
	Массив=новый Массив();
	Массив.Добавить(АдресПочты);
	ТелоПисьма="Код подтверждения "+Код;
	итWMSПривилегированныйМодуль.РазослатьПисьмаСистемнойПочтой(Массив,ТелоПисьма,"Код подтверждения WMS");
	Возврат Ответ;
КонецФункции
