
&НаКлиенте
Процедура ДопроведениеДокументовWMS(Команда)
	ОткрытьФорму("ОбщаяФорма.УнивирсальнаяФормаНастройкаЗапускаЗадания",новый Структура("ИмяПредопределенногоЗадания","ит_WMS_КонтрольПроведенностиДокументов"),ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УдалениеУстаревшихДанныхХранилищаWMS(Команда)
	ОткрытьФорму("ОбщаяФорма.УнивирсальнаяФормаНастройкаЗапускаЗадания",новый Структура("ИмяПредопределенногоЗадания","ит_WMS_УдалениеУстаревшихДанныхХранилища"),ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РазбокированиеЯчеекПослеИнвентаризации(Команда)
ОткрытьФорму("ОбщаяФорма.УнивирсальнаяФормаНастройкаЗапускаЗадания",новый Структура("ИмяПредопределенногоЗадания","итWMSРазблокировкаЯчеекПослеИнвентаризации"),ЭтаФорма);
КонецПроцедуры
