
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	КадровыеИзмененияРаботниковСклада=Движения.КадровыеИзмененияРаботниковСклада;
	КадровыеИзмененияРаботниковСклада.Записывать=Истина;
	Для Каждого стр из РаботникиСклада Цикл 
		НоваяСтрока=КадровыеИзмененияРаботниковСклада.Добавить();
		НоваяСтрока.Регистратор=Ссылка;
		НоваяСтрока.РаботникСклада=стр.Работник;
		НоваяСтрока.Должность=стр.Должность;
		НоваяСтрока.Организация=Организация;
		НоваяСтрока.Период=Дата;
		Если ВидКадровогоИзменения=Перечисления.ВидКадровогоИзменения.УстановитьНаДолжность Тогда 
			НоваяСтрока.ПризнакАктивности=Истина;
		иначе
			НоваяСтрока.ПризнакАктивности=Ложь;
		КонецЕсли;	
	КонецЦикла;
	КадровыеИзмененияРаботниковСклада.Записать();
КонецПроцедуры



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если не	ПроверитьЗаполнение()  Тогда 
		Отказ=Истина;
	КонецЕсли;	

КонецПроцедуры

