
Процедура ПередЗаписью(Отказ)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алкПунктыРазгрузки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.алкПунктыРазгрузки КАК алкПунктыРазгрузки
		|ГДЕ
		|	алкПунктыРазгрузки.Владелец = &Владелец
		|	И алкПунктыРазгрузки.Ссылка <> &Ссылка
		|	И алкПунктыРазгрузки.Основной";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если не ОбменДанными.Загрузка Тогда 
		Отказ=Истина;
		КонецЕсли;
		Сообщить("У организации уже есть основной пункт разгрузки");
	КонецЦикла;
	
	

КонецПроцедуры
