

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка=Ложь;
СтруктураЗначенияВыбора=новый Структура;
СтруктураЗначенияВыбора.Вставить("Ссылка",ТекущийЭлемент.ТекущиеДанные.Ссылка);
СтруктураЗначенияВыбора.Вставить("ЗаполнятьПоЯрусам",ЗаполнятьПоЯрусам);
СтруктураЗначенияВыбора.Вставить("ЯрусЗаполнения",ЯрусЗаполнения);
СтруктураЗначенияВыбора.Вставить("ИгнорироватьЗаблокированные",ИгнорироватьЗаблокированные);
ОповеститьОВыборе(СтруктураЗначенияВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьПоЯрусамПриИзменении(Элемент)
	Элементы.ЯрусЗаполнения.ТолькоПросмотр= не ЗаполнятьПоЯрусам;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если ТекущийЭлемент.Имя="Список" Тогда 
	СписокВыбор(ТекущийЭлемент, "", "", Ложь);
	КонецЕсли;
КонецПроцедуры
