

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Объект.НастройкиПоУмолчанию.Количество()<>6 Тогда
		Объект.НастройкиПоУмолчанию.Очистить(); 
		ДобавитьЭлементыНастроек();
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыНастроек()
НоваяСтрока=Объект.НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Вид складской деятельности";
НоваяСтрока=Объект.НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Стратегия размещения";
НоваяСтрока=Объект.НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Стратегия перемещения";
НоваяСтрока=Объект.НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Стратегия поиска ячейки пикинга";
НоваяСтрока=Объект.НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Стратегия наборки при создании на основании";
НоваяСтрока=Объект.НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Стратегия наборки при создании на основании (Розница)";
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчаниюПриАктивизацииСтроки(Элемент)
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Вид складской деятельности" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("ПеречислениеСсылка.ит_WMS_ВидыСкладскойДеятельности", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Стратегия размещения" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.итWMSСтратегии", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Стратегия перемещения" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.итWMSСтратегии", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Стратегия поиска ячейки пикинга" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.итWMSСтратегии", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Стратегия наборки при создании на основании" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.итWMSСтратегии", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Стратегия наборки при создании на основании (Розница)" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.итWMSСтратегии", , , , , , );
	КонецЕсли;
КонецПроцедуры
