
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь=ПараметрыСеанса.ТекущийПользователь;
	ЗагрузитьНастройкиПользователяПоУмолчанию();
	Если НастройкиПоУмолчанию.Количество()<>7 Тогда
		НастройкиПоУмолчанию.Очистить(); 
		ДобавитьЭлементыНастроек();
	КонецЕсли;
КонецПроцедуры

&НаСервере		
Процедура ДобавитьЭлементыНастроек()
НоваяСтрока=НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Организация";
НоваяСтрока=НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Вид складской деятельности";
НоваяСтрока=НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Стратегия размещения";
НоваяСтрока=НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Стратегия перемещения";
НоваяСтрока=НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Стратегия поиска ячейки пикинга";
НоваяСтрока=НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Стратегия наборки при создании на основании";
НоваяСтрока=НастройкиПоУмолчанию.Добавить();	
НоваяСтрока.ЭлементНастройки="Стратегия наборки при создании на основании (Розница)";
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	итWMSПривилегированныйМодуль.ИзменитьНастройкиПользователяПоУмолчанию(Пользователь,НастройкиПоУмолчанию.Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиПользователяПоУмолчанию()
НастройкиПоУмолчанию.Загрузить(Пользователь.НастройкиПоУмолчанию.Выгрузить());	
КонецПроцедуры


&НаКлиенте
Процедура НастройкиПоУмолчаниюПриАктивизацииСтроки(Элемент)
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Организация" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.Организации", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Вид складской деятельности" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("ПеречислениеСсылка.ит_WMS_ВидыСкладскойДеятельности", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Стратегия размещения" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.итWMSСтратегии", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Стратегия перемещения" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.итWMSСтратегии", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Стратегия поиска ячейки пикинга" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.итWMSСтратегии", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Стратегия наборки при создании на основании" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.итWMSСтратегии", , , , , , );
	КонецЕсли;
	Если Элементы.НастройкиПоУмолчанию.ТекущиеДанные.ЭлементНастройки="Стратегия наборки при создании на основании (Розница)" Тогда
		  Элементы.НастройкиПоУмолчаниюЗначение.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.итWMSСтратегии", , , , , , );
	КонецЕсли;
КонецПроцедуры
