


&НаСервере
Процедура СтатусРегламетногоЗадания()
	Задание=РегламентныеЗадания.НайтиПредопределенное(Параметры.ИмяПредопределенногоЗадания);
	Если Задание.Использование Тогда 
		Элементы.ХелперСтатусаРаботыЗадания.Заголовок="Регламетное задание запущено";
		Элементы.ХелперСтатусаРаботыЗадания.ЦветТекста=WebЦвета.Зеленый;
	иначе
		Элементы.ХелперСтатусаРаботыЗадания.Заголовок="Регламетное задание выключено";
		Элементы.ХелперСтатусаРаботыЗадания.ЦветТекста=WebЦвета.Красный;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ИмяМетаданныхЗадания.Заголовок=Параметры.ИмяПредопределенногоЗадания;
	СтатусРегламетногоЗадания();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьНаСервере()
Задание=РегламентныеЗадания.НайтиПредопределенное(Параметры.ИмяПредопределенногоЗадания);
Задание.Использование=Истина;
Задание.Записать();
СтатусРегламетногоЗадания();
КонецПроцедуры

&НаКлиенте
Процедура Запустить(Команда)
	ЗапуститьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОстановитьНаСервере()
	Задание=РегламентныеЗадания.НайтиПредопределенное(Параметры.ИмяПредопределенногоЗадания);
	Задание.Использование=Ложь;
	Задание.Записать();
	СтатусРегламетногоЗадания();
КонецПроцедуры
&НаКлиенте
Процедура Остановить(Команда)
	ОстановитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовоеРасписание(Расписание,Параметры) Экспорт 
	Если Расписание=Неопределено Тогда 
		Возврат
	КонецЕсли;	
	УстановитьНовоеРасписаниеНаСервере(Расписание);
КонецПроцедуры

&НаСервере
Процедура УстановитьНовоеРасписаниеНаСервере(Расписание)
	Задание=РегламентныеЗадания.НайтиПредопределенное(Параметры.ИмяПредопределенногоЗадания);
    Задание.Расписание=Расписание;
    Задание.Записать();
	Периодичность=Задание.Расписание.ПериодПовтораВТечениеДня;
	КонецПроцедуры

&НаКлиенте
Процедура ФормаРаписания(Команда)
    Расписание=РаписаниеРегламетногоЗадания();
	ДиалогРаписания=новый  ДиалогРасписанияРегламентногоЗадания(Расписание);
	Оповещение=новый ОписаниеОповещения("УстановитьНовоеРасписание",ЭтаФорма);
	ДиалогРаписания.Показать(Оповещение);
КонецПроцедуры

&НаСервере
Функция РаписаниеРегламетногоЗадания()
	Задание=РегламентныеЗадания.НайтиПредопределенное(Параметры.ИмяПредопределенногоЗадания);
	Возврат Задание.Расписание
	КонецФункции
