
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала");
	ЗначениеПараметра.Значение = ДатаНачала;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОкончания");
	ЗначениеПараметра.Значение = ДатаОкончания;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьКороба");
	ЗначениеПараметра.Значение = СтоимостьКороба;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьКоробаПМУ");
	ЗначениеПараметра.Значение = СтоимостьКоробаПМУ;
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьЯчейки");
	ЗначениеПараметра.Значение = СтоимостьЯчейки;
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьЯчейкиРозницаНаборка");
	ЗначениеПараметра.Значение = СтоимостьЯчейкиРозницаНаборка;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьБутылкиНаборка");
	ЗначениеПараметра.Значение = СтоимостьБутылкиНаборка;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьБутылкиПМУНаборка");
	ЗначениеПараметра.Значение = СтоимостьБутылкиПМУНаборка;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьНаборки");
	ЗначениеПараметра.Значение = СтоимостьНаборки;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьНаборкиРозница");
	ЗначениеПараметра.Значение = СтоимостьНаборкиРозница;
	ЗначениеПараметра.Использование = Истина;

КонецПроцедуры
