
&НаКлиенте
Процедура ТоварыВЯчейках(Команда)
	ОткрытьФорму("Отчет.ит_WMS_ТоварыВЯчейках.ФормаОбъекта",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВЯчейкахСРегистратором(Команда)
	ОткрытьФорму("Отчет.ит_WMS_ТоварыВЯчейкахПоРегистратору.ФормаОбъекта",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВЯчейкахРезервПоРегистратору(Команда)
	ОткрытьФорму("Отчет.ит_WMS_ТоварыВЯчейкахРезервирование.ФормаОбъекта",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВЯчейкахПоИдентификатору(Команда)
	ОткрытьФорму("Отчет.ит_WMS_ТоварыВЯчейкахПоИдентификатору.ФормаОбъекта",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоАссортиметномуУчастку(Команда)
	ОткрытьФорму("Отчет.ит_WMS_НоменклатураПоАссортиментнымУчасткам.ФормаОбъекта",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоШтрихКоду(Команда)
	ОткрытьФорму("Отчет.ит_WMS_НоменклатураПоШк.ФормаОбъекта",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентСвободногоОстаткаПоЯчейкам(Команда)
	ОткрытьФорму("Отчет.ит_WMS_СвободныйКоэффициентЯчейкиПоАссортиментнымУчасткам.ФормаОбъекта",,ЭтаФорма);
КонецПроцедуры
