
&НаКлиенте
Процедура ЛинияПриИзменении(Элемент)
	ЭлементГруппыАдресацияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура СекцияПриИзменении(Элемент)
	ЭлементГруппыАдресацияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура СтеллажПриИзменении(Элемент)
	ЭлементГруппыАдресацияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ЯрусПриИзменении(Элемент)
ЭлементГруппыАдресацияПриИзменении();
КонецПроцедуры
&НаКлиенте
Процедура ЭлементГруппыАдресацияПриИзменении() Экспорт 
	
	Если не Объект.СкладскоеПомещение.Пустая()Тогда
		_Адрес = Объект.СкладскоеПомещение.Префикс;
	Иначе
		_Адрес = "";
	КонецЕсли;
	
	Если СОКРЛП(Объект.Линия)<>"" Тогда
		_Адрес = _Адрес+"-"+СОКРЛП(Объект.Линия);
	КонецЕсли;	
	
	Если СОКРЛП(Объект.Секция)<>"" Тогда
		_Адрес = _Адрес+"-"+СОКРЛП(Объект.Секция);
	КонецЕсли;	
	
	Если СОКРЛП(Объект.Стеллаж)<>"" Тогда
		_Адрес = _Адрес+"-"+СОКРЛП(Объект.Стеллаж);
	КонецЕсли;	

	Если СОКРЛП(Объект.Ярус)<>"" Тогда
		_Адрес = _Адрес+"-"+СОКРЛП(Объект.Ярус); 
	КонецЕсли;	

	Объект.Наименование = _Адрес;
	
КонецПроцедуры	
