
&НаСервере
Процедура СохранитьНаСервере()
	СтруктураХраненияДанных=новый Структура;
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("КомпьютерВхода",КомпьютерВхода);
	СтруктураДанных.Вставить("КомпьютерВыхода",КомпьютерВыхода);
	СтруктураХраненияДанных.Вставить("ОбработкаСканированияВходаВыхода",СтруктураДанных);
	итWMSПривилегированныйМодуль.СохранитьНастройкиВХранилище(СтруктураХраненияДанных);
		КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Данные=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилищаПоСвойствам("ОбработкаСканированияВходаВыхода");
	Если ТипЗнч(Данные)=Тип("Структура") Тогда 
		Если Данные.Свойство("ОбработкаСканированияВходаВыхода") Тогда 
			ЗаполнитьЗначенияСвойств(ЭтаФорма,Данные.ОбработкаСканированияВходаВыхода);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
