
&НаСервере
Процедура ЗапуститьНаСервере()
Задание=РегламентныеЗадания.НайтиПредопределенное("ит_WMS_УдаленияМарокДокументов");
Расписание=новый РасписаниеРегламентногоЗадания;
Расписание.ПериодПовтораВТечениеДня=Периодичность;
Расписание.ПериодПовтораДней=1;
Задание.Расписание=Расписание;
Задание.Использование=Истина;
Задание.Записать();
СтатусРегламетногоЗадания();

КонецПроцедуры

&НаКлиенте
Процедура Запустить(Команда)
	ЗапуститьНаСервере();
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОстановитьНаСервере()
	Задание=РегламентныеЗадания.НайтиПредопределенное("ит_WMS_УдаленияМарокДокументов");
	Задание.Использование=Ложь;
	Задание.Записать();
	СтатусРегламетногоЗадания();
КонецПроцедуры

&НаКлиенте
Процедура Остановить(Команда)
	ОстановитьНаСервере();
	СохранитьНаСервере();
КонецПроцедуры
&НаСервере
Процедура СтатусРегламетногоЗадания()
	Задание=РегламентныеЗадания.НайтиПредопределенное("ит_WMS_УдаленияМарокДокументов");
	Если Задание.Использование Тогда 
		Элементы.ХелперСтатусаРаботыЗадания.Заголовок="Регламетное задание запущено";
		Элементы.ХелперСтатусаРаботыЗадания.ЦветТекста=WebЦвета.Зеленый;
	иначе
		Элементы.ХелперСтатусаРаботыЗадания.Заголовок="Регламетное задание выключено";
		Элементы.ХелперСтатусаРаботыЗадания.ЦветТекста=WebЦвета.Красный;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоДнейХраненияМарокВБазе=30;
	Значение=ХранилищеОбщихНастроек.Загрузить("итWMSНастройкиУдаленияМарокДокумента","итWMSНастройкиУдаленияМарокДокумента",,"итWMSНастройкиУдаленияМарокДокумента");
	Если ТипЗнч(Значение)=Тип("Структура") тогда
		СписокРеквизитов=ПолучитьРеквизиты();
		для Каждого Рекв из СписокРеквизитов цикл
				
			Если Значение.Свойство(Рекв.Имя) тогда
				Если ТипЗнч(Значение[Рекв.Имя])=тип("ТаблицаЗначений") тогда
					ЭтаФорма[Рекв.Имя].Загрузить(Значение[Рекв.Имя]);
				иначе
					ЭтаФорма[Рекв.Имя]=Значение[Рекв.Имя];
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		//ЗаполнитьЗначенияСвойств(ЭтаФорма,Значение);
	КонецЕсли;	
	 СтатусРегламетногоЗадания();

КонецПроцедуры


&НаСервере
Процедура СохранитьНаСервере()
	СписокРеквизитов=ПолучитьРеквизиты();
	Значение=ХранилищеОбщихНастроек.Загрузить("итWMSНастройкиУдаленияМарокДокумента","итWMSНастройкиУдаленияМарокДокумента",,"итWMSНастройкиУдаленияМарокДокумента");
	Если  ТипЗнч(Значение)=Тип("Структура") Тогда 
		СтруктураХраненияДанных=Значение;
	иначе
		СтруктураХраненияДанных=новый Структура;
	КонецЕсли;
	для Каждого Рекв из СписокРеквизитов цикл
		Если Рекв.Имя="Объект" тогда
			Продолжить;
		КонецЕсли;	
		Если ТипЗнч(ЭтаФорма[Рекв.Имя])=Тип("ДанныеФормыКоллекция") тогда
			СтруктураХраненияДанных.Вставить(Рекв.Имя,ЭтаФорма[Рекв.Имя].Выгрузить());
		иначе
			СтруктураХраненияДанных.Вставить(Рекв.Имя,ЭтаФорма[Рекв.Имя]);
		КонецЕсли;
	КонецЦикла;
	ХранилищеОбщихНастроек.Сохранить("итWMSНастройкиУдаленияМарокДокумента","итWMSНастройкиУдаленияМарокДокумента",СтруктураХраненияДанных,,"итWMSНастройкиУдаленияМарокДокумента");
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейХраненияМарокВБазеПриИзменении(Элемент)
	Если КоличествоДнейХраненияМарокВБазе<30 Тогда 
		КоличествоДнейХраненияМарокВБазе=30;
	КонецЕсли;	
КонецПроцедуры
