

&НаКлиенте
Процедура БлокироватьЯчейкиПриИнвентаризацииПриИзменении(Элемент)
	Если НаборкКонстант.БлокироватьЯчейкиПриИнвентаризации Тогда 
		НаборкКонстант.ВремяРазблокировкиЯчеекПриИнвентаризации=1;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СтруктураХраненияДанных=новый Структура;
	СтруктураХраненияДанных.Вставить("CurrentDirectory",CurrentDirectory);
	СтруктураХраненияДанных.Вставить("CurrentDirectoryDll",CurrentDirectoryDll);
	СтруктураХраненияДанных.Вставить("ProcessorCapacity",ProcessorCapacity);

	итWMSПривилегированныйМодуль.СохранитьНастройкиВХранилище(СтруктураХраненияДанных);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СтруктураХраненияДанных=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилищаПоСвойствам("CurrentDirectory,CurrentDirectoryDll,ProcessorCapacity");
СтруктураХраненияДанных.Свойство("CurrentDirectory",CurrentDirectory); 
СтруктураХраненияДанных.Свойство("CurrentDirectoryDll",CurrentDirectoryDll);
СтруктураХраненияДанных.Свойство("ProcessorCapacity",ProcessorCapacity);
КонецПроцедуры


