
&НаСервере
Процедура ПодтянутьСоответсвияНаСервере()
	Выборка=ПланыОбмена.ОбменКА11.Выбрать();
Пока Выборка.Следующий() Цикл 
		Если Выборка.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		Если Выборка.Ссылка=ПланыОбмена.ОбменКА11.ЭтотУзел() Тогда 
			Продолжить;
		КонецЕсли;
		Если Выборка.РежимОтладки Тогда 
			Продолжить;
		КонецЕсли;	
		СсылкаВДругойИБ=итWMSСлужебныеПроцедурыИФункции.ПоискЭлементаСоответствияОбменаДругойИБ(Объект.Ссылка,Выборка.Ссылка);
		СтруктураОбменаДанными=новый Структура;
		СтруктураОбменаДанными.Вставить("УзелОбмена",Выборка.Ссылка.УникальныйИдентификатор());
		СтруктураОбменаДанными.Вставить("ТипОбработки","РегистрацияСоотвСправокАиБ");
		СтруктураОбменаДанными.Вставить("Серия",Объект.Ссылка.УникальныйИдентификатор());
		СтруктураОбменаДанными.Вставить("СсылкаВДругойИБ",СсылкаВДругойИБ);

		Определение=новый WSОпределения(итWMSСлужебныеПроцедурыИФункции.СформироватьСтрокуПодключенияПоУзлу(Выборка.Ссылка) ,"webserv","111");
		ПараметрыПрокиСервера=итWMSСлужебныеПроцедурыИФункции.СформироватьПараметрыПроксиСервераПоУзлу(Выборка.Ссылка);
        Прокси = новый WSПрокси(Определение,ПараметрыПрокиСервера.URLПространствоИменСервиса,ПараметрыПрокиСервера.ИмяСервиса,ПараметрыПрокиСервера.ИмяТочкиПодключения);
        Прокси.Пользователь="webserv";
        Прокси.Пароль="111";
        Данные=итWMSСлужебныеПроцедурыИФункции.СериализаторДанных(СтруктураОбменаДанными);
		Попытка
			Ответ=итWMSСлужебныеПроцедурыИФункции.ДесериализаторДанных(Прокси.ToGetDataOnline(Данные));
		Исключение
			ТекстОшибки=ОписаниеОшибки();
			Сообщить(ТекстОшибки);
		КонецПопытки;
		Если ТипЗнч(Ответ)<>Тип("Структура") Тогда 
			Сообщить("ошибка формата данных");
			Возврат;
		КонецЕсли;
		Если Ответ.Свойство("Статус") Тогда 
			Если Ответ.Статус=404 тогда
				Сообщить(Ответ.ОписаниеОшибки);
				Возврат;
			КонецЕсли;
		КонецЕсли;

КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура ПодтянутьСоответсвия(Команда)
	ПодтянутьСоответсвияНаСервере();
КонецПроцедуры
