
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Значение=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилищаПоСвойствам("ЯчейкиИсключенияАвтоматическогоРазмещения");
	Если ТипЗнч(Значение)=Тип("Структура") тогда
		Если Значение.Свойство("ЯчейкиИсключенияАвтоматическогоРазмещения")Тогда 
			ЯчейкиИсключенияАвтоматическогоРазмещения.Загрузить(Значение.ЯчейкиИсключенияАвтоматическогоРазмещения);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	СтруктураХраненияДанных=новый Структура;
	СтруктураХраненияДанных.Вставить("ЯчейкиИсключенияАвтоматическогоРазмещения",ЯчейкиИсключенияАвтоматическогоРазмещения.Выгрузить());
	итWMSПривилегированныйМодуль.СохранитьНастройкиВХранилище(СтруктураХраненияДанных);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
КонецПроцедуры
