
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ОбъектАнализа") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
	ОбъектАнализа=Параметры.ОбъектАнализа;
 ЗаполнитьДаннымиРасхождения();
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДаннымиРасхождения()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.Номенклатура КАК Номенклатура,
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.Характиристика КАК Характеристика,
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.СерияНоменклатуры.алкДатаНачалаРозлива КАК ДатаРозлива,
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.Количество КАК КоличествоПлан,
		|	NULL КАК КоличествоФакт
		|ПОМЕСТИТЬ ВтДанныеПроверки
		|ИЗ
		|	Документ.итWMSКонтрольнаяОперацияАгрегации.ДанныеДляАгрегацииДокумента КАК итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента
		|ГДЕ
		|	итWMSКонтрольнаяОперацияАгрегацииДанныеДляАгрегацииДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.Номенклатура,
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.Характеристика,
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.СерияНоменклатуры,
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.СерияНоменклатуры.алкДатаНачалаРозлива,
		|	NULL,
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.Количество
		|ИЗ
		|	Документ.итWMSКонтрольнаяОперацияАгрегации.Товары КАК итWMSКонтрольнаяОперацияАгрегацииТовары
		|ГДЕ
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтДанныеПроверки.Номенклатура,
		|	ВтДанныеПроверки.Характеристика,
		|	ВтДанныеПроверки.СерияНоменклатуры,
		|	ВтДанныеПроверки.ДатаРозлива,
		|	СУММА(ЕСТЬNULL(ВтДанныеПроверки.КоличествоПлан, 0)) КАК КоличествоПлан,
		|	СУММА(ЕСТЬNULL(ВтДанныеПроверки.КоличествоФакт, 0)) КАК КоличествоФакт
		|ПОМЕСТИТЬ ВтДанныеПроверкиГруппировка
		|ИЗ
		|	ВтДанныеПроверки КАК ВтДанныеПроверки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтДанныеПроверки.Номенклатура,
		|	ВтДанныеПроверки.СерияНоменклатуры,
		|	ВтДанныеПроверки.ДатаРозлива,
		|	ВтДанныеПроверки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтДанныеПроверкиГруппировка.Номенклатура,
		|	ВтДанныеПроверкиГруппировка.СерияНоменклатуры,
		|	ВтДанныеПроверкиГруппировка.ДатаРозлива,
		|	ВтДанныеПроверкиГруппировка.КоличествоПлан,
		|	ВтДанныеПроверкиГруппировка.КоличествоФакт
		|ИЗ
		|	ВтДанныеПроверкиГруппировка КАК ВтДанныеПроверкиГруппировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.ИдентификаторУпаковки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВтДанныеПроверкиГруппировка.Номенклатура КАК Номенклатура,
		|		ВтДанныеПроверкиГруппировка.Характеристика КАК Характеристика,
		|		ВтДанныеПроверкиГруппировка.СерияНоменклатуры КАК СерияНоменклатуры,
		|		ВтДанныеПроверкиГруппировка.ДатаРозлива КАК ДатаРозлива,
		|		ЕСТЬNULL(ВтДанныеПроверкиГруппировка.КоличествоПлан, 0) КАК КоличествоПлан,
		|		ЕСТЬNULL(ВтДанныеПроверкиГруппировка.КоличествоФакт, 0) КАК КоличествоФакт
		|	ИЗ
		|		ВтДанныеПроверкиГруппировка КАК ВтДанныеПроверкиГруппировка
		|	ГДЕ
		|		ВтДанныеПроверкиГруппировка.КоличествоПлан = 0
		|		И ВтДанныеПроверкиГруппировка.КоличествоФакт > 0) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.итWMSКонтрольнаяОперацияАгрегации.Товары КАК итWMSКонтрольнаяОперацияАгрегацииТовары
		|		ПО ВложенныйЗапрос.Номенклатура = итWMSКонтрольнаяОперацияАгрегацииТовары.Номенклатура
		|			И ВложенныйЗапрос.СерияНоменклатуры = итWMSКонтрольнаяОперацияАгрегацииТовары.СерияНоменклатуры
		|ГДЕ
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSКонтрольнаяОперацияАгрегацииТовары.ИдентификаторУпаковки";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектАнализа);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ДанныеРасхождения.Очистить();
	ДанныеРасхождения.Загрузить(МассивРезультатов[2].Выгрузить());
	
	ВыборкаИдентификаторов=МассивРезультатов[3].Выбрать();
	ПаллетыСРасхождениями.Очистить();
	пока ВыборкаИдентификаторов.Следующий() цикл
		ПаллетыСРасхождениями.Добавить(ВыборкаИдентификаторов.ИдентификаторУпаковки);
		КонецЦикла;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	КонецПроцедуры

&НаКлиенте
	Процедура ЗакрытьФорму(Команда)
		ЭтаФорма.Закрыть();
	КонецПроцедуры
