#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивНоменклатурыИсключения=новый Массив;
	Организация=Справочники.Организации.ПустаяСсылка();
	Если Параметры.Свойство("МассивНоменклатурыИсключения") Тогда 
		МассивНоменклатурыИсключения=Параметры.МассивНоменклатурыИсключения;
	КонецЕсли;	
	Если Параметры.Свойство("Организация") Тогда 
		Организация=Параметры.Организация;
	КонецЕсли;
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Организация",Организация);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("МассивНоменклатурыИсключения",МассивНоменклатурыИсключения);
	УстановитьНоменклатуруИсключенияПодбора();
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЭлементИерархии","");
	
КонецПроцедуры
&НаКлиенте
Процедура СписокНоменклатурыИерархическийПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокНоменклатурыИерархический.ТекущиеДанные=Неопределено Тогда
		СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЭлементИерархии","");
	иначе
		СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЭлементИерархии",Элементы.СписокНоменклатурыИерархический.ТекущиеДанные.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	для Каждого Строка из Элементы.СписокНоменклатуры.ВыделенныеСтроки цикл
		ДанныеСтроки=Элементы.СписокНоменклатуры.ДанныеСтроки(Строка);
		Корзина.Добавить().Номенклатура=ДанныеСтроки.Ссылка;
	КонецЦикла;
	УстановитьНоменклатуруИсключенияПодбора();
	Элементы.СписокНоменклатуры.ВыделенныеСтроки.Очистить();
КонецПроцедуры
&НаКлиенте
Процедура СписокНоменклатурыПослеУдаления(Элемент)
		УстановитьНоменклатуруИсключенияПодбора();
КонецПроцедуры

&НаКлиенте
Процедура КорзинаПослеУдаления(Элемент)
УстановитьНоменклатуруИсключенияПодбора();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд
&НаСервере
Функция  ЗавершитьВыборНаСервере()
	Возврат Корзина.Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыбор(Команда)
	ОповеститьОВыборе(ЗавершитьВыборНаСервере());
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьНоменклатуруИсключенияПодбора()
	МассивНоменклатурыВКорзине=Корзина.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("МассивНоменклатурыВКорзине",МассивНоменклатурыВКорзине);
КонецПроцедуры






#КонецОбласти
