// Процедура - Вызов кастомизации создания на основании
//
// Параметры:
//  Основание	 - Ссылка,объект -  основание создания
//  НовыйОбъект	 - объект - Создаваемый объект
//
Процедура ВызовКастомизацииСозданияНаОсновании(Основание,НовыйОбъект) Экспорт 
	ТаблицаКастомизации=Неопределено;
	Значение=итWMSПривилегированныйМодуль.ПолучитьДанныеКастомизацииСозданияНаОсновании(); 
	Если  ТипЗнч(Значение)=Тип("Структура") Тогда
		Если Значение.Свойство("ТаблицаКастомизации") Тогда 
			ТаблицаКастомизации=Значение.ТаблицаКастомизации;
		КонецЕсли;	
	КонецЕсли;
	Если ТаблицаКастомизации=Неопределено Тогда 
		Возврат
	КонецЕсли;
	ТипЗначенияОснования=Строка(ТипЗнч(Основание));
	ТипЗначенияНовогоОбъекта=Строка(ТипЗнч(НовыйОбъект));
	Для Каждого стр из ТаблицаКастомизации Цикл 
		Если стр.ТипОснования=ТипЗначенияОснования и стр.ТипНовогоОбъекта=ТипЗначенияНовогоОбъекта Тогда 
			Выполнить(стр.ВызываемаяФункцияПроцедура+"(Основание,НовыйОбъект)"); 
		КонецЕсли;
	КонецЦикла;
	
	КонецПроцедуры