
Процедура ПередЗаписью(Отказ)
Если не Ссылка.Пустая() и не ОбменДанными.Загрузка Тогда 
	ПроверкаНаНаличиеСвязей(Отказ);
КонецЕсли;
КонецПроцедуры

Процедура ПроверкаНаНаличиеСвязей(Отказ)
	Если  ИзменилсяСоставЯчеек() Тогда 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчасткаСрезПоследних.Номенклатура
		|ИЗ
		|	РегистрСведений.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка.СрезПоследних КАК ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчасткаСрезПоследних
		|ГДЕ
		|	ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчасткаСрезПоследних.АссортиментныйУчастокСклада = &АссортиментныйУчастокСклада";
	
	Запрос.УстановитьПараметр("АссортиментныйУчастокСклада", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Сообщить("Номенклатура "+ВыборкаДетальныеЗаписи.Номенклатура+" привязанна к данному участку , пожалуйста  отвяжите всю номенклатуру от текущего участка, а потом изменяйте его состав ");
	Отказ=Истина;
	КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры


Функция ИзменилсяСоставЯчеек() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставЯчеек.Ячейка
		|ПОМЕСТИТЬ ТекущийСоставЯчеек
		|ИЗ
		|	&СоставЯчеек КАК СоставЯчеек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек.Ячейка
		|ПОМЕСТИТЬ ВтПредыдущийСоставЯчеек
		|ИЗ
		|	Справочник.ит_WMS_АссортиментныеУчасткиСклада.СоставЯчеек КАК ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек
		|ГДЕ
		|	ит_WMS_АссортиментныеУчасткиСкладаСоставЯчеек.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущийСоставЯчеек.Ячейка,
		|	ВтПредыдущийСоставЯчеек.Ячейка КАК ЯчейкаПроверки
		|ПОМЕСТИТЬ ВтСравнение
		|ИЗ
		|	ТекущийСоставЯчеек КАК ТекущийСоставЯчеек
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПредыдущийСоставЯчеек КАК ВтПредыдущийСоставЯчеек
		|		ПО ТекущийСоставЯчеек.Ячейка = ВтПредыдущийСоставЯчеек.Ячейка
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВтПредыдущийСоставЯчеек.Ячейка ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВтПредыдущийСоставЯчеек.Ячейка,
		|	ТекущийСоставЯчеек.Ячейка
		|ИЗ
		|	ВтПредыдущийСоставЯчеек КАК ВтПредыдущийСоставЯчеек
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущийСоставЯчеек КАК ТекущийСоставЯчеек
		|		ПО ВтПредыдущийСоставЯчеек.Ячейка = ТекущийСоставЯчеек.Ячейка
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТекущийСоставЯчеек.Ячейка ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтСравнение.Ячейка
		|ИЗ
		|	ВтСравнение КАК ВтСравнение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтСравнение.Ячейка";
	
	Запрос.УстановитьПараметр("СоставЯчеек",СоставЯчеек);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	    Возврат Ложь;

	
	КонецФункции
