
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Значение=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилищаПоСвойствам("АдресаРассылокПоТипамЗадач");
	Если ТипЗнч(Значение)=Тип("Структура") тогда
		Если Значение.Свойство("АдресаРассылокПоТипамЗадач")Тогда 
			АдресаРассылокПоТипамЗадач.Загрузить(Значение.АдресаРассылокПоТипамЗадач);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	СтруктураХраненияДанных=новый Структура;
	СтруктураХраненияДанных.Вставить("АдресаРассылокПоТипамЗадач",АдресаРассылокПоТипамЗадач.Выгрузить());
	итWMSПривилегированныйМодуль.СохранитьНастройкиВХранилище(СтруктураХраненияДанных);
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СохранитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
 Элементы.АдремаРассылокПоТипамЗадачПричинаОповещения.СписокВыбора.Добавить("расхождение приёмки");
 Элементы.АдремаРассылокПоТипамЗадачПричинаОповещения.СписокВыбора.Добавить("ручное изменение статуса документа");
КонецПроцедуры

