
Процедура ПриЗаписи(Отказ)
	Если не Использовать Тогда
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Набор=РегистрыСведений.ИсполнениеПользовательскихРегламентныхЗаданий.СоздатьНаборЗаписей();
		Набор.Отбор.Задание.Установить(Ссылка);
		Набор.Прочитать();
		Для Каждого стр из Набор Цикл 
			стр.ПризнакУдаления=Истина;
		КонецЦикла;
		Набор.Записать();
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры
Процедура БлокировкаПоПользовательскомуЗаданию()
	БлокировкаДанных=новый БлокировкаДанных;
	ЭлементБлокировки=БлокировкаДанных.Добавить("РегистрСведений.ИсполнениеПользовательскихРегламентныхЗаданий");
	ЭлементБлокировки.Режим=РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Задание",Ссылка);
	БлокировкаДанных.Заблокировать();

	КонецПроцедуры
