
Функция GetDataShipmentGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON=итWMSПривилегированныйМодуль.ПолучитьДанныеОтгрузкиHTML();
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
КонецФункции

Функция GetDataShipmentNumberGET(Запрос)
	ГосНомер=Запрос.ПараметрыURL.Получить("number");
	СтрокаJSON=итWMSПривилегированныйМодуль.ПолучитьДанныеОтгрузкиПоНомеру(ГосНомер);
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
КонецФункции
