#Область ПрограммныйИнтерфейс

// Переопределяет открытие формы подбора товаров в обработке ПечатьЭтикетокИЦенников.
//
// Параметры:
//  ПараметрыОткрытия - Структура:
//   * ФормаВладелец - ФормаКлиентскогоПриложения - Форма владелец.
//   * ОбработчикЗакрытия - ОписаниеОповещения - оповещение о закрытии формы.
//   * РежимБлокировки - РежимОткрытияОкнаФормы - режим блокировки окна формы владельца.
//   * ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектБПО - торговый объект для определения свойств товаров.
//
Процедура ОткрытьФормуПодбора(ПараметрыОткрытия) Экспорт
	
	
	
КонецПроцедуры

// Переопределяет оповещение закрытие формы подбора и обработку результаты. Для работы обработки необходимо заполнить параметр МассивТоваровДляПечати.
//
// Параметры:
//  Результат - Структура - структура результата выполнения процедуры подбора товаров.
//  ПараметрыОперации - Структура - параметры выполнения процедуры подбора товаров.
//  МассивТоваровДляПечати - Массив Из см.ПечатьЭтикетокИЦенниковБПОКлиентСервер.ТоварДляПечати - массив товаров для заполнения.
//
Процедура ПодобратьТоварыЗавершение(Результат, ПараметрыОперации, МассивТоваровДляПечати) Экспорт
	
	
КонецПроцедуры

// Переопределяет оповещение закрытие формы поиска по штрихкоду и обработку результаты. Для работы обработки необходимо заполнить параметр МассивТоваровДляПечати.
//
// Параметры:
//  Результат - Структура - структура результата выполнения процедуры подбора товаров.
//  ПараметрыОперации - Структура - параметры выполнения процедуры подбора товаров.
//  МассивТоваровДляПечати - Массив Из см.ПечатьЭтикетокИЦенниковБПОКлиентСервер.ТоварДляПечати - массив товаров для заполнения.
//
Процедура ОповещениеПоискаПоШтрихкодуЭтикетокИЦенниковБПО(Результат, ПараметрыОперации, МассивТоваровДляПечати) Экспорт
	
	
КонецПроцедуры

// Параметры команды открытия.
// 
// Параметры:
//  ПараметрыФормы - Структура - Параметры формы
//
Процедура ПараметрыКомандыОткрытия(ПараметрыФормы) Экспорт
	
	
КонецПроцедуры

// Переопределяет выгрузку данных на ТСД
// 
// Параметры:
//  Объект - ФормаКлиентскогоПриложения - форма владелец.
//  ПараметрыФормы - Структура - Параметры формы.
//
Процедура ВыгрузитьВТСД(Объект, ПараметрыФормы) Экспорт
	
	
КонецПроцедуры

// Переопределяет загрузку данных на ТСД
// 
// Параметры:
//  Объект - ФормаКлиентскогоПриложения - форма владелец.
//  ПараметрыФормы - Структура - Параметры формы.
//  ОписаниеОповещения - ОписаниеОповещения - оповещение для окончания загрузки данных.
//
Процедура ЗагрузитьИзТСД(Объект, ПараметрыФормы, ОписаниеОповещения) Экспорт
	
	
КонецПроцедуры

// Переопределяет оповещение загрузки данных из ТСД. Для работы обработки необходимо заполнить параметр МассивТоваровДляПечати.
//
// Параметры:
//  Объект - Структура - структура результата выполнения процедуры подбора товаров.
//  ПараметрыФормы - Структура - параметры выполнения процедуры подбора товаров.
//  МассивТоваровДляПечати - Массив Из см.ПечатьЭтикетокИЦенниковБПОКлиентСервер.ТоварДляПечати - массив товаров для заполнения.
//
Процедура ОповещениеЗагрузкиИзТСДЭтикетокИЦенниковБПО(Объект, ПараметрыФормы, МассивТоваровДляПечати) Экспорт
	
	
КонецПроцедуры

// Параметры выгрузки и загрузки в ТСД.
// 
// Возвращаемое значение:
//  - Любое - будет передано в процедуру ВыгрузитьВТСД
Функция ПараметрыВыгрузкиИЗагрузкиВТСД() Экспорт
	
	
КонецФункции

#КонецОбласти