
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если не ПроверитьЗаполнение() Тогда 
		Отказ =Истина;
		Сообщить("не заполнены основные реквизиты");
		Возврат;
	КонецЕсли;	
ЗаписьМарок();
ЗаписьУпаковок();

КонецПроцедуры

Процедура ЗаписьУпаковок()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алкПереупаковкаУпаковки.ИерархияУпаковки КАК ИерархияУпаковки,
		|	алкПереупаковкаУпаковки.Упаковка КАК Упаковка
		|ИЗ
		|	Документ.алкПереупаковка.Упаковки КАК алкПереупаковкаУпаковки
		|ГДЕ
		|	алкПереупаковкаУпаковки.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алкПереупаковкаУпаковки.ИерархияУпаковки,
		|	алкПереупаковкаУпаковки.Упаковка
		|ИТОГИ ПО
		|	ИерархияУпаковки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИерархияУпаковки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НаборЗаписей=РегистрыСведений.алкХранилищеУпаковок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();

	Пока ВыборкаИерархияУпаковки.Следующий() Цикл
		НоваяЗапись=НаборЗаписей.Добавить();
		НоваяЗапись.Период=Дата;
		НоваяЗапись.Регистратор=Ссылка;
		НоваяЗапись.Упаковка=ВыборкаИерархияУпаковки.ИерархияУпаковки;
		
		ВыборкаДетальныеЗаписи = ВыборкаИерархияУпаковки.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяЗапись=НаборЗаписей.Добавить();
			НоваяЗапись.Период=Дата;
			НоваяЗапись.Регистратор=Ссылка;
			НоваяЗапись.Упаковка=ВыборкаДетальныеЗаписи.Упаковка;
			НоваяЗапись.ИерархияУпаковки=ВыборкаДетальныеЗаписи.ИерархияУпаковки;	
		КонецЦикла;
	КонецЦикла;
	НаборЗаписей.Записать();
	КонецПроцедуры

Процедура ЗаписьМарок()
	
	Перем НаборЗаписей, НоваяСтрока, стр;
	
	НаборЗаписей=РегистрыСведений.алкХранилищеАкцизныхМарок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	Для Каждого стр из АкцизныеМарки Цикл 
		НоваяСтрока=НаборЗаписей.Добавить();
		НоваяСтрока.Регистратор=Ссылка;
		НоваяСтрока.Период=Дата;
		НоваяСтрока.АлкогольнаяПродукция=стр.АлкогольнаяПродукция;
		НоваяСтрока.Марка=стр.Марка;
		НоваяСтрока.Организация=Организация;
		НоваяСтрока.ПунктРазгрузки=ПунктРазгрузки;
		НоваяСтрока.Упаковка=стр.Упаковка;
		НоваяСтрока.ОтметкаВыбытия=стр.ОтметкаВыбытия;
		НоваяСтрока.СправкаБ=стр.СправкаБ;
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

