
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторСтранМира.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
		|ГДЕ
		|	КлассификаторСтранМира.Код = &Код
		|	И КлассификаторСтранМира.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Код", Код);
	Если не Ссылка.Пустая() Тогда 
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	иначе
		Запрос.УстановитьПараметр("Ссылка", Неопределено);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ=Истина;
		Сообщить("Данный элемент уже добавлен в базу");
	КонецЦикла;
	
КонецПроцедуры
