
&НаКлиенте
Процедура ПривязатьДокументПоступления(Команда)
	Оповещение=новый ОписаниеОповещения("ПривязатьДокументПоступленияОповещение",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"После привзяки проведенного поступления товаров услуг к документу, документ перейдет к статусу принят. 
	|Вы уверенны, что хотите привязать документ поступления???",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьДокументПоступленияОповещение(Результат,Параметры) Экспорт 
	Если Результат=КодВозвратаДиалога.Нет Тогда 
		Возврат
	КонецЕсли;
	ОткрытьФорму("Документ.ит_WMS_ТоварыВПути.Форма.ФормаПривязкиПоступления",,ЭтаФорма);
	КонецПроцедуры
	
&НаКлиенте
Процедура Очистить(Команда)
Оповещение=новый ОписаниеОповещения("ОчиститьОповещение",ЭтаФорма);
ПоказатьВопрос(Оповещение,"Вы уверенны, что хотите отвязать документ поступления???",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОповещение(Результат,Параметры) Экспорт 
Если Результат=КодВозвратаДиалога.Нет Тогда 
	Возврат
КонецЕсли;
ОчиститьОтПоступленияНаСервере(Объект.ДокументПоступления);
Объект.ДокументПоступления=Неопределено;
КонецПроцедуры

Процедура ОчиститьОтПоступленияНаСервере(ПТУ)
	ОбъектИзменения=ПТУ.ПолучитьОбъект();
	ОбъектИзменения.ит_WMS_ГУИД_ДокументаТранизата=новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	ОбъектИзменения.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если  ИсточникВыбора.ИмяФормы="Документ.ит_WMS_ТоварыВПути.Форма.ФормаПривязкиПоступления" Тогда 
		ПривязатьПТУ(ВыбранноеЗначение);
		Объект.ДокументПоступления=ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ПривязатьПТУ(ПТУ)
ОбъектИзменения=ПТУ.ПолучитьОбъект();
ОбъектИзменения.ит_WMS_ГУИД_ДокументаТранизата=Объект.ГУИД_Входящего;
ОбъектИзменения.Записать();
	КонецПроцедуры


