
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Данные=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилища();
	Если ТипЗнч(Данные)<>тип("Структура") тогда
		Отказ=Истина;
		Сообщить("Нет натстроек WMS");
		Возврат
	КонецЕсли;
	Если Данные.Свойство("ПапкаВнешнихWMS_Обработок") тогда	
		СписокВнешнихОбработок.Параметры.УстановитьЗначениеПараметра("ПапкаВнешнихWMS_Обработок",Данные.ПапкаВнешнихWMS_Обработок);
		МассивРодителей= ПолучитьМассивРодителей(Данные.ПапкаВнешнихWMS_Обработок);
		СписокВнешнихОбработок.Параметры.УстановитьЗначениеПараметра("МассивРодителей",МассивРодителей);
	иначе
		СписокВнешнихОбработок.Параметры.УстановитьЗначениеПараметра("ПапкаВнешнихWMS_Обработок",Справочники.ВнешниеОбработки.ПустаяСсылка());
		МассивРодителей= ПолучитьМассивРодителей(Справочники.ВнешниеОбработки.ПустаяСсылка());
		СписокВнешнихОбработок.Параметры.УстановитьЗначениеПараметра("МассивРодителей",МассивРодителей);
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ПолучитьМассивРодителей(ПапкаВнешнихWMS_Обработок)
	ПапкаОбработки=ПапкаВнешнихWMS_Обработок;
	МассивРодителей= новый Массив;
	Пока ПапкаОбработки.Родитель<>Справочники.ВнешниеОбработки.ПустаяСсылка() цикл
		МассивРодителей.Добавить(ПапкаОбработки.Родитель);
		ПапкаОбработки=ПапкаОбработки.Родитель;
	КонецЦикла;
	Возврат МассивРодителей;
	КонецФункции

&НаСервере
Функция  СписокВнешнихОтчетовВыборНаСервере(ВыбраннаяСтрока)	
	ДвоичныеДанные = ВыбраннаяСтрока.ХранилищеВнешнейОбработки.Получить();
	Возврат ДвоичныеДанные;
	КонецФункции

&НаКлиенте
Процедура СписокВнешнихОтчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если не ВыбраннаяСтрока.ЭтоГруппа  Тогда
		СтандартнаяОбработка=Ложь;
		ДанныеОтчета=СписокВнешнихОтчетовВыборНаСервере(ВыбраннаяСтрока);
		ИмяФайла = ПолучитьИмяВременногоФайла();
		ДанныеОтчета.Записать(ИмяФайла);
		Обработка =ВнешниеОбработки.Создать(ИмяФайла);
		Форма=Обработка.ПолучитьФорму(); 
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры
