
&НаКлиенте
Процедура итТипоразмерыЯчеек(Команда)
	ОткрытьФорму("Справочник.итТипоразмерыЯчеек.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итСкладскиеЯчейки(Команда)
	ОткрытьФорму("Справочник.итСкладскиеЯчейки.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итСкладскиеПомещения(Команда)
	ОткрытьФорму("Справочник.итСкладскиеПомещения.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итТерриторииСкладов(Команда)
	ОткрытьФорму("Справочник.итТерриторииСкладов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSСправочникТСД(Команда)
	ОткрытьФорму("Справочник.итWMSСправочникТСД.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSРолиРаботниковСклада(Команда)
	ОткрытьФорму("Справочник.итWMSРолиРаботниковСклада.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSРаботникиСклада(Команда)
	ОткрытьФорму("Справочник.итWMSРаботникиСклада.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итФилиалыWMS(Команда)
	ОткрытьФорму("Справочник.итФилиалыWMS.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ИтWMSОборудование(Команда)
	ОткрытьФорму("Справочник.ИтWMSОборудование.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSПриемка(Команда)
	ОткрытьФорму("Документ.итWMSПриемка.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSРазмещение(Команда)
	ОткрытьФорму("Документ.итWMSРазмещение.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSПеремещение(Команда)
	ОткрытьФорму("Документ.итWMSПеремещение.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSДиспетчерТерминалов(Команда)
	ОткрытьФорму("Обработка.итWMSДиспетчерТерминалов.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура итWMSНастройки(Команда)
	ОткрытьФорму("Обработка.итWMSНастройки.Форма.WMSНастройки");
КонецПроцедуры

&НаКлиенте
Процедура итПечатьПроизвольногоШтрихкода(Команда)
	ОткрытьФорму("Обработка.итПечатьПроизвольногоШтрихкода.Форма.ФормаПечатьПроизвольногоШтрихКода");
КонецПроцедуры

&НаКлиенте
Процедура ИтЖурналДокументов(Команда)
	ОткрытьФорму("ЖурналДокументов.ИтWMSЖурналДокументов.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьGTIN_SSCC(Команда)
	ОткрытьФорму("Обработка.WMSРабочийСтол.Форма.ПечатьSSCCиGTIN");
КонецПроцедуры

&НаКлиенте
Процедура КонтрольнаяАгрегация(Команда)
	ОткрытьФорму("Документ.итWMSКонтрольнаяОперацияАгрегации.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СтатегииWMS(Команда)
	ОткрытьФорму("Справочник.итWMSСтратегии.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSНаборка(Команда)
	ОткрытьФорму("Документ.итWMSНаборка.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеОтчетыWMS(Команда)
	ОткрытьФорму("Обработка.WMSРабочийСтол.Форма.ВнешниеОтчетыWMS");
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеОбработкиWMS(Команда)
	ОткрытьФорму("Обработка.WMSРабочийСтол.Форма.ВнешниеОбработкиWMS");
КонецПроцедуры

&НаКлиенте
Процедура итWMSДанныеИнвентаризации(Команда)
	ОткрытьФорму("Документ.итWMSДанныеИнвентаризации.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSЗадачиИнвентаризации(Команда)
	ОткрытьФорму("Документ.итWMSЗадачиИнвентаризации.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSОтгрузка(Команда)
	ОткрытьФорму("Документ.итWMSОтгрузка.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSДокументСвободнойАгрегации(Команда)
	ОткрытьФорму("Документ.итWMSДокументСвободнойАгрегации.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итПричиныОтменыЗадач(Команда)
	ОткрытьФорму("Справочник.итWMS_ПричиныОтменыЗадач.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSИзменениеПараметровТовараВЯчейках(Команда)
	ОткрытьФорму("Документ.итWMSИзменениеПараметровТовараВЯчейках.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSСписаниеТовара(Команда)
	ОткрытьФорму("Документ.итWMSСписаниеТовара.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ДокументыРучногоУчета(Команда)
	ОткрытьФорму("Обработка.WMSРабочийСтол.Форма.ДокументыРучногоУчета");
КонецПроцедуры

&НаКлиенте
Процедура итWMSПроверка(Команда)
	ОткрытьФорму("Документ.итWMSПроверка.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ит_WMS_АссортиментныеУчасткиСклада(Команда)
	ОткрытьФорму("Справочник.ит_WMS_АссортиментныеУчасткиСклада.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка(Команда)
	ОткрытьФорму("Документ.ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ит_WMS_ТоварыВПути(Команда)
	ОткрытьФорму("Документ.ит_WMS_ТоварыВПути.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеремещенияРозницы(Команда)
	ОткрытьФорму("Обработка.ит_WMS_ОбработчикРозницы.Форма.Форма",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КонструкторФормированияЯчеек(Команда)
	ОткрытьФорму("Обработка.ит_WMS_КонструкторФормированияЯчеек.Форма.Форма",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеИМотивация(Команда)
	ОткрытьФорму("Обработка.WMSРабочийСтол.Форма.ОтчетыПланированиеИМотивации",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИОстатки(Команда)
	ОткрытьФорму("Обработка.WMSРабочийСтол.Форма.ОтчетыПоНоменклатуреИОстаткам",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Инвентаризация(Команда)
	ОткрытьФорму("Обработка.WMSРабочийСтол.Форма.ОтчетыПоИнвентаризации",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СервесныеОтчеты(Команда)
	ОткрытьФорму("Обработка.WMSРабочийСтол.Форма.СервисныеОтчеты",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КастомизацияСозданияНаОсновании(Команда)
	ОткрытьФорму("Обработка.ит_WMS_КастомизацияСозданияНаОсновании.Форма.Форма",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ит_WMS_РозничнаяНаборка(Команда)
	ОткрытьФорму("Документ.ит_WMS_РозничнаяНаборка.Форма.ФормаСписка",,ЭтаФорма);
КонецПроцедуры
