
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.итWMSПриемка") Тогда  
		ЗаполнитьНаОснованиПриемки(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		КонецЕсли;
	КонецПроцедуры
	
Процедура ЗаполнитьНаОснованиПриемки(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  
	СтандартнаяОбработка=Ложь;  
	
	Запрос = Новый Запрос;
	Запрос.Текст =ТекстЗапросаНаОснованииПриемки();
	Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
			
	РезультатЗапроса = Запрос.Выполнить();
	Склад=ДанныеЗаполнения.Склад;
	Организация=ДанныеЗаполнения.Организация;    
	Основание=ДанныеЗаполнения;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Товары.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НоваяСтрока=Товары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);		
	КонецЦикла;


КонецПроцедуры



Функция ТекстЗапросаНаОснованииПриемки()
	Текст="ВЫБРАТЬ
	      |	итWMSПриемкаТовары.СерияНоменклатуры КАК СерияНоменклатурыНовая,
	      |	итWMSПриемкаТовары.СтараяСерияНоменклатуры КАК СерияНоменклатурыСтарая,
	      |	СУММА(итWMSПриемкаТовары.КоличествоФакт) КАК Количество,
	      |	итWMSПриемкаТовары.Номенклатура КАК Номенклатура,
	      |	итWMSПриемкаТовары.Характеристика КАК Характеристика,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	      |	ВЫБОР
	      |		КОГДА итWMSПриемкаТовары.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
	      |			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.Новый)
	      |		ИНАЧЕ итWMSПриемкаТовары.Качество
	      |	КОНЕЦ КАК Качество,
	      |	итWMSПриемкаТовары.СправкаБ КАК СправкаБ,
	      |	итWMSПриемкаТовары.СправкаА КАК СправкаА
	      |ИЗ
	      |	Документ.итWMSПриемка.Товары КАК итWMSПриемкаТовары
	      |ГДЕ
	      |	итWMSПриемкаТовары.Ссылка = &Ссылка
	      |	И итWMSПриемкаТовары.СерияНоменклатуры <> итWMSПриемкаТовары.СтараяСерияНоменклатуры
	      |	И итWMSПриемкаТовары.СтараяСерияНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	      |
	      |СГРУППИРОВАТЬ ПО
	      |	итWMSПриемкаТовары.СерияНоменклатуры,
	      |	итWMSПриемкаТовары.СтараяСерияНоменклатуры,
	      |	итWMSПриемкаТовары.Номенклатура,
	      |	итWMSПриемкаТовары.Характеристика,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаИзмеренияМест,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаХраненияОстатков,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	      |	ВЫБОР
	      |		КОГДА итWMSПриемкаТовары.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
	      |			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.Новый)
	      |		ИНАЧЕ итWMSПриемкаТовары.Качество
	      |	КОНЕЦ,
	      |	итWMSПриемкаТовары.СправкаБ,
	      |	итWMSПриемкаТовары.СправкаА"; 
	
	Возврат Текст;

КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	Основание=Неопределено;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Для Каждого стр из Товары Цикл 
		Если не стр.СправкаА.Пустая() и не стр.СправкаБ.Пустая() Тогда     
			СтарыйНаборЗаписей=РегистрыСведений.алкСоответствияСправокАиБЕГАИСИСерий.СоздатьНаборЗаписей();
			СтарыйНаборЗаписей.Отбор.СправкаА.Установить(стр.СправкаА);
			СтарыйНаборЗаписей.Отбор.СправкаБ.Установить(стр.СправкаБ);
            СтарыйНаборЗаписей.Отбор.СерияНоменклатуры.Установить(стр.СерияНоменклатурыСтарая);
            СтарыйНаборЗаписей.Прочитать();
			СтарыйНаборЗаписей.Очистить();
			СтарыйНаборЗаписей.Записать();
			
			НовыйНаборЗаписей=РегистрыСведений.алкСоответствияСправокАиБЕГАИСИСерий.СоздатьНаборЗаписей();
			НовыйНаборЗаписей.Отбор.СправкаА.Установить(стр.СправкаА);
			НовыйНаборЗаписей.Отбор.СправкаБ.Установить(стр.СправкаБ); 
		    НовыйНаборЗаписей.Отбор.СерияНоменклатуры.Установить(стр.СерияНоменклатурыНовая);   
			НовыйНаборЗаписей.Прочитать();
			НовыйНаборЗаписей.Очистить();
			НовыйНаборЗаписей.Записать();
			НоваяСтрока=НовыйНаборЗаписей.Добавить();
			НоваяСтрока.СерияНоменклатуры=стр.СерияНоменклатурыНовая;
	        НоваяСтрока.СправкаА=стр.СправкаА;
			НоваяСтрока.СправкаБ=стр.СправкаБ;
            НовыйНаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры
