
&НаКлиенте
Процедура Подбор(Команда)
	СтруктураПараметров=новый Структура;
	СтруктураПараметров.Вставить("МассивЯчеекИсключения",МассивЯчеекИсключения());
	ОткрытьФорму("Справочник.ит_WMS_АссортиментныеУчасткиСклада.Форма.ФормаПодбораЯчеек",СтруктураПараметров,ЭтаФорма);
КонецПроцедуры

Функция  МассивЯчеекИсключения()
	Возврат Объект.СоставЯчеек.Выгрузить().ВыгрузитьКолонку("Ячейка");
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		Если  ИсточникВыбора.ИмяФормы="Справочник.ит_WMS_АссортиментныеУчасткиСклада.Форма.ФормаПодбораЯчеек" Тогда 
			Для Каждого стр из ВыбранноеЗначение.МассивЯчеек цикл
				НоваяСтрока=Объект.СоставЯчеек.Добавить();
				НоваяСтрока.Ячейка=стр;
				//НоваяСтрока.ВидСкладскойДеятельности=ВыбранноеЗначение.ВидСкладскойДеятельности;
				КонецЦикла;
			КонецЕсли;
КонецПроцедуры
	
	
