
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьСписокВыбораТипа();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокВыбораТипа()
Элементы.ОпределениеПараметровСтрагеииТипЗначения.СписокВыбора.Добавить("Строка");
Элементы.ОпределениеПараметровСтрагеииТипЗначения.СписокВыбора.Добавить("Число");
Элементы.ОпределениеПараметровСтрагеииТипЗначения.СписокВыбора.Добавить("Булево");
Элементы.ОпределениеПараметровСтрагеииТипЗначения.СписокВыбора.Добавить("Дата");
Элементы.ОпределениеПараметровСтрагеииТипЗначения.СписокВыбора.Добавить("СправочникСсылка.ит_WMS_АссортиментныеУчасткиСклада");
Элементы.ОпределениеПараметровСтрагеииТипЗначения.СписокВыбора.Добавить("ПеречислениеСсылка.ит_WMS_ВидыСкладскойДеятельности");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСтратегии(Команда)
	ОткрытьФорму("Справочник.итWMSСтратегии.Форма.ФормаНастроекСтратегий",новый Структура("Стратегия",Объект.Ссылка),ЭтаФорма);
КонецПроцедуры
