
&НаКлиенте
Процедура МотивационныйОтчет(Команда)
	ОткрытьФорму("Отчет.ит_WMS_МотивационныйОтчет.Форма.ФормаОтчета",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РеестрПополненияПикингаИСтока(Команда)
	ОткрытьФорму("Отчет.ит_WMS_РеестрПополнениеПикингаИСтока.ФормаОбъекта",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеПроверок(Команда)
	ОткрытьФорму("Отчет.ит_WMS_ПланированиеПроверок.Форма.ФормаОтчета",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеНаборок(Команда)
	ОткрытьФорму("Отчет.ит_WMS_ПланированиеНаборок.Форма.ФормаОтчета",,ЭтаФорма);
КонецПроцедуры
