
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если Параметры.Ключ.Пустая() Тогда
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.УстановитьОрганизациюВДокументе(Объект);
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПечатьМаршрутногоЛистаНаСервере(ТабличныйДокумент)
	Данные=РеквизитФормыВЗначение("Объект");
	Данные.ПечатьМаршрутногоЛиста(ТабличныйДокумент,Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьМаршрутногоЛиста(Команда)
	ТабличныйДокумент=новый ТабличныйДокумент;
	ПечатьМаршрутногоЛистаНаСервере(ТабличныйДокумент);
	ТабличныйДокумент.Показать();
КонецПроцедуры
