#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке(ВерсияБСП = "") Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид", "");
	ПараметрыРегистрации.Вставить("Версия", "0.0");
	ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование", Неопределено);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Информация", Неопределено);
	ПараметрыРегистрации.Вставить("ВерсияБСП", ВерсияБСП);
	ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	РеквизитыТабличнойЧасти = Метаданные.Справочники.ДополнительныеОтчетыИОбработки.ТабличныеЧасти.Команды.Реквизиты;
	
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление", РеквизитыТабличнойЧасти.Представление.Тип);
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", РеквизитыТабличнойЧасти.Идентификатор.Тип);
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", РеквизитыТабличнойЧасти.ПоказыватьОповещение.Тип);
	ТаблицаКоманд.Колонки.Добавить("Модификатор", РеквизитыТабличнойЧасти.Модификатор.Тип);
	ТаблицаКоманд.Колонки.Добавить("Скрыть",      РеквизитыТабличнойЧасти.Скрыть.Тип);
	ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды", РеквизитыТабличнойЧасти.ЗаменяемыеКоманды.Тип);
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	ПараметрыРегистрации.Вставить("Разрешения", Новый Массив);
	
	ПараметрыРегистрации.Вид		= "ДополнительнаяОбработка";
	ПараметрыРегистрации.Версия		= "1.0";
	ПараметрыРегистрации.Наименование	= "Настройки использования истории данных";
	ПараметрыРегистрации.БезопасныйРежим	= Истина;
	ПараметрыРегистрации.Информация			= "Настройки использования истории данных";
	ПараметрыРегистрации.ВерсияБСП			= "1.0.0.0";
	
	Команда	= ПараметрыРегистрации.Команды.Добавить();
	
	Команда.Представление	= "Настройки использования истории данных";
	Команда.Идентификатор	= "ОткрытиеФормы";
	Команда.Использование	= "ОткрытиеФормы";
	
	Возврат ПараметрыРегистрации;

КонецФункции

#КонецОбласти
