// Функция ПолучитьРасписаниеРегламентногоЗадания возвращает
// расписание регламентного задания по идентификатору
//
// Параметры:
//  Идентификатор - Строка уникального идентификатора РегламентногоЗадания
// 
// Возвращаемое значение:
//  РасписаниеРегламентногоЗадания
//
Функция ПолучитьРасписаниеРегламентногоЗадания(Знач Идентификатор) Экспорт
	
	Возврат итWMSОбщегоНазначенияКлиентСервер.СтруктураВРасписание(РегламентныеЗаданияСервер.ПолучитьРасписаниеРегламентногоЗаданияВСтруктуре(Идентификатор));
	
КонецФункции
// Функция УстановитьРасписаниеРегламентногоЗадания устанавливает
// расписание регламентного задания по идентификатору
//
// Параметры:
//  Идентификатор - Строка уникального идентификатора РегламентногоЗадания
//  Расписание    - РасписаниеРегламентногоЗадания
//
Процедура УстановитьРасписаниеРегламентногоЗадания(Знач Идентификатор, Знач Расписание) Экспорт
	
	РегламентныеЗаданияСервер.УстановитьРасписаниеРегламентногоЗаданияИзСтруктуры(Идентификатор, итWMSОбщегоНазначенияКлиентСервер.РасписаниеВСтруктуру(Расписание));
	
КонецПроцедуры
