
&НаСервере
Процедура СохранитьНаСервере()
	ХранилищеОбщихНастроек.Сохранить("ит_WMS_КастомизацияСозданияНаОсновании","ит_WMS_КастомизацияСозданияНаОсновании",новый Структура("ТаблицаКастомизации",ТаблицаКастомизации.Выгрузить()),,"ит_WMS_КастомизацияСозданияНаОсновании");
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Значение= ХранилищеОбщихНастроек.Загрузить("ит_WMS_КастомизацияСозданияНаОсновании","ит_WMS_КастомизацияСозданияНаОсновании",,"ит_WMS_КастомизацияСозданияНаОсновании");
	Если  ТипЗнч(Значение)=Тип("Структура") Тогда
		Если Значение.Свойство("ТаблицаКастомизации") Тогда 
			ТаблицаКастомизации.Загрузить(Значение.ТаблицаКастомизации);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
