
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	    //Программно формируем отчет
    //Отменяем стандартную обработку
    СтандартнаяОбработка = Ложь;
    //Получаем схему
    Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    
    //...и настройки
    Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    
    //Создаем компоновщик макета и получаем макет компоновки
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
    //<--------------------------------------------------------------------------------------->//
     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSДанныеИнвентаризации.Ячейка,
		|	МАКСИМУМ(итWMSДанныеИнвентаризации.ДатаИнвентаризации) КАК ДатаИнвентаризации
		|ПОМЕСТИТЬ ВтПоследняяИнвентаризацияЯчейки
		|ИЗ
		|	РегистрСведений.итWMSДанныеИнвентаризации КАК итWMSДанныеИнвентаризации
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSДанныеИнвентаризации.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSДанныеИнвентаризации.Ячейка,
		|	итWMSДанныеИнвентаризации.ДатаИнвентаризации,
		|	МАКСИМУМ(итWMSДанныеИнвентаризации.ДокументОбработки) КАК ДокументОбработки,
		|	МАКСИМУМ(итWMSДанныеИнвентаризации.ТСД) КАК ТСД
		|ПОМЕСТИТЬ ДанныеПоОследнейИнвентаризацииЯчейки
		|ИЗ
		|	ВтПоследняяИнвентаризацияЯчейки КАК ВтПоследняяИнвентаризацияЯчейки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSДанныеИнвентаризации КАК итWMSДанныеИнвентаризации
		|		ПО ВтПоследняяИнвентаризацияЯчейки.Ячейка = итWMSДанныеИнвентаризации.Ячейка
		|			И ВтПоследняяИнвентаризацияЯчейки.ДатаИнвентаризации = итWMSДанныеИнвентаризации.ДатаИнвентаризации
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSДанныеИнвентаризации.Ячейка,
		|	итWMSДанныеИнвентаризации.ДатаИнвентаризации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ячейка,
		|	ВложенныйЗапрос.ДатаИнвентаризации,
		|	ВложенныйЗапрос.ДатаСосотояниТСД,
		|	ВложенныйЗапрос.ДокументОбработки,
		|	ВложенныйЗапрос.ДокументОбработки.Ответственный,
		|	МАКСИМУМ(итWMSСостояниеТСД.РаботникСклада) КАК РаботникСклада
		|ПОМЕСТИТЬ ДанныиеИнвентаризацииЯчеек
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеПоОследнейИнвентаризацииЯчейки.Ячейка КАК Ячейка,
		|		ДанныеПоОследнейИнвентаризацииЯчейки.ДатаИнвентаризации КАК ДатаИнвентаризации,
		|		МАКСИМУМ(итWMSСостояниеТСД.Период) КАК ДатаСосотояниТСД,
		|		ДанныеПоОследнейИнвентаризацииЯчейки.ДокументОбработки КАК ДокументОбработки,
		|		ДанныеПоОследнейИнвентаризацииЯчейки.ТСД КАК ТСД
		|	ИЗ
		|		ДанныеПоОследнейИнвентаризацииЯчейки КАК ДанныеПоОследнейИнвентаризацииЯчейки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.итWMSСостояниеТСД КАК итWMSСостояниеТСД
		|			ПО ДанныеПоОследнейИнвентаризацииЯчейки.ТСД = итWMSСостояниеТСД.ТСД
		|				И ДанныеПоОследнейИнвентаризацииЯчейки.ДатаИнвентаризации >= итWMSСостояниеТСД.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДанныеПоОследнейИнвентаризацииЯчейки.Ячейка,
		|		ДанныеПоОследнейИнвентаризацииЯчейки.ДатаИнвентаризации,
		|		ДанныеПоОследнейИнвентаризацииЯчейки.ДокументОбработки,
		|		ДанныеПоОследнейИнвентаризацииЯчейки.ТСД) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.итWMSСостояниеТСД КАК итWMSСостояниеТСД
		|		ПО ВложенныйЗапрос.ТСД = итWMSСостояниеТСД.ТСД
		|			И ВложенныйЗапрос.ДатаСосотояниТСД = итWMSСостояниеТСД.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ячейка,
		|	ВложенныйЗапрос.ДатаИнвентаризации,
		|	ВложенныйЗапрос.ДатаСосотояниТСД,
		|	ВложенныйЗапрос.ДокументОбработки,
		|	ВложенныйЗапрос.ДокументОбработки.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныиеИнвентаризацииЯчеек.Ячейка КАК Ячейка,
		|	МАКСИМУМ(ЕСТЬNULL(ДанныиеИнвентаризацииЯчеек.ДатаИнвентаризации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаИнвентаризации,
		|	МАКСИМУМ(ЕСТЬNULL(ДанныиеИнвентаризацииЯчеек.ДокументОбработки, ЗНАЧЕНИЕ(Документ.итWmsДанныеИнвентаризации.ПустаяСсылка))) КАК ДанныеИнвентаризации,
		|	МАКСИМУМ(ЕСТЬNULL(ДанныиеИнвентаризацииЯчеек.ДокументОбработкиОтветственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))) КАК Ответственный,
		|	МАКСИМУМ(ЕСТЬNULL(ДанныиеИнвентаризацииЯчеек.РаботникСклада, ЗНАЧЕНИЕ(Справочник.итwmsРаботникиСклада.ПустаяСсылка))) КАК РаботникСклада
		|ПОМЕСТИТЬ ВТИтога
		|ИЗ
		|	ДанныиеИнвентаризацииЯчеек КАК ДанныиеИнвентаризацииЯчеек
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныиеИнвентаризацииЯчеек.Ячейка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	итСкладскиеЯчейки.Ссылка,
		|	МАКСИМУМ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
		|	МАКСИМУМ(ЗНАЧЕНИЕ(Документ.итWmsДанныеИнвентаризации.ПустаяСсылка)),
		|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)),
		|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.итWMSРаботникиСклада.ПустаяСсылка))
		|ИЗ
		|	Справочник.итСкладскиеЯчейки КАК итСкладскиеЯчейки
		|ГДЕ
		|	итСкладскиеЯчейки.ЭтоГруппа = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	итСкладскиеЯчейки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИтога.Ячейка,
		|	МАКСИМУМ(ВТИтога.ДатаИнвентаризации) КАК ДатаИнвентаризации,
		|	МАКСИМУМ(ВТИтога.ДанныеИнвентаризации) КАК ДанныеИнвентаризации,
		|	МАКСИМУМ(ВТИтога.Ответственный) КАК Ответственный,
		|	МАКСИМУМ(ВТИтога.РаботникСклада) КАК РаботникСклада
		|ПОМЕСТИТЬ ВтИтовГруппировка
		|ИЗ
		|	ВТИтога КАК ВТИтога
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИтога.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтИтовГруппировка.Ячейка,
		|	ВтИтовГруппировка.ДатаИнвентаризации,
		|	ВтИтовГруппировка.ДанныеИнвентаризации,
		|	ВтИтовГруппировка.Ответственный КАК ОтветственныйСотрудник,
		|	ВтИтовГруппировка.РаботникСклада
		|ИЗ
		|	ВтИтовГруппировка КАК ВтИтовГруппировка";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
 
       
    ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ДанныеИнвентаризацииЯчеек",РезультатЗапроса);
    
    //Инициализируем процессор компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
    //<--------------------------------------------------------------------------------------->//
    //Очищаем документ результата
    ДокументРезультат.Очистить();
    
    //Выводим отчет в документ
    ПроцессорВывода = Новый
    ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
КонецПроцедуры
