// Процедура - Получить краткую информацию отгрузки
//
// Параметры:
//  Ссылка			 - ДокументСсылка.итWMSОтгрузка	- ссылка на документ отгрузки 
//  СтруктураДанных	 - Структура - структура для заполнения 
//
Процедура  ПолучитьКраткуюИнформациюОтгрузки(Ссылка,СтруктураДанных) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSОтгрузкаТовары.Номенклатура,
		|	итWMSОтгрузкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент,
		|	итWMSОтгрузкаТовары.Количество КАК Количество,
		|	итWMSОтгрузкаТовары.Количество / ВЫБОР
		|		КОГДА ЕСТЬNULL(итWMSОтгрузкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(итWMSОтгрузкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент, 1)
		|	КОНЕЦ КАК КоличествоМест,
		|	итWMSОтгрузкаТовары.Ссылка КАК Ссылка,
		|	итWMSОтгрузкаТовары.Наборка КАК Наборка
		|ИЗ
		|	Документ.итWMSОтгрузка.Товары КАК итWMSОтгрузкаТовары
		|ГДЕ
		|	итWMSОтгрузкаТовары.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(КоличествоМест)
		|ПО
		|	Ссылка,
		|	Наборка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		СтруктураДанных.Вставить("КоличествоВсего",ВыборкаСсылка.Количество);	
		СтруктураДанных.Вставить("КоличествоМестВсего",ВыборкаСсылка.КоличествоМест);
		ВыборкаНаборка = ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	    Счетчик=0;
		Пока ВыборкаНаборка.Следующий() Цикл
		СтруктураДанныхНаборки=новый Структура;
		СтруктураДанныхНаборки.Вставить("ИдентификаторНаборки",ВыборкаНаборка.Наборка.УникальныйИдентификатор());
		СтруктураДанныхНаборки.Вставить("КоличествоВсего",ВыборкаНаборка.Количество);	
		СтруктураДанныхНаборки.Вставить("КоличествоМестВсего",ВыборкаНаборка.КоличествоМест);
		СтруктураДанных.Вставить("Наборка"+Строка(Счетчик),СтруктураДанныхНаборки);	
		Счетчик=Счетчик+1;
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры


Процедура ВнестиИзменениеДанныхТСДВДокумент(Документ) Экспорт 
	итWMSОбработчикДанныхОтгрузки.ВнестиИзмененияВДокументОтгрузки(Документ);
	КонецПроцедуры