
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
   	    Возврат;
   КонецЕсли;
	Если НаличиеДокументовНаТекущуДатуНачисленияИСмену() Тогда 
		Отказ=Истина;
	КонецЕсли;	
	Если не ПроверитьЗаполнение() Тогда 
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

Функция НаличиеДокументовНаТекущуДатуНачисленияИСмену()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ДополнительныеНачисления КАК ДополнительныеНачисления
		|ГДЕ
		|	ДополнительныеНачисления.Ссылка <> &Ссылка
		|	И ДополнительныеНачисления.ДатаНачисления = &ДатаНачисления
		|	И ДополнительныеНачисления.Смена = &Смена
		|	И ДополнительныеНачисления.Проведен";
	
	Запрос.УстановитьПараметр("ДатаНачисления", ДатаНачисления);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщение=новый СообщениеПользователю();
		Сообщение.Текст="на текущую дату начисления уже имеется регистратор "+Строка(ВыборкаДетальныеЗаписи.Ссылка);
		Сообщение.Сообщить();
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если не Согласованно Тогда 
		Возврат
	КонецЕсли;	
	ДополнительныеНачисленияРаботниковСклада=Движения.ДополнительныеНачисленияРаботниковСклада;
	ДополнительныеНачисленияРаботниковСклада.Записывать=Истина;
	Для Каждого стр из Начисления Цикл 
		Запись=ДополнительныеНачисленияРаботниковСклада.Добавить();
		Запись.ВидДополнительныхРабот=стр.ВидДополнительныхРабот;
		Запись.ДатаНачисления=ДатаНачисления;
		Запись.Начислено=стр.НачисленоФакт;
		Запись.Регистратор=Ссылка;
		Запись.Организация=Организация;
		Запись.РаботникСклада=Стр.РаботникСклада;
		Запись.Согласовал=Согласовал;
		Запись.Смена=Смена;
	КонецЦикла;
	ДополнительныеНачисленияРаботниковСклада.Записать();
КонецПроцедуры
#КонецЕсли
