&НаСервере
Процедура СтатусРегламетногоЗадания()
	Задание=РегламентныеЗадания.НайтиПредопределенное("ит_WMS_УдалениеЛога");
	Если Задание.Использование Тогда 
		Элементы.ХелперСтатусаРаботыЗадания.Заголовок="Регламетное задание запущено";
		Элементы.ХелперСтатусаРаботыЗадания.ЦветТекста=WebЦвета.Зеленый;
	иначе
		Элементы.ХелперСтатусаРаботыЗадания.Заголовок="Регламетное задание выключено";
		Элементы.ХелперСтатусаРаботыЗадания.ЦветТекста=WebЦвета.Красный;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Значение=итWMSПривилегированныйМодуль.ПолучитьНастройкиЛогирования();
	Если ТипЗнч(Значение)=Тип("Структура") тогда
		СписокРеквизитов=ПолучитьРеквизиты();
		для Каждого Рекв из СписокРеквизитов цикл
				
			Если Значение.Свойство(Рекв.Имя) тогда
				Если ТипЗнч(Значение[Рекв.Имя])=тип("ТаблицаЗначений") тогда
					ЭтаФорма[Рекв.Имя].Загрузить(Значение[Рекв.Имя]);
				иначе
					ЭтаФорма[Рекв.Имя]=Значение[Рекв.Имя];
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		//ЗаполнитьЗначенияСвойств(ЭтаФорма,Значение);
	КонецЕсли;	
	СтатусРегламетногоЗадания();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	СписокРеквизитов=ПолучитьРеквизиты();
	СтруктураХраненияДанных=новый Структура;
	для Каждого Рекв из СписокРеквизитов цикл
		Если Рекв.Имя="Объект" тогда
			Продолжить;
		КонецЕсли;	
		Если ТипЗнч(ЭтаФорма[Рекв.Имя])=Тип("ДанныеФормыКоллекция") тогда
			СтруктураХраненияДанных.Вставить(Рекв.Имя,ЭтаФорма[Рекв.Имя].Выгрузить());
		иначе
			СтруктураХраненияДанных.Вставить(Рекв.Имя,ЭтаФорма[Рекв.Имя]);
		КонецЕсли;
	КонецЦикла;
	итWMSПривилегированныйМодуль.СохранитьНайстрокиЛогирования(СтруктураХраненияДанных);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Запустить(Команда)
ЗапуститьНаСервере();
СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьНаСервере()
Задание=РегламентныеЗадания.НайтиПредопределенное("ит_WMS_УдалениеЛога");
Задание.Использование=Истина;
Задание.Записать();
СтатусРегламетногоЗадания();
КонецПроцедуры

&НаСервере
Процедура ОстановитьНаСервере()
	Задание=РегламентныеЗадания.НайтиПредопределенное("ит_WMS_УдалениеЛога");
	Задание.Использование=Ложь;
	Задание.Записать();
	СтатусРегламетногоЗадания();
КонецПроцедуры

&НаКлиенте
Процедура Остановить(Команда)
	ОстановитьНаСервере();
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВсремяХраненияЛогаТСДВДняхПриИзменении(Элемент)
	Если ВремяХраненияЛогаТСДВДнях <1 Тогда 
		 ВремяХраненияЛогаТСДВДнях=1
	КонецЕсли;	 
КонецПроцедуры
&НаКлиенте
Процедура ИспользоватьЛогированиеТСДПриИзменении(Элемент)
	Если ВремяХраненияЛогаТСДВДнях <1 Тогда 
		 ВремяХраненияЛогаТСДВДнях=1
	КонецЕсли;
КонецПроцедуры
