
&НаКлиенте
Процедура итWMSСписаниеТовара(Команда)
	ОткрытьФорму("Документ.итWMSСписаниеТовара.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSРучноеРазмещение(Команда)
	ОткрытьФорму("Документ.итWMSРучноеРазмещение.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSРучнаяОтгрузка(Команда)
	ОткрытьФорму("Документ.итWMSРучнаяОтгрузка.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура итWMSРучноеПеремещение(Команда)
	ОткрытьФорму("Документ.итWMSРучноеПеремещение.Форма.ФормаСписка");
КонецПроцедуры
