Перем ОбработкаТСД Экспорт;
Перем СообщениеДляТСД Экспорт ; 
Перем ИгнорироватьОтказПриПроверках Экспорт ;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписей=РегистрыСведений.итWMS_АгрегацияМарок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	для Каждого стр из НаборЗаписей цикл
		стр.АктивностьЗаписи=Истина;
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения тогда
		НаборЗаписей=РегистрыСведений.итWMS_АгрегацияМарок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОснование.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		для Каждого стр из НаборЗаписей цикл
			стр.АктивностьЗаписи=Ложь;
			Марка=СсылкаМарки (стр.Марка);
			Если Марка<>Неопределено Тогда
			стр.МаркаСсылка=Марка;	
			КонецЕсли;	
		КонецЦикла;
		НаборЗаписей.Записать();		
	КонецЕсли;
КонецПроцедуры

Функция СсылкаМарки (Марка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Марки.Ссылка
		|ИЗ
		|	Справочник.Марки КАК Марки
		|ГДЕ
		|	Марки.ЗначениеШтрихКода = &ЗначениеШтрихКода";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихКода", Марка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции
