
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Значение=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилища();
	Если ТипЗнч(Значение)=Тип("Структура") тогда
		СписокРеквизитов=ПолучитьРеквизиты();
		для Каждого Рекв из СписокРеквизитов цикл
				
			Если Значение.Свойство(Рекв.Имя) тогда
				Если ТипЗнч(Значение[Рекв.Имя])=тип("ТаблицаЗначений") тогда
					ЭтаФорма[Рекв.Имя].Загрузить(Значение[Рекв.Имя]);
				иначе
					ЭтаФорма[Рекв.Имя]=Значение[Рекв.Имя];
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		//ЗаполнитьЗначенияСвойств(ЭтаФорма,Значение);
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	Значение=итWMSПривилегированныйМодуль.ПолучитьНастройкиИзХранилища();
	Если ТипЗнч(Значение)=Тип("Структура") тогда
		Значение.Вставить("СписокСкладовДляПеремещенияВСток",СписокСкладовДляПеремещенияВСток.Выгрузить());
	иначе
		Значение=новый Структура("СписокСкладовДляПеремещенияВСток",СписокСкладовДляПеремещенияВСток.Выгрузить());
	КонецЕсли;	
	итWMSПривилегированныйМодуль.СохранитьНастройкиВХранилище(Значение);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	ВладелецФормы.ПодтянутьДанныеСписокаСкладовДляПеремещенияВСток();
	ЭтаФорма.Закрыть();
КонецПроцедуры
