
Функция GetAcceptanceGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON=итWMSПривилегированныйМодуль.РассчетСветофораПриемка();
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
КонецФункции

Функция GetDialGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON=итWMSПривилегированныйМодуль.РассчетДанныхНаборки();
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
КонецФункции

Функция GetDataDialGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON=итWMSПривилегированныйМодуль.ДанныеСветофораНаборкиJSON();
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
КонецФункции

Функция GetCheckingShipmentGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON=итWMSПривилегированныйМодуль.РассчетСветофораПроверка();
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;

КонецФункции

Функция GetDataCheckingShipmentGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON=итWMSПривилегированныйМодуль.ДанныеСветофораПроверкаJSON();
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
КонецФункции

Функция GetShipmentGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON=итWMSПривилегированныйМодуль.РассчетСветофораОтгрузка();
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
КонецФункции

Функция GetDataShipmentGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON=итWMSПривилегированныйМодуль.ДанныеСветофораОтгрузка();
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
КонецФункции
