Процедура ЦентральныйОбработчикДанныхРазмещения(ДанныеОбработчика)Экспорт
   	Если  итWMSСлужебныеПроцедурыИФункции.ТиповойОбработчикВыявленияОшибок(ДанныеОбработчика,"КлючИнициализацииДанных") тогда
		Возврат
	КонецЕсли;  
	Если итWMSСлужебныеПроцедурыИФункции.ТиповойОбработчикВыявленияОшибок(ДанныеОбработчика,"СостояниеИнициализации")   тогда
		Возврат
	КонецЕсли;	
    Если итWMSСлужебныеПроцедурыИФункции.ТиповойОбработчикВыявленияОшибок(ДанныеОбработчика,"ТипОбработкиДанных") тогда
		Возврат
	КонецЕсли;
	Если  ДанныеОбработчика.ТипОбработкиДанных="ВнесениеИзмененийВДокумент" тогда
		////////////Транзакция фиксируется псоле инициализации задачи
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		///////
		ВнестиИзмененияВДокумент(ДанныеОбработчика);
		итWMSОбработчикиРегистрации_И_Загрузки.ИнициализацияДанныхНаСервере(ДанныеОбработчика);
		Если ДанныеОбработчика.Свойство("Статус") тогда
			Если ДанныеОбработчика.Статус=404 тогда
				Возврат
			КонецЕсли;
		КонецЕсли;	
		ЗафиксироватьТранзакцию();
    КонецЕсли;
КонецПроцедуры
	
Процедура ВнестиИзмененияВДокумент(ДанныеОбработчика)
	ИдУпаковкиИДокумент=итWMSСлужебныеПроцедурыИФункции.НайтиДанныеЗадачиПоИдЗадачи(ДанныеОбработчика.КлючИнициализацииДанных);
    Если ИдУпаковкиИДокумент=Неопределено тогда
	ДанныеОбработчика.Вставить("Статус",404);
	ДанныеОбработчика.Вставить("ОписаниеОшибки","не найденно данных по ид задачи");
	Возврат
    КонецЕсли;
    СостояниеЗадачи=ДанныеОбработчика.СостояниеИнициализации;
    ИдентификаторУпаковки=ИдУпаковкиИДокумент.ИдентификаторУпаковки;
    ОбъектДокумента=ИдУпаковкиИДокумент.ДокументОснование.ПолучитьОбъект();
    МассиСтрокКИзменению=ОбъектДокумента.Товары.НайтиСтроки(новый Структура("ИдентификаторУпаковки",ИдентификаторУпаковки));
	для Каждого СтрокаКИзменению из МассиСтрокКИзменению цикл
		СтрокаКИзменению.СостояниеЗадачи=СостояниеЗадачи;
	КонецЦикла;
	Попытка
//		ОбъектДокумента.ОбработкаТСД=Истина;
//		ОбъектДокумента.СообщениеДляТСД="";
		ОбъектДокумента.Записать();
	Исключение
		ДанныеОбработчика.Вставить("Статус",404);
	    ДанныеОбработчика.Вставить("ОписаниеОшибки",ОбъектДокумента.СообщениеДляТСД +"  "+ ОписаниеОшибки());
	КонецПопытки;
	КонецПроцедуры
	
	

	
// Процедура - Внесение изменений в документ размещения
//
// Параметры:
//  Документ - ДокументСсылка - документ для изменения данных 
//
Процедура ВнесениеИзмененийВДокументРазмещения(Документ) Экспорт 
	РезультатЗапроса=итWMSСлужебныеПроцедурыИФункции.ПолучитьРезультатЗапросаИзмененияДанныхЗадачИСтрокТСД(Документ);
	Выборка=РезультатЗапроса.Выбрать();
	ОбъектДокумента=Документ.ПолучитьОбъект();
	Пока Выборка.Следующий() Цикл 	
			МассивСтрок=ОбъектДокумента.Товары.НайтиСтроки(новый Структура("ИдентификаторСтроки",Выборка.идСтроки));
			Для Каждого стр из МассивСтрок Цикл
				стр.СостояниеЗадачи= Выборка.Состояние;
			КонецЦикла;
		КонецЦикла;
	ОбъектДокумента.ОбменДанными.Загрузка=Истина;
	ОбъектДокумента.Записать();
КонецПроцедуры