
&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)

	//@skip-check event-heandler-boolean-param
	Отказ=ПроверкаНаВозможностьУдаления(Элемент.ТекущиеДанные.ДиапазонС,Элемент.ТекущиеДанные.ДиапазонПо);
	Если  Отказ тогда
		Сообщение=новый СообщениеПользователю();
		Сообщение.Текст="Вы не можите удалить данную настройку,т.к по ней уже имеются SSCC";
		Сообщение.Сообщить();
	КонецЕсли;	

КонецПроцедуры
&НаСервере
Функция ПроверкаНаВозможностьУдаления(ДиапазонС,ДиапазонПо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSАрхивSSCC.SSCC
		|ИЗ
		|	РегистрСведений.итWMSАрхивSSCC КАК итWMSАрхивSSCC
		|ГДЕ
		|	итWMSАрхивSSCC.ИдентификаторSSCC МЕЖДУ &ДиапазонС И &ДиапазонПо";
	
	Запрос.УстановитьПараметр("ДиапазонПо", ДиапазонПо);
	Запрос.УстановитьПараметр("ДиапазонС", ДиапазонС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		Возврат Ложь;
	иначе
		Возврат Истина;
	КонецЕсли;	

	
	КонецФункции