#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивЯчеекИсключения=новый Массив;
	Если Параметры.Свойство("МассивЯчеекИсключения") Тогда 
		МассивЯчеекИсключения=Параметры.МассивЯчеекИсключения;
	КонецЕсли;	
	ЭлементыЯчеек.Параметры.УстановитьЗначениеПараметра("МассивЯчеекИсключения",МассивЯчеекИсключения);
	УстановитьЯчейкиИсключенияПодбора();
	ЭлементыЯчеек.Параметры.УстановитьЗначениеПараметра("ЭлементИерархии","");
КонецПроцедуры

&НаКлиенте
Процедура ИерархияЯчеекПриАктивизацииСтроки(Элемент)
	Если Элементы.ИерархияЯчеек.ТекущиеДанные=Неопределено Тогда
	ЭлементыЯчеек.Параметры.УстановитьЗначениеПараметра("ЭлементИерархии","");
		иначе
	ЭлементыЯчеек.Параметры.УстановитьЗначениеПараметра("ЭлементИерархии",Элементы.ИерархияЯчеек.ТекущиеДанные.Ячейка);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ЭлементыЯчеекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка=Ложь;
		для Каждого Строка из Элементы.ЭлементыЯчеек.ВыделенныеСтроки цикл
			ДанныеСтроки=Элементы.ЭлементыЯчеек.ДанныеСтроки(Строка);
			Корзина.Добавить().Ячейка=ДанныеСтроки.Ссылка;
		КонецЦикла;
		УстановитьЯчейкиИсключенияПодбора();
		Элементы.ЭлементыЯчеек.ВыделенныеСтроки.Очистить();
КонецПроцедуры
&НаКлиенте
Процедура КорзинаПослеУдаления(Элемент)
		УстановитьЯчейкиИсключенияПодбора();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКоманд
&НаСервере
Функция  ЗавершитьВыборНаСервере()
	Возврат новый Структура("МассивЯчеек",Корзина.Выгрузить().ВыгрузитьКолонку("Ячейка"));
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыбор(Команда)
	//ОткрытьФорму("Справочник.ит_WMS_АссортиментныеУчасткиСклада.Форма.ФормаВыбораСкладскойДеятельности",,ЭтаФорма);
		ОповеститьОВыборе(ЗавершитьВыборНаСервере());
КонецПроцедуры


 #КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЯчейкиИсключенияПодбора()
	ЯчейкиИсключения=Корзина.Выгрузить().ВыгрузитьКолонку("Ячейка");
	ЭлементыЯчеек.Параметры.УстановитьЗначениеПараметра("ЯчейкиИсключения",ЯчейкиИсключения);

	КонецПроцедуры






#КонецОбласти
