
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ИдентификаторУпаковки") Тогда 
		Отказ=Истина;
		Сообщить("нет идентификатора упаковки");
		Возврат
	КонецЕсли;
	ЗаполнитьДаннымиПоИдентификаторУпаковки(Параметры.ИдентификаторУпаковки);
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДаннымиПоИдентификаторУпаковки(ИдентификаторУпаковки)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSРазмещениеТовары.Ссылка.Номер КАК НомерРазмещения,
		|	итWMSРазмещениеТовары.Ссылка.Дата,
		|	итWMSРазмещениеТовары.ИдентификаторУпаковки,
		|	итWMSРазмещениеТовары.Номенклатура,
		|	итWMSРазмещениеТовары.СерияНоменклатуры,
		|	итWMSРазмещениеТовары.Качество,
		|	итWMSРазмещениеТовары.Количество,
		|	итWMSРазмещениеТовары.ЯчейкаПолучатель,
		|	итWMSРазмещениеТовары.КарантинПаллеты,
		|	итWMSРазмещениеТовары.Склад,
		|	итWMSРазмещениеТовары.Комментарий
		|ИЗ
		|	Документ.итWMSРазмещение.Товары КАК итWMSРазмещениеТовары
		|ГДЕ
		|	итWMSРазмещениеТовары.Ссылка.Проведен = ИСТИНА
		|	И итWMSРазмещениеТовары.ИдентификаторУпаковки = &ИдентификаторУпаковки
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSРазмещениеТовары.Ссылка.Номер,
		|	итWMSРазмещениеТовары.Ссылка.Дата,
		|	итWMSРазмещениеТовары.ИдентификаторУпаковки,
		|	итWMSРазмещениеТовары.Номенклатура,
		|	итWMSРазмещениеТовары.СерияНоменклатуры,
		|	итWMSРазмещениеТовары.Качество,
		|	итWMSРазмещениеТовары.Количество,
		|	итWMSРазмещениеТовары.ЯчейкаПолучатель,
		|	итWMSРазмещениеТовары.КарантинПаллеты,
		|	итWMSРазмещениеТовары.Склад,
		|	итWMSРазмещениеТовары.Комментарий";
	
	Запрос.УстановитьПараметр("ИдентификаторУпаковки", ИдентификаторУпаковки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ТаблицаДанных.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НоваяСтрока=ТаблицаДанных.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
